{
	"directory": {
		"directoryID": "786643e3-3fe2-4988-aa64-26a3f07f2e04",
		"name": "Credential Engine Competency Registry",
		"dateCreated": "2020-08-18"
	},
	"framework": {
		"frameworkURL": "https://credentialengineregistry.org/resources/ce-9fa74630-e74b-451b-85f0-95868abcbaa5",
		"name": {
			"en-us": "NICE Cybersecurity Workforce Framework: Abilities"
		},
		"description": {
			"en-us": "The National Initiative for Cybersecurity Education (NICE) Cybersecurity Workforce Framework components provide the means to identify work roles and related knowledge, skills, abilities and tasks of cybersecurity work. Ability is defined as competence to perform an observable behavior or a behavior that results in an observable product. Current version as of January 18, 2018."
		},
		"attributionName": "Credential Engine",
		"attributionURL": "https://credentialengine.org",
		"providerMetaModel": "https://ocf-collab.org/concepts/6ad27cff-5832-4b3d-bd3e-892208b80cad",
		"beneficiaryRights": "https://credentialengine.org/terms/",
		"registryRights": "https://ocf-collab.org/rights/29905411-553e-4872-9baf-e401dac157d2",
		"conceptKeyword": {
			"en-us": [
				"cybersecurity",
				"cyberspace",
				"education",
				"role",
				"specialty area",
				"ability"
			]
		}
	},
	"competencies": [
		{
			"competencyText": {
				"en-us": "Ability to identify systemic security issues based on the analysis of vulnerability and configuration data."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to match the appropriate knowledge repository technology for a given application or environment."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to determine the validity of technology trend data."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop curriculum that speaks to the topic at the appropriate level for the target audience."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to decrypt digital data collections."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to prepare and deliver education and awareness briefings to ensure that systems, network, and data users are aware of and adhere to systems security policies and procedures."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to tailor code analysis for application-specific concerns."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply the methods, standards, and approaches for describing, analyzing, and documenting an organization's enterprise information technology (IT) architecture (e.g., Open Group Architecture Framework [TOGAF], Department of Defense Architecture Framework [DoDAF], Federal Enterprise Architecture Framework [FEAF])."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply supply chain risk management standards."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to analyze malware."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to answer questions in a clear and concise manner."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to ask clarifying questions."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to communicate complex information, concepts, or ideas in a confident and well-organized manner through verbal, written, and/or visual means."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to communicate effectively when writing."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to conduct vulnerability scans and recognize vulnerabilities in security systems."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to facilitate small group discussions."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to gauge learner understanding and knowledge level."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to prepare and present briefings."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to produce technical documentation."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to provide effective feedback to students for improving learning."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to use and understand complex mathematical concepts (e.g., discrete math)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply principles of adult learning."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to design valid and reliable assessments."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop clear directions and instructional materials."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to accurately define incidents, problems, and events in the trouble ticketing system."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to analyze test data."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply an organization's goals and objectives to develop and maintain architecture."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to assess and forecast manpower requirements to meet organizational objectives."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to build complex data structures and high-level programming languages."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to collect, verify, and validate test data."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to conduct and implement market research to understand government and industry capabilities and appropriate pricing."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop curriculum for use within a virtual environment."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop policy, plans, and strategy in compliance with laws, regulations, policies, and standards in support of organizational cyber activities."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop, update, and/or maintain standard operating procedures (SOPs)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to dissect a problem and examine the interrelationships between data that may appear unrelated."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to identify basic common coding flaws at a high level."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to leverage best practices and lessons learned of external organizations and academic institutions dealing with cyber issues."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to optimize systems to meet enterprise performance requirements."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to oversee the development and update of the life cycle cost estimate."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to translate data and test results into evaluative conclusions."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to use data visualization tools (e.g., Flare, HighCharts, AmCharts, D3.js, Processing, Google Visualization API, Tableau, Raphael.js)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop career path opportunities."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to conduct forensic analyses in and for both Windows and Unix/Linux environments."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply programming language structures (e.g., source code review) and logic."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to evaluate/ensure the trustworthiness of the supplier and/or product."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to monitor and assess the potential impact of emerging technologies on laws, regulations, and/or policies."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop secure software according to secure software deployment methodologies, tools, and practices."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply network security architecture concepts including topology, protocols, components, and principles (e.g., application of defense-in-depth)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply secure system design tools, methods and techniques."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply system design tools, methods, and techniques, including automated systems analysis and design tools."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to execute technology integration processes."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to operate network equipment including hubs, routers, switches, bridges, servers, transmission media, and related hardware."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to determine the validity of workforce trend data."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply the Instructional System Design (ISD) methodology."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to operate common network tools (e.g., ping, traceroute, nslookup)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to ensure security practices are followed throughout the acquisition process."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to tailor curriculum that speaks to the topic at the appropriate level for the target audience."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to execute OS command line (e.g., ipconfig, netstat, dir, nbtstat)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to operate the organization's LAN/WAN pathways."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to build architectures and frameworks."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to design architectures and frameworks."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to monitor measures or indicators of system performance and availability."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to operate different electronic communication systems and methods (e.g., e-mail, VOIP, IM, web forums, Direct Video Broadcasts)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to interpret and translate customer requirements into operational capabilities."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to monitor traffic flows across the network."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to accurately and completely source all data used in intelligence, assessment and/or planning products."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to adjust to and operate in a diverse, unpredictable, challenging, and fast-paced work environment."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply approved planning development and staffing processes."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply collaborative skills and strategies."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply critical reading/thinking skills."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply language and cultural expertise to analysis."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to clearly articulate intelligence requirements into well-formulated research questions and data tracking variables for inquiry tracking purposes."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to clearly articulate intelligence requirements into well-formulated research questions and requests for information."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to collaborate effectively with others."
			}
		},
		{
			"competencyText": {
				"en-us": "WITHDRAWN: Ability to communicate complex information, concepts, or ideas in a confident and well-organized manner through verbal, written, and/or visual means."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate and collaborate with analysts regarding surveillance requirements and essential information development."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate cyber operations with other organization functions or support activities."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate, collaborate and disseminate information to subordinate, lateral and higher-level organizations."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to correctly employ each organization or element into the collection plan and matrix."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop or recommend analytic approaches or solutions to problems and situations for which information is incomplete or for which no precedent exists."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop or recommend planning solutions to problems and situations for which no precedent exists."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to effectively collaborate via virtual teams."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to evaluate information for reliability, validity, and relevance."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to evaluate, analyze, and synthesize large quantities of data (which may be fragmented and contradictory) into high quality, fused targeting/intelligence products."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to exercise judgment when policies are not well-defined."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to expand network access by conducting target analysis and collection to identify targets of interest."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to focus research efforts to meet the customer’s decision-making needs."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to function effectively in a dynamic, fast-paced environment."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to function in a collaborative environment, seeking continuous consultation with other analysts and experts—both internal and external to the organization—to leverage analytical and technical expertise."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to identify external partners with common cyber operations interests."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to identify intelligence gaps."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to identify/describe target vulnerability."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to identify/describe techniques/methods for conducting technical exploitation of the target."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to interpret and apply laws, regulations, policies, and guidance relevant to organization cyber objectives."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to interpret and translate customer requirements into operational action."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to interpret and understand complex and rapidly evolving concepts."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to monitor system operations and react to events in response to triggers and/or observation of trends or unusual activity."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to participate as a member of planning teams, coordination groups, and task forces as necessary."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to perform network collection tactics, techniques, and procedures to include decryption capabilities/tools."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to perform wireless collection procedures to include decryption capabilities/tools."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to recognize and mitigate cognitive biases which may affect analysis."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to recognize and mitigate deception in reporting and analysis."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to review processed target language materials for accuracy and completeness."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to select the appropriate implant to achieve operational goals."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to tailor technical and planning information to a customer’s level of understanding."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to think critically."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to think like threat actors."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to understand objectives and effects."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to utilize multiple intelligence sources across all intelligence disciplines."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to monitor advancements in information privacy laws to ensure organizational adaptation and compliance."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to work across departments and business units to implement organization’s privacy principles and programs, and align privacy objectives with security objectives."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to monitor advancements in information privacy technologies to ensure organizational adaptation and compliance."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to determine whether a security incident violates a privacy principle or legal standard requiring specific legal action."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to develop or procure curriculum that speaks to the topic at the appropriate level for the target."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to work across departments and business units to implement organization’s privacy principles and programs, and align privacy objectives with security objectives."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to prioritize and allocate cybersecurity resources correctly and efficiently."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to relate strategy, business, and technology in the context of organizational dynamics."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to understand technology, management, and leadership issues related to organization processes and problem solving."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to understand the basic concepts and issues related to cyber and its organizational impact."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to share meaningful insights about the context of an organization’s threat environment that improve its risk management posture."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to design incident response for cloud service models."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to design capabilities to find solutions to less common and more complex system problems."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply cybersecurity and privacy principles to organizational requirements (relevant to confidentiality, integrity, availability, authentication, non-repudiation)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to establish and maintain automated security control assessments"
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to author a privacy disclosure statement based on current laws."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to track the location and configuration of networked devices and software across departments, locations, facilities and, potentially, supporting business functions."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to deploy continuous monitoring technologies and tools."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to apply techniques for detecting host and network-based intrusions using intrusion detection technologies."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to ensure information security management processes are integrated with strategic and operational planning processes."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to ensure that senior officials within the organization provide information security for the information and systems that support the operations and assets under their control."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to ensure the organization has adequately trained personnel to assist in complying with security requirements in legislation, Executive Orders, policies, directives, instructions, standards, and guidelines."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate with senior leadership of an organization to provide a comprehensive, organization-wide, holistic approach for addressing risk—an approach that provides a greater understanding of the integrated operations of the organization."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate with senior leadership of an organization to develop a risk management strategy for the organization providing a strategic view of security-related risks for the organization."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate with senior leadership of an organization to facilitate the sharing of risk-related information among authorizing officials and other senior leaders within the organization."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate with senior leadership of an organization to provide oversight for all risk management-related activities across the organization to help ensure consistent and effective risk acceptance decisions."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate with senior leadership of an organization to ensure that authorization decisions consider all factors necessary for mission and business success."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate with senior leadership of an organization to provide an organization-wide forum to consider all sources of risk (including aggregated risk) to organizational operations and assets, individuals, other organizations, and the Nation."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate with senior leadership of an organization to promote cooperation and collaboration among authorizing officials to include authorization actions requiring shared responsibility."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate with senior leadership of an organization to ensure that the shared responsibility for supporting organizational mission/business functions using external providers of systems, services, and applications receives the needed visibility and is elevated to the appropriate decision-making authorities."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate with senior leadership of an organization to identify the organizational risk posture based on the aggregated risk from the operation and use of the systems for which the organization is responsible."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to work closely with authorizing officials and their designated representatives to help ensure that an organization-wide security program is effectively implemented resulting in adequate security for all organizational systems and environments of operation."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to work closely with authorizing officials and their designated representatives to help ensure that security considerations are integrated into programming/planning/budgeting cycles, enterprise architectures, and acquisition/system development life cycles."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to work closely with authorizing officials and their designated representatives to help ensure that organizational systems and common controls are covered by approved security plans and possess current authorizations."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to work closely with authorizing officials and their designated representatives to help ensure that security-related activities required across the organization are accomplished in an efficient, cost-effective, and timely manner."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to work closely with authorizing officials and their designated representatives to help ensure that there is centralized reporting of security-related activities."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to establish the rules for appropriate use and protection of the information and retains that responsibility even when the information is shared with or provided to other organizations."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to approve security plans, memorandums of agreement or understanding, plans of action and milestones, and determine whether significant changes in the systems or environments of operation require reauthorization."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to serve as the primary liaison between the enterprise architect and the systems security engineer and coordinates with system owners, common control providers, and system security officers on the allocation of security controls as system-specific, hybrid, or common controls."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability, in close coordination with system security officers, advise authorizing officials, chief information officers, senior information security officers, and the senior accountable official for risk management/risk executive (function), on a range of security-related issues (e.g. establishing system boundaries; assessing the severity of weaknesses and deficiencies in the system; plans of action and milestones; risk mitigation approaches; security alerts; and potential adverse effects of identified vulnerabilities)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to conduct systems security engineering activities (NIST SP 800-16)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to capture and refine security requirements and ensure that the requirements are effectively integrated into the component products and systems through purposeful security architecting, design, development, and configuration."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to employ best practices when implementing security controls within a system including software engineering methodologies; system and security engineering principles; secure design, secure architecture, and secure coding techniques."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to coordinate their security-related activities with security architects, senior information security officers, system owners, common control providers, and system security officers."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to conduct a comprehensive assessment of the management, operational, and technical security controls and control enhancements employed within or inherited by a system to determine the effectiveness of the controls (i.e., the extent to which the security controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting the security requirements for the system)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to provide an assessment of the severity of weaknesses or deficiencies discovered in the system and its environment of operation and recommend corrective actions to address identified vulnerabilities."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to prepare the final security assessment report containing the results and findings from the assessment."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to assesses a security plan to help ensure that the plan provides a set of security controls for the system that meet the stated security requirements."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to ensure that functional and security requirements are appropriately addressed in a contract and that the contractor meets the functional and security requirements as stated in the contract."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to interpret the information collected by network tools (e.g. Nslookup, Ping, and Traceroute)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to translate, track, and prioritize information needs and intelligence collection requirements across the extended enterprise."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to integrate information security requirements into the acquisition process; using applicable baseline security controls as one of the sources for security requirements; ensuring a robust software quality control process; and establishing multiple sources (e.g., delivery routes, for critical system elements)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to ensure information system security, acquisition personnel, legal counsel, and other appropriate advisors and stakeholders are participating in decision making from system concept definition/review and are involved in, or approve of, each milestone decision through the entire system life cycle for systems."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to recognize the unique aspects of the Communications Security (COMSEC) environment and hierarchy."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to interpret Communications Security (COMSEC) terminology, guidelines and procedures."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to identify the roles and responsibilities for appointed Communications Security (COMSEC) personnel."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to manage Communications Security (COMSEC) material accounting, control and use procedure."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to identify types of Communications Security (COMSEC) Incidents and how they’re reported."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to recognize the importance of auditing Communications Security (COMSEC) material and accounts."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to Identify the requirements of In-Process accounting for Communications Security (COMSEC)."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to identify critical infrastructure systems with information communication technology that were designed without system security considerations."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to conduct training and education needs assessment."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to set up a physical or logical sub-networks that separates an internal local area network (LAN) from other untrusted networks."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to recognize that changes to systems or environment can change residual risks in relation to risk appetite."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to find and navigate the dark web using the TOR network to locate markets and forums."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to examine digital media on multiple operating system platforms."
			}
		},
		{
			"competencyText": {
				"en-us": "Ability to maintain databases. (i.e., backup, restore, delete data, transaction log files, etc.)."
			}
		}
	]
}
