{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://teks-api.texasgateway.org/ims/case/v1p0/CFDocuments/77be5fce-c5e3-575b-9ae9-374f2f767ca4",
        "name": {"en-us": "Chapter 113. Ethnic Studies: Mexican American Studies"},
        "description": {"en-us": "Chapter 113. Ethnic Studies: Mexican American Studies"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyLabel": {"en-us": "Mexican American Studies"},
            "competencyText": {"en-us": "Ethnic Studies: Mexican American Studies (One Credit)."},
            "comment": {
                "en-us": ["Source: The provisions of this §113.50 adopted to be effective July 1, 2019, 44 TexReg 2265."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. This course is recommended for students in Grades 10-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "In Ethnic Studies: Mexican American Studies, an elective course, students learn about the history and cultural contributions of Mexican Americans. Students explore history and culture from an interdisciplinary perspective. The course emphasizes events in the 20th and 21st centuries, but students will also engage with events prior to the 20th century."}
        },
        {
            "competencyText": {"en-us": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary and secondary source material such as biographies, autobiographies, landmark cases of the U.S. Supreme Court, novels, speeches, letters, diaries, poetry, songs, and artwork is encouraged. Motivating resources are available from museums, historical sites, presidential libraries, and local and state preservation societies."}
        },
        {
            "competencyText": {"en-us": "The eight strands of the essential knowledge and skills for social studies are intended to be integrated for instructional purposes. Skills listed in the social studies skills strand in subsection (c) of this section should be incorporated into the teaching of all essential knowledge and skills for social studies. A greater depth of understanding of complex content material can be attained when integrated social studies content from the various disciplines and critical-thinking skills are taught together."}
        },
        {
            "competencyText": {"en-us": "Students identify the role of the U.S. free enterprise system within the parameters of this course and understand that this system may also be referenced as capitalism or the free market system."}
        },
        {
            "competencyText": {"en-us": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history; geography; economics; government; citizenship; culture; science, technology, and society; and social studies skills. The content, as appropriate for the grade level or course, enables students to understand the importance of patriotism, function in a free enterprise society, and appreciate the basic democratic values of our state and nation as referenced in the Texas Education Code (TEC), §28.002(h)."}
        },
        {
            "competencyText": {"en-us": "Students understand that a constitutional republic is a representative form of government whose representatives derive their authority from the consent of the governed, serve for an established tenure, and are sworn to uphold the constitution."}
        },
        {
            "competencyText": {"en-us": "State and federal laws mandate a variety of celebrations and observances, including Celebrate Freedom Week."}
        },
        {
            "competencyText": {"en-us": "Each social studies class shall include, during Celebrate Freedom Week as provided under the TEC, §29.907, or during another full school week as determined by the board of trustees of a school district, appropriate instruction concerning the intent, meaning, and importance of the Declaration of Independence and the U.S. Constitution, including the Bill of Rights, in their historical contexts. The study of the Declaration of Independence must include the study of the relationship of the ideas expressed in that document to subsequent American history, including the relationship of its ideas to the rich diversity of our people as a nation of immigrants, the American Revolution, the formulation of the U.S. Constitution, and the abolitionist movement, which led to the Emancipation Proclamation and the women's suffrage movement."}
        },
        {
            "competencyText": {"en-us": "Each school district shall require that, during Celebrate Freedom Week or other week of instruction prescribed under subparagraph (A) of this paragraph, students in Grades 3-12 study and recite the following text: \"We hold these Truths to be self-evident, that all Men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the Pursuit of Happiness--That to secure these Rights, Governments are instituted among Men, deriving their just Powers from the Consent of the Governed.\""}
        },
        {
            "competencyText": {"en-us": "Students identify and discuss how the actions of U.S. citizens and the local, state, and federal governments have either met or failed to meet the ideals espoused in the founding documents."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "History. The student understands historical points of reference in Mexican American history. The student is expected to apply absolute and relative chronology through the sequencing of significant individuals, events, and time periods."}
        },
        {
            "competencyText": {"en-us": "History. The student understands developments related to pre-colonial settlements and Spanish colonization of Mesoamerica and North America. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the significance of the following events as turning points relevant to Mexican American history: Aztec arrival in Mexico's central valley, establishment of the Aztec Empire, Hernán Cortéz's first encounter with the Aztecs, Spanish conquest of the Aztecs, creation of the New Laws, and Jesuit expulsion from the Americas; and"}
        },
        {
            "competencyText": {"en-us": "examine the contributions of significant individuals from the Spanish colonial era, including Moctezuma, Hernán Cortéz, La Malinche, Bartolomé de las Casas, and Sor Juana Inés de la Cruz."}
        },
        {
            "competencyText": {"en-us": "History. The student understands developments related to Mexican independence and Mexico's relationship with the United States from 1800-1930. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the significance of the following events as turning points relevant to Mexican American history: the Grito de Dolores, Mexico's acquisition of independence, Texas's declaration of independence from Mexico, Mexican-American War, Treaty of Guadalupe Hidalgo, Mexican Revolution, creation of the U.S. Border Patrol, and Mexican repatriation of the 1930s; and"}
        },
        {
            "competencyText": {"en-us": "examine the contributions of significant individuals from this period such as Father Miguel Hidalgo, José María Morelos, Augustín de Iturbide, Emiliano Zapata, Francisco (Pancho) Villa, Francisco Madero, Porfirio Díaz, and Álvaro Obregón."}
        },
        {
            "competencyText": {"en-us": "History. The student understands the causes and impact of the Mexican American civil rights movement from the 1940s to 1975. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the significance of the following events as turning points relevant to Mexican American history: U.S. entry into World War II, Bracero Program, Longoria Affair, Operation Wetback, Hernández v. Texas, Brown v. Board of Education, Civil Rights Act of 1964, Voting Rights Act of 1965, Farmworkers strike and boycott, and establishment of La Raza Unida Party; and"}
        },
        {
            "competencyText": {"en-us": "identify the contributions of significant individuals from the civil rights era such as César Chávez, Dolores Huerta, Reies López Tijerina, José Ángel Gutiérrez, Rubén Salazar, Emma Tenayuca, Rodolfo \"Corky\" Gonzáles, Marcario García, Héctor P. García, Roy Benavidez, and Martha P. Cotera."}
        },
        {
            "competencyText": {"en-us": "History. The student understands the development of voting rights and ideas related to citizenship for Mexican Americans from 1975 to the present. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the significance of the following events as turning points relevant to Mexican American history: the Immigration Reform and Control Act, Illegal Immigration Reform and Immigration Responsibility Act; and H.R. 4437 passed by the U.S. House of Representatives in 2006; and"}
        },
        {
            "competencyText": {"en-us": "identify the contributions of significant individuals such as Raul Yzaguirre, Willie Velásquez, Gloria Anzaldúa, Henry Cisneros, Cherrie L. Moraga, and Bill Richardson."}
        },
        {
            "competencyText": {"en-us": "Geography. The student understands the impact of geographic factors on major events related to Mexican Americans. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "locate places and regions of cultural and historical significance in Mexican American history;"}
        },
        {
            "competencyText": {"en-us": "identify physical and human geographic factors related to the settlement of American Indian societies;"}
        },
        {
            "competencyText": {"en-us": "explain how issues of land use related to Mexican Independence, Texas Independence, and the Mexican Revolution;"}
        },
        {
            "competencyText": {"en-us": "analyze physical and human geographic factors related to Mexican migration from the 1910s to the 1930s;"}
        },
        {
            "competencyText": {"en-us": "identify physical and human geographic factors related to the migration of Mexican laborers as part of the 1940s Bracero Program; and"}
        },
        {
            "competencyText": {"en-us": "analyze the physical and human geographic factors related to contemporary Mexican migration to and Mexican American migration within the United States."}
        },
        {
            "competencyText": {"en-us": "Economics. The student understands domestic issues related to Mexican American population growth, labor force participation, and the struggle to satisfy wants and needs given scarce resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze the economic impact of Mexican repatriation of the 1930s;"}
        },
        {
            "competencyText": {"en-us": "evaluate the contributions of the Bracero Program to the U.S. war effort and the development of the agricultural economy in the American Southwest;"}
        },
        {
            "competencyText": {"en-us": "explain the struggle to create a farmworkers union and the union's efforts to fight for better wages;"}
        },
        {
            "competencyText": {"en-us": "analyze the economic contributions of the Mexican American labor force;"}
        },
        {
            "competencyText": {"en-us": "analyze the purchasing power of the Mexican American population as it relates to U.S. household consumption and gross domestic product (GDP); and"}
        },
        {
            "competencyText": {"en-us": "discuss current issues related to the Mexican American labor force."}
        },
        {
            "competencyText": {"en-us": "Government. The student understands the significance of political decisions and the struggle for Mexican American political power throughout U.S. history. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe how Mexican Americans have participated in supporting and changing government;"}
        },
        {
            "competencyText": {"en-us": "analyze the impact of Delgado v. Bastrop Independent School District (ISD) and Hernández v. Texas on Mexican Americans and the end of the biracial paradigm;"}
        },
        {
            "competencyText": {"en-us": "analyze the Mexican American struggle for civil rights as manifested in the Chicano movement;"}
        },
        {
            "competencyText": {"en-us": "evaluate the successes and failures of the Mexican American civil rights movement and the farmworkers movement;"}
        },
        {
            "competencyText": {"en-us": "analyze the significance of U.S. Supreme Court decisions in Miranda v. Arizona, San Antonio ISD v. Rodríguez, and Plyler v. Doe; and"}
        },
        {
            "competencyText": {"en-us": "discuss the role of various organizations such as the American G.I. Forum, the League of United Latin American Citizens (LULAC), the Mexican American Legal Defense and Educational Fund (MALDEF), the National Association of Latino Elected and Appointed Officials (NALEO), and the National Council of La Raza (NCLR) that have participated in the Mexican American struggle for political power."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands the importance of the respectful expression of different points of view in a constitutional republic. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the rights and responsibilities of Mexican Americans as Americans in civic participation within the United States;"}
        },
        {
            "competencyText": {"en-us": "discuss ways Americans interpret formal citizenship and cultural citizenship, including membership in one nation and membership in diverse cultural groups;"}
        },
        {
            "competencyText": {"en-us": "discuss ways individuals contribute to the national identity as members of diverse cultural groups; and"}
        },
        {
            "competencyText": {"en-us": "analyze the connotations and histories of identity nomenclature relevant to Mexican Americans such as Mexican, Spanish, Hispanic, Chicana/o, illegal, undocumented, Mexican American, and American Mexican."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands the relationship between Mexican American artistic expression and the times during which the art was created. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe how the characteristics and issues of Mexican American history have been reflected in various genres of art, music, film, and literature;"}
        },
        {
            "competencyText": {"en-us": "analyze the significance of selected works of Mexican American literature such as \"I am Joaquín\" (1967) by Rodolfo \"Corky\" Gonzáles and \"Pensamiento Serpentino\" (1971) by Luis Valdez;"}
        },
        {
            "competencyText": {"en-us": "describe the role of artistic expression in mobilizing Mexican Americans and others toward civic participation and action such as the role of \"Teatro Campesino\" during the farmworkers movement;"}
        },
        {
            "competencyText": {"en-us": "identify the contributions of women such as Sandra Cisneros and Norma Alarcón; and"}
        },
        {
            "competencyText": {"en-us": "identify the impact of Mexican American popular culture on the United States and the world over time."}
        },
        {
            "competencyText": {"en-us": "Science, technology, and society. The student understands the impact of Mexican American individuals and groups on the development of science and technology in American society and on a global scale. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the major ideas in astronomy, mathematics, and architectural engineering that developed in the Maya and Aztec civilizations; and"}
        },
        {
            "competencyText": {"en-us": "identify contributions to science and technology in the United States and the world made by Mexican Americans such as Albert Baez, Martha E. Bernal, Ellen Ochoa, and Linda Garcia Cubero."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student applies critical-thinking skills to organize and use information acquired from a variety of valid sources, including electronic technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use social studies terminology correctly;"}
        },
        {
            "competencyText": {"en-us": "analyze diverse points of view related to contemporary Mexican American issues;"}
        },
        {
            "competencyText": {"en-us": "create a written and/or oral presentation on a contemporary issue or topic relevant to Mexican Americans using critical methods of inquiry; and"}
        },
        {
            "competencyText": {"en-us": "analyze information by sequencing, categorizing, identifying cause-and-effect relationships, comparing, contrasting, finding the main idea, summarizing, making generalizations and predictions, and drawing inferences and conclusions."}
        }
    ]
}