{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://www.cpalms.org/Public/ims/case/v1p0/CFDocuments/20a98ac7-8878-4212-a321-94b9890bca02.json",
        "name": {"en-us": "Social Studies"},
        "description": {"en-us": "Social Studies Standards"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "Kindergarten"}
        },
        {
            "competencyText": {"en-us": "American History"}
        },
        {
            "competencyText": {"en-us": "Historical Inquiry and Analysis"}
        },
        {
            "competencyText": {"en-us": "Develop an understanding of how to use and create a timeline."}
        },
        {
            "competencyText": {"en-us": "Develop an awareness of a primary source."}
        },
        {
            "competencyText": {"en-us": "Historical Knowledge"}
        },
        {
            "competencyText": {"en-us": "Compare children and families of today with those in the past."}
        },
        {
            "competencyText": {"en-us": "Recognize the importance of celebrations and national holidays as a way of remembering and honoring people, events, and our nation's ethnic heritage."}
        },
        {
            "competencyText": {"en-us": "Compare our nation's holidays with holidays of other cultures."}
        },
        {
            "competencyText": {"en-us": "Listen to and retell stories about people in the past who have shown character ideals and principles including honesty, courage, and responsibility."}
        },
        {
            "competencyText": {"en-us": "Recognize the importance of U.S. symbols."}
        },
        {
            "competencyText": {"en-us": "Chronological Thinking"}
        },
        {
            "competencyText": {"en-us": "Use words and phrases related to chronology and time to explain how things change and to sequentially order events that have occurred in school."}
        },
        {
            "competencyText": {"en-us": "Explain that calendars represent days of the week and months of the year."}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "The World in Spatial Terms"}
        },
        {
            "competencyText": {"en-us": "Describe the relative location of people, places, and things by using positional words. \r\n"}
        },
        {
            "competencyText": {"en-us": "Explain that maps and globes help to locate different places and that globes are a model of the Earth.\r\n"}
        },
        {
            "competencyText": {"en-us": "Identify cardinal directions (north, south, east, west)."}
        },
        {
            "competencyText": {"en-us": "Differentiate land and water features on simple maps and globes. \r\n"}
        },
        {
            "competencyText": {"en-us": "Places and Regions"}
        },
        {
            "competencyText": {"en-us": "Locate and describe places in the school and community. \r\n"}
        },
        {
            "competencyText": {"en-us": "Know one's own phone number, street address, city or town and that Florida is the state in which the student lives.\r\n"}
        },
        {
            "competencyText": {"en-us": "Physical System"}
        },
        {
            "competencyText": {"en-us": "Identify basic landforms. \r\n"}
        },
        {
            "competencyText": {"en-us": "Identify basic bodies of water. \r\n"}
        },
        {
            "competencyText": {"en-us": "Describe and give examples of seasonal weather changes, and illustrate how weather affects people and the environment.\r\n"}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": "Beginning Economics"}
        },
        {
            "competencyText": {"en-us": "Describe different kinds of jobs that people do and the tools or equipment used. \r\n"}
        },
        {
            "competencyText": {"en-us": "Recognize that United States currency comes in different forms. \r\n"}
        },
        {
            "competencyText": {"en-us": "Recognize that people work to earn money to buy things they need or want.\r\n"}
        },
        {
            "competencyText": {"en-us": "Identify the difference between basic needs and wants. \r\n"}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "Foundations of Government, Law, and the American Political System"}
        },
        {
            "competencyText": {"en-us": "Define and give examples of rules and laws, and why they are important. \r\n"}
        },
        {
            "competencyText": {"en-us": "Explain the purpose and necessity of rules and laws at home, school, and community. \r\n"}
        },
        {
            "competencyText": {"en-us": "Civic and Political Participation"}
        },
        {
            "competencyText": {"en-us": "Demonstrate the characteristics of being a good citizen. \r\n"}
        },
        {
            "competencyText": {"en-us": "Demonstrate that conflicts among friends can be resolved in ways that are consistent with being a good citizen."}
        },
        {
            "competencyText": {"en-us": "Describe fair ways for groups to make decisions. \r\n"}
        },
        {
            "competencyText": {"en-us": "Grade 1"}
        },
        {
            "competencyText": {"en-us": "American History"}
        },
        {
            "competencyText": {"en-us": "Historical Inquiry and Analysis"}
        },
        {
            "competencyText": {"en-us": "Develop an understanding of a primary source."}
        },
        {
            "competencyText": {"en-us": "Understand how to use the media center/other sources to find answers to questions about a historical topic."}
        },
        {
            "competencyText": {"en-us": "Historical Knowledge"}
        },
        {
            "competencyText": {"en-us": "Understand history tells the story of people and events of other times and places. \r\n"}
        },
        {
            "competencyText": {"en-us": "Compare life now with life in the past."}
        },
        {
            "competencyText": {"en-us": "Identify celebrations and national holidays as a way of remembering and honoring the heroism and achievements of the people, events, and our nation's ethnic heritage."}
        },
        {
            "competencyText": {"en-us": "Identify people from the past who have shown character ideals and principles including honesty, courage, and responsibility."}
        },
        {
            "competencyText": {"en-us": "Distinguish between historical fact and fiction using various materials."}
        },
        {
            "competencyText": {"en-us": "Chronological Thinking"}
        },
        {
            "competencyText": {"en-us": "Use terms related to time to sequentially order events that have occurred in school, home, or community."}
        },
        {
            "competencyText": {"en-us": "Create a timeline based on the student's life or school events, using primary sources."}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "The World in Spatial Terms"}
        },
        {
            "competencyText": {"en-us": "Use physical and political/cultural maps to locate places in Florida."}
        },
        {
            "competencyText": {"en-us": "Identify key elements (compass rose, cardinal directions, title, key/legend with symbols) of maps and globes . \r\n"}
        },
        {
            "competencyText": {"en-us": "Construct a basic map using key elements including cardinal directions and map symbols. \r\n"}
        },
        {
            "competencyText": {"en-us": "Identify a variety of physical features using a map and globe."}
        },
        {
            "competencyText": {"en-us": "Locate on maps and globes the student's local community, Florida, the Atlantic Ocean, and the Gulf of Mexico.\r\n"}
        },
        {
            "competencyText": {"en-us": "Describe how location, weather, and physical environment affect the way people live in our community. \r\n"}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": "Beginning Economics"}
        },
        {
            "competencyText": {"en-us": "Recognize that money is a method of exchanging goods and services."}
        },
        {
            "competencyText": {"en-us": "Define opportunity costs as giving up one thing for another."}
        },
        {
            "competencyText": {"en-us": "Distinguish between examples of goods and services. \r\n"}
        },
        {
            "competencyText": {"en-us": "Distinguish people as buyers, sellers, and producers of goods and services.\r\n"}
        },
        {
            "competencyText": {"en-us": "Recognize the importance of saving money for future purchases.\r\n"}
        },
        {
            "competencyText": {"en-us": "Identify that people need to make choices because of scarce resources. \r\n"}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "Foundations of Government, Law, and the American Political System"}
        },
        {
            "competencyText": {"en-us": "Explain the purpose of rules and laws in the school and community."}
        },
        {
            "competencyText": {"en-us": "Give examples of people who have the power and authority to make and enforce rules and laws in the school and community."}
        },
        {
            "competencyText": {"en-us": "Give examples of the use of power without authority in the school and community."}
        },
        {
            "competencyText": {"en-us": "Civic and Political Participation"}
        },
        {
            "competencyText": {"en-us": "Explain the rights and responsibilities students have in the school community. \r\n"}
        },
        {
            "competencyText": {"en-us": "Describe the characteristics of responsible citizenship in the school community."}
        },
        {
            "competencyText": {"en-us": "Identify ways students can participate in the betterment of their school and community. \r\n"}
        },
        {
            "competencyText": {"en-us": "Show respect and kindness to people and animals."}
        },
        {
            "competencyText": {"en-us": "Structure and Functions of Government"}
        },
        {
            "competencyText": {"en-us": "Explain how decisions can be made or how conflicts might be resolved in fair and just ways."}
        },
        {
            "competencyText": {"en-us": "Recognize symbols and individuals that represent American constitutional democracy."}
        },
        {
            "competencyText": {"en-us": "Grade 2"}
        },
        {
            "competencyText": {"en-us": "American History"}
        },
        {
            "competencyText": {"en-us": "Historical Inquiry and Analysis"}
        },
        {
            "competencyText": {"en-us": "Examine primary and secondary sources."}
        },
        {
            "competencyText": {"en-us": "Utilize the media center, technology, or other informational sources to locate information that provides answers to questions about a historical topic.\r\n"}
        },
        {
            "competencyText": {"en-us": "Historical Knowledge"}
        },
        {
            "competencyText": {"en-us": "Recognize that Native Americans were the first inhabitants in North America.\r\n"}
        },
        {
            "competencyText": {"en-us": "Compare the cultures of Native American tribes from various geographic regions of the United States."}
        },
        {
            "competencyText": {"en-us": "Describe the impact of immigrants on the Native Americans."}
        },
        {
            "competencyText": {"en-us": "Explore ways the daily life of people living in Colonial America changed over time."}
        },
        {
            "competencyText": {"en-us": "Identify reasons people came to the United States throughout history."}
        },
        {
            "competencyText": {"en-us": "Discuss the importance of Ellis Island and the Statue of Liberty to immigration from 1892 - 1954.\r\n"}
        },
        {
            "competencyText": {"en-us": "Discuss why immigration continues today."}
        },
        {
            "competencyText": {"en-us": "Explain the cultural influences and contributions of immigrants today."}
        },
        {
            "competencyText": {"en-us": "Chronological Thinking"}
        },
        {
            "competencyText": {"en-us": "Identify terms and designations of time sequence."}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "The World in Spatial Terms"}
        },
        {
            "competencyText": {"en-us": "Use different types of maps (political, physical, and thematic) to identify map elements."}
        },
        {
            "competencyText": {"en-us": "Using maps and globes, locate the student's hometown, Florida, and North America, and locate the state capital and the national capital. \r\n"}
        },
        {
            "competencyText": {"en-us": "Label on a map or globe the continents, oceans, Equator, Prime Meridian, North and South Pole. \r\n"}
        },
        {
            "competencyText": {"en-us": "Use a map to locate the countries in North America (Canada, United States, Mexico, and the Caribbean Islands). \r\n"}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": "Beginning Economics"}
        },
        {
            "competencyText": {"en-us": "Recognize that people make choices because of limited resources.\r\n"}
        },
        {
            "competencyText": {"en-us": "Recognize that people supply goods and services based on consumer demands."}
        },
        {
            "competencyText": {"en-us": "Recognize that the United States trades with other nations to exchange goods and services."}
        },
        {
            "competencyText": {"en-us": "Explain the personal benefits and costs involved in saving and spending.\r\n"}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "Foundations of Government, Law, and the American Political System"}
        },
        {
            "competencyText": {"en-us": "Explain why people form governments."}
        },
        {
            "competencyText": {"en-us": "Explain the consequences of an absence of rules and laws."}
        },
        {
            "competencyText": {"en-us": "Civic and Political Participation"}
        },
        {
            "competencyText": {"en-us": "Identify what it means to be a United States citizen either by birth or by naturalization.\r\n"}
        },
        {
            "competencyText": {"en-us": "Define and apply the characteristics of responsible citizenship."}
        },
        {
            "competencyText": {"en-us": "Explain why United States citizens have guaranteed rights and identify rights."}
        },
        {
            "competencyText": {"en-us": "Identify ways citizens can make a positive contribution in their community."}
        },
        {
            "competencyText": {"en-us": "Evaluate the contributions of various African Americans, Hispanics, Native Americans, veterans, and women.\r\n"}
        },
        {
            "competencyText": {"en-us": "Structure and Functions of Government"}
        },
        {
            "competencyText": {"en-us": "Identify the Constitution as the document which establishes the structure, function, powers, and limits of American government. \r\n"}
        },
        {
            "competencyText": {"en-us": "Recognize symbols, individuals, events, and documents that represent the United States."}
        },
        {
            "competencyText": {"en-us": "Grade 3"}
        },
        {
            "competencyText": {"en-us": "American History"}
        },
        {
            "competencyText": {"en-us": "Historical Inquiry and Analysis"}
        },
        {
            "competencyText": {"en-us": "Analyze primary and secondary sources."}
        },
        {
            "competencyText": {"en-us": "Utilize technology resources to gather information from primary and secondary sources.\r\n"}
        },
        {
            "competencyText": {"en-us": "Define terms related to the social sciences."}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "The World in Spatial Terms"}
        },
        {
            "competencyText": {"en-us": "Use thematic maps, tables, charts, graphs, and photos to analyze geographic information."}
        },
        {
            "competencyText": {"en-us": "Review basic map elements (coordinate grid, cardinal and intermediate directions, title, compass rose, scale, key/legend with symbols) . \r\n"}
        },
        {
            "competencyText": {"en-us": "Label the continents and oceans on a world map.\r\n"}
        },
        {
            "competencyText": {"en-us": "Name and identify the purpose of maps (physical, political, elevation, population). \r\n"}
        },
        {
            "competencyText": {"en-us": "Compare maps and globes to develop an understanding of the concept of distortion.\r\n"}
        },
        {
            "competencyText": {"en-us": "Use maps to identify different types of scale to measure distances between two places."}
        },
        {
            "competencyText": {"en-us": "Places and Regions"}
        },
        {
            "competencyText": {"en-us": "Label the countries and commonwealths in North America (Canada, United States, Mexico) and in the Caribbean (Puerto Rico, Cuba, Bahamas, Dominican Republic, Haiti, Jamaica). \r\n"}
        },
        {
            "competencyText": {"en-us": "Identify the five regions of the United States."}
        },
        {
            "competencyText": {"en-us": "Label the states in each of the five regions of the United States.\r\n"}
        },
        {
            "competencyText": {"en-us": "Describe the physical features of the United States, Canada, Mexico, and the Caribbean."}
        },
        {
            "competencyText": {"en-us": "Identify natural and man-made landmarks in the United States, Canada, Mexico, and the Caribbean. \r\n"}
        },
        {
            "competencyText": {"en-us": "Investigate how people perceive places and regions differently by conducting interviews, mental mapping, and studying news, poems, legends, and songs about a region or area.\r\n"}
        },
        {
            "competencyText": {"en-us": "Physical Systems"}
        },
        {
            "competencyText": {"en-us": "Describe the climate and vegetation in the United States, Canada, Mexico, and the Caribbean. \r\n"}
        },
        {
            "competencyText": {"en-us": "Describe the natural resources in the United States, Canada, Mexico, and the Caribbean. \r\n"}
        },
        {
            "competencyText": {"en-us": "Human Systems"}
        },
        {
            "competencyText": {"en-us": "Explain how the environment influences settlement patterns in the United States, Canada, Mexico, and the Caribbean."}
        },
        {
            "competencyText": {"en-us": "Identify the cultures that have settled the United States, Canada, Mexico, and the Caribbean.\r\n"}
        },
        {
            "competencyText": {"en-us": "Compare the cultural characteristics of diverse populations in one of the five regions of the United States with Canada, Mexico, or the Caribbean."}
        },
        {
            "competencyText": {"en-us": "Identify contributions from various ethnic groups to the United States. \r\n"}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": "Beginning Economics"}
        },
        {
            "competencyText": {"en-us": "Give examples of how scarcity results in trade."}
        },
        {
            "competencyText": {"en-us": "List the characteristics of money."}
        },
        {
            "competencyText": {"en-us": "Recognize that buyers and sellers interact to exchange goods and services through the use of trade or money.\r\n"}
        },
        {
            "competencyText": {"en-us": "Distinguish between currencies used in the United States, Canada, Mexico, and the Caribbean.\r\n"}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "Foundations of Government, Law, and the American Political System"}
        },
        {
            "competencyText": {"en-us": "Explain the purpose and need for government."}
        },
        {
            "competencyText": {"en-us": "Describe how government gains its power from the people.\r\n"}
        },
        {
            "competencyText": {"en-us": "Explain how government was established through a written Constitution.\r\n"}
        },
        {
            "competencyText": {"en-us": "Civic and Political Participation"}
        },
        {
            "competencyText": {"en-us": "Identify group and individual actions of citizens that demonstrate civility, cooperation, volunteerism, and other civic virtues."}
        },
        {
            "competencyText": {"en-us": "Structure and Functions of Government"}
        },
        {
            "competencyText": {"en-us": "Identify the levels of government (local, state, federal).\r\n"}
        },
        {
            "competencyText": {"en-us": "Describe how government is organized at the local level."}
        },
        {
            "competencyText": {"en-us": "Recognize that every state has a state constitution."}
        },
        {
            "competencyText": {"en-us": "Recognize that the Constitution of the United States is the supreme law of the land."}
        },
        {
            "competencyText": {"en-us": "Grade 4"}
        },
        {
            "competencyText": {"en-us": "American History"}
        },
        {
            "competencyText": {"en-us": "Historical Inquiry and Analysis"}
        },
        {
            "competencyText": {"en-us": "Analyze primary and secondary resources to identify significant individuals and events throughout Florida history."}
        },
        {
            "competencyText": {"en-us": "Synthesize information related to Florida history through print and electronic media."}
        },
        {
            "competencyText": {"en-us": "Pre-Columbian Florida"}
        },
        {
            "competencyText": {"en-us": "Compare Native American tribes in Florida."}
        },
        {
            "competencyText": {"en-us": "Exploration and Settlement of Florida"}
        },
        {
            "competencyText": {"en-us": "Identify explorers who came to Florida and the motivations for their expeditions."}
        },
        {
            "competencyText": {"en-us": "Describe causes and effects of European colonization on the Native American tribes of Florida."}
        },
        {
            "competencyText": {"en-us": "Identify the significance of St. Augustine as the oldest permanent European settlement in the United States."}
        },
        {
            "competencyText": {"en-us": "Explain the purpose of and daily life on missions (San Luis de Talimali in present-day Tallahassee). \r\n"}
        },
        {
            "competencyText": {"en-us": "Identify the significance of Fort Mose as the first free African community in the United States."}
        },
        {
            "competencyText": {"en-us": "Identify the effects of Spanish rule in Florida."}
        },
        {
            "competencyText": {"en-us": "Identify nations (Spain, France, England) that controlled Florida before it became a United States territory. \r\n"}
        },
        {
            "competencyText": {"en-us": "Explain how the Seminole tribe formed and the purpose for their migration."}
        },
        {
            "competencyText": {"en-us": "Explain how Florida (Adams-Onis Treaty) became a U.S. territory."}
        },
        {
            "competencyText": {"en-us": "Identify the causes and effects of the Seminole Wars."}
        },
        {
            "competencyText": {"en-us": "Growth of Florida"}
        },
        {
            "competencyText": {"en-us": "Explain the effects of technological advances on Florida."}
        },
        {
            "competencyText": {"en-us": "Describe pioneer life in Florida."}
        },
        {
            "competencyText": {"en-us": "Crisis of the Union: Civil War and Reconstruction in Florida"}
        },
        {
            "competencyText": {"en-us": "Describe Florida's involvement (secession, blockades of ports, the battles of Ft. Pickens, Olustee, Ft. Brooke, Natural Bridge, food supply) in the Civil War."}
        },
        {
            "competencyText": {"en-us": "Summarize challenges Floridians faced during Reconstruction."}
        },
        {
            "competencyText": {"en-us": "Industrialization and Emergence of Modern Florida"}
        },
        {
            "competencyText": {"en-us": "Describe the economic development of Florida's major industries."}
        },
        {
            "competencyText": {"en-us": "Summarize contributions immigrant groups made to Florida."}
        },
        {
            "competencyText": {"en-us": "Describe the contributions of significant individuals to Florida."}
        },
        {
            "competencyText": {"en-us": "Describe effects of the Spanish American War on Florida."}
        },
        {
            "competencyText": {"en-us": "Roaring 20's, the Great Depression, and WWII in Florida"}
        },
        {
            "competencyText": {"en-us": "Describe the causes and effects of the 1920's Florida land boom and bust."}
        },
        {
            "competencyText": {"en-us": "Summarize challenges Floridians faced during the Great Depression."}
        },
        {
            "competencyText": {"en-us": "Identify Florida's role in World War II."}
        },
        {
            "competencyText": {"en-us": "Contemporary Florida into the 21st Century"}
        },
        {
            "competencyText": {"en-us": "Identify Florida's role in the Civil Rights Movement."}
        },
        {
            "competencyText": {"en-us": "Describe how and why immigration impacts Florida today."}
        },
        {
            "competencyText": {"en-us": "Describe the effect of the United States space program on Florida's economy and growth."}
        },
        {
            "competencyText": {"en-us": "Explain how tourism affects Florida's economy and growth."}
        },
        {
            "competencyText": {"en-us": "Chronological Thinking"}
        },
        {
            "competencyText": {"en-us": "Utilize timelines to sequence key events in Florida history.\r\n"}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "The World in Spatial Terms"}
        },
        {
            "competencyText": {"en-us": "Identify physical features of Florida."}
        },
        {
            "competencyText": {"en-us": "Locate and label cultural features on a Florida map."}
        },
        {
            "competencyText": {"en-us": "Explain how weather impacts Florida."}
        },
        {
            "competencyText": {"en-us": "Interpret political and physical maps using map elements (title, compass rose, cardinal directions, intermediate directions, symbols, legend, scale, longitude, latitude).\r\n"}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": "Beginning Economics"}
        },
        {
            "competencyText": {"en-us": "Identify entrepreneurs from various social and ethnic backgrounds who have influenced Florida and local economy. \r\n"}
        },
        {
            "competencyText": {"en-us": "Explain Florida's role in the national and international economy and conditions that attract businesses to the state."}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "Foundations of Government, Law, and the American Political System"}
        },
        {
            "competencyText": {"en-us": "Describe how Florida's constitution protects the rights of citizens and provides for the structure, function, and purposes of state government.\r\n"}
        },
        {
            "competencyText": {"en-us": "Civic and Political Participation"}
        },
        {
            "competencyText": {"en-us": "Discuss public issues in Florida that impact the daily lives of its citizens."}
        },
        {
            "competencyText": {"en-us": "Identify ways citizens work together to influence government and help solve community and state problems."}
        },
        {
            "competencyText": {"en-us": "Explain the importance of public service, voting, and volunteerism."}
        },
        {
            "competencyText": {"en-us": "Structure and Functions of Government"}
        },
        {
            "competencyText": {"en-us": "Identify the three branches (Legislative, Judicial, Executive) of government in Florida and the powers of each.\r\n"}
        },
        {
            "competencyText": {"en-us": "Distinguish between state (governor, state representative, or senator) and local government (mayor, city commissioner)."}
        },
        {
            "competencyText": {"en-us": "Financial Literacy"}
        },
        {
            "competencyText": {"en-us": "Earning Income"}
        },
        {
            "competencyText": {"en-us": "People have many different types of jobs from which to choose. Identify different jobs requiring people to have different skills."}
        },
        {
            "competencyText": {"en-us": "People earn an income when they are hired by an employer to work at a job.<br />\r\nExplain why employers are willing to pay people to do their work."}
        },
        {
            "competencyText": {"en-us": "Workers are paid for their labor in different ways such as wages, salaries, or commissions. Explain the ways in which workers are paid."}
        },
        {
            "competencyText": {"en-us": "People can earn interest income from letting other people borrow their money.<br />\r\nExplain why banks and financial institutions pay people interest when they deposit their money at those institutions."}
        },
        {
            "competencyText": {"en-us": "People can earn income by renting their property to other people.<br />\r\nIdentify different types of property (such as apartments, automobiles, or tools) that people own and on which rent is paid."}
        },
        {
            "competencyText": {"en-us": "Describe ways that people who own a business can earn a profit, which is a source of income."}
        },
        {
            "competencyText": {"en-us": "Entrepreneurs are people who start new businesses. Entrepreneurs do not know if their new businesses will be successful and earn a profit. Identify ways in which starting a business is risky for entrepreneurs."}
        },
        {
            "competencyText": {"en-us": "Income earned from working and most other sources of income are taxed. Describe ways that the revenue from these taxes is used to pay for government provided goods and services."}
        },
        {
            "competencyText": {"en-us": "Buying Goods and Services"}
        },
        {
            "competencyText": {"en-us": "Explain that economic wants are desires that can be satisfied by consuming a good, a service, or a leisure activity."}
        },
        {
            "competencyText": {"en-us": "Explain that people make choices about what goods and services they buy because they can&rsquo;t have everything they want. This requires individuals to prioritize their wants."}
        },
        {
            "competencyText": {"en-us": "Identify some of the ways that people spend a portion of their income on goods and services in order to increase their personal satisfaction or happiness."}
        },
        {
            "competencyText": {"en-us": "Discuss that whenever people buy something, they incur an opportunity cost. Opportunity cost is the value of the next best alternative that is given up when a person makes a choice."}
        },
        {
            "competencyText": {"en-us": "Explain that costs are things that a decision maker gives up; benefits are things that a decision maker gains. Make an informed decision by comparing the costs and benefits of spending alternatives."}
        },
        {
            "competencyText": {"en-us": "Predict how people&rsquo;s spending choices are influenced by prices as well as many other factors, including advertising, the spending choices of others, and peer pressure."}
        },
        {
            "competencyText": {"en-us": "Planning for spending can help people make informed choices. Develop a budget plan for spending, saving, and managing income."}
        },
        {
            "competencyText": {"en-us": "Saving"}
        },
        {
            "competencyText": {"en-us": "Identify ways that income is saved, spent on goods and services, or used to pay taxes."}
        },
        {
            "competencyText": {"en-us": "Explain that when people save money, they give up the opportunity to buy things now in order to buy things later."}
        },
        {
            "competencyText": {"en-us": "Identify ways that people can choose to save money in many places&mdash;for example, at home in a piggy bank or at a commercial bank, credit union, or savings and loan."}
        },
        {
            "competencyText": {"en-us": "Identify savings goals people set as incentives to save. One savings goal might be to buy goods and services in the future."}
        },
        {
            "competencyText": {"en-us": "Explain that when people deposit money into a bank (or other financial institution), the bank may pay them interest. Banks attract savings by paying interest. People also deposit money into banks because banks are safe places to keep their savings."}
        },
        {
            "competencyText": {"en-us": "Using Credit"}
        },
        {
            "competencyText": {"en-us": "Discuss that interest is the price the borrower pays for using someone else&rsquo;s money."}
        },
        {
            "competencyText": {"en-us": "Identify instances when people use credit, that they receive something of value now and agree to repay the lender over time, or at some date in the future, with interest."}
        },
        {
            "competencyText": {"en-us": "Financial Investing"}
        },
        {
            "competencyText": {"en-us": "Explain that after people have saved some of their income, they must decide how to invest their savings so that it can grow over time."}
        },
        {
            "competencyText": {"en-us": "Explain that a financial investment is the purchase of a financial asset such as a stock with the expectation of an increase in the value of the asset and/or increase in future income."}
        },
        {
            "competencyText": {"en-us": "Protecting and Insuring"}
        },
        {
            "competencyText": {"en-us": "Explain that risk is the chance of loss or harm."}
        },
        {
            "competencyText": {"en-us": "Explain that risk from accidents and unexpected events is an unavoidable part of daily life."}
        },
        {
            "competencyText": {"en-us": "Describe ways that individuals can either choose to accept risk or take steps to protect themselves by avoiding or reducing risk."}
        },
        {
            "competencyText": {"en-us": "Discuss that one method to cope with unexpected losses is to save for emergencies."}
        },
        {
            "competencyText": {"en-us": "Grade 5"}
        },
        {
            "competencyText": {"en-us": "American History"}
        },
        {
            "competencyText": {"en-us": "Historical Inquiry and Analysis"}
        },
        {
            "competencyText": {"en-us": "Use primary and secondary sources to understand history."}
        },
        {
            "competencyText": {"en-us": "Utilize timelines to identify and discuss American History time periods."}
        },
        {
            "competencyText": {"en-us": "Pre-Columbian North America"}
        },
        {
            "competencyText": {"en-us": "Compare cultural aspects of ancient American civilizations (Aztecs/Mayas; Mound Builders/Anasazi/Inuit)."}
        },
        {
            "competencyText": {"en-us": "Identify Native American tribes from different geographic regions of North America (cliff dwellers and Pueblo people of the desert Southwest, coastal tribes of the Pacific Northwest, nomadic nations of the Great Plains, woodland tribes east of the Mississippi River)."}
        },
        {
            "competencyText": {"en-us": "Compare cultural aspects of Native American tribes from different geographic regions of North America including but not limited to clothing, shelter, food, major beliefs and practices, music, art, and interactions with the environment."}
        },
        {
            "competencyText": {"en-us": "Exploration and Settlement of North America"}
        },
        {
            "competencyText": {"en-us": "Describe technological developments that shaped European exploration."}
        },
        {
            "competencyText": {"en-us": "Investigate (nationality, sponsoring country, motives, dates and routes of travel, accomplishments) the European explorers."}
        },
        {
            "competencyText": {"en-us": "Describe interactions among Native Americans, Africans, English, French, Dutch, and Spanish for control of North America."}
        },
        {
            "competencyText": {"en-us": "Colonization of North America"}
        },
        {
            "competencyText": {"en-us": "Identify the economic, political and socio-cultural motivation for colonial settlement."}
        },
        {
            "competencyText": {"en-us": "Compare characteristics of New England, Middle, and Southern colonies."}
        },
        {
            "competencyText": {"en-us": "Identify significant individuals responsible for the development of the New England, Middle, and Southern colonies."}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of political, economic, and social aspects of daily colonial life in the thirteen colonies."}
        },
        {
            "competencyText": {"en-us": "Explain the importance of Triangular Trade linking Africa, the West Indies, the British Colonies, and Europe.\r\n"}
        },
        {
            "competencyText": {"en-us": "Describe the introduction, impact, and role of slavery in the colonies."}
        },
        {
            "competencyText": {"en-us": "American Revolution & Birth of a New Nation"}
        },
        {
            "competencyText": {"en-us": "Identify and explain significant events leading up to the American Revolution."}
        },
        {
            "competencyText": {"en-us": "Identify significant individuals and groups who played a role in the American Revolution."}
        },
        {
            "competencyText": {"en-us": "Explain the significance of historical documents including key political concepts, origins of these concepts, and their role in American independence."}
        },
        {
            "competencyText": {"en-us": "Examine and explain the changing roles and impact of significant women during the American Revolution."}
        },
        {
            "competencyText": {"en-us": "Examine and compare major battles and military campaigns of the American Revolution."}
        },
        {
            "competencyText": {"en-us": "Identify the contributions of foreign alliances and individuals to the outcome of the Revolution."}
        },
        {
            "competencyText": {"en-us": "Explain economic, military, and political factors which led to the end of the Revolutionary War."}
        },
        {
            "competencyText": {"en-us": "Evaluate the personal and political hardships resulting from the American Revolution."}
        },
        {
            "competencyText": {"en-us": "Discuss the impact and significance of land policies developed under the Confederation Congress (Northwest Ordinance of 1787)."}
        },
        {
            "competencyText": {"en-us": "Examine the significance of the Constitution including its key political concepts, origins of those concepts, and their role in American democracy."}
        },
        {
            "competencyText": {"en-us": "Growth and Westward Expansion"}
        },
        {
            "competencyText": {"en-us": "Describe the causes and effects of the Louisiana Purchase."}
        },
        {
            "competencyText": {"en-us": "Identify roles and contributions of significant people during the period of westward expansion."}
        },
        {
            "competencyText": {"en-us": "Examine 19th century advancements (canals, roads, steamboats, flat boats, overland wagons, Pony Express, railroads) in transportation and communication."}
        },
        {
            "competencyText": {"en-us": "Explain the importance of the explorations west of the Mississippi River."}
        },
        {
            "competencyText": {"en-us": "Identify the causes and effects of the War of 1812."}
        },
        {
            "competencyText": {"en-us": "Explain how westward expansion affected Native Americans."}
        },
        {
            "competencyText": {"en-us": "Discuss the concept of Manifest Destiny."}
        },
        {
            "competencyText": {"en-us": "Describe the causes and effects of the Missouri Compromise."}
        },
        {
            "competencyText": {"en-us": "Describe the hardships of settlers along the overland trails to the west."}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "The World in Spatial Terms"}
        },
        {
            "competencyText": {"en-us": "Interpret current and historical information using a variety of geographic tools."}
        },
        {
            "competencyText": {"en-us": "Use latitude and longitude to locate places."}
        },
        {
            "competencyText": {"en-us": "Identify major United States physical features on a map of North America."}
        },
        {
            "competencyText": {"en-us": "Construct maps, charts, and graphs to display geographic information."}
        },
        {
            "competencyText": {"en-us": "Identify and locate the original thirteen colonies on a map of North America."}
        },
        {
            "competencyText": {"en-us": "Locate and identify states, capitals, and United States Territories on a map."}
        },
        {
            "competencyText": {"en-us": "Places and Regions"}
        },
        {
            "competencyText": {"en-us": "Describe the push-pull factors (economy, natural hazards, tourism, climate, physical features) that influenced boundary changes within the United States. \r\n"}
        },
        {
            "competencyText": {"en-us": "Environment and Society"}
        },
        {
            "competencyText": {"en-us": "Describe the impact that past natural events have had on human and physical environments in the United States through 1850."}
        },
        {
            "competencyText": {"en-us": "Uses of Geography"}
        },
        {
            "competencyText": {"en-us": "Use geographic knowledge and skills when discussing current events."}
        },
        {
            "competencyText": {"en-us": "Use geography concepts and skills such as recognizing patterns, mapping, graphing to find solutions for local, state, or national problems.\r\n"}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": "Market Economy"}
        },
        {
            "competencyText": {"en-us": "Identify how trade promoted economic growth in North America from pre-Columbian times to 1850."}
        },
        {
            "competencyText": {"en-us": "Describe a market economy, and give examples of how the colonial and early American economy exhibited these characteristics.\r\n"}
        },
        {
            "competencyText": {"en-us": "Trace the development of technology and the impact of major inventions on business productivity during the early development of the United States."}
        },
        {
            "competencyText": {"en-us": "The International Economy"}
        },
        {
            "competencyText": {"en-us": "Recognize the positive and negative effects of voluntary trade among Native Americans, European explorers, and colonists."}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "Foundations of Government, Law, and the American Political System"}
        },
        {
            "competencyText": {"en-us": "Explain how and why the United States government was created."}
        },
        {
            "competencyText": {"en-us": "Define a constitution, and discuss its purposes.\r\n"}
        },
        {
            "competencyText": {"en-us": "Explain the definition and origin of rights."}
        },
        {
            "competencyText": {"en-us": "Identify the Declaration of Independence's grievances and Articles of Confederation's weaknesses."}
        },
        {
            "competencyText": {"en-us": "Describe how concerns about individual rights led to the inclusion of the Bill of Rights in the U.S. Constitution."}
        },
        {
            "competencyText": {"en-us": "Compare Federalist and Anti-Federalist views of government."}
        },
        {
            "competencyText": {"en-us": "Civic and Political Participation"}
        },
        {
            "competencyText": {"en-us": "Differentiate political ideas of Patriots, Loyalists, and \"undecideds\" during the American Revolution. \r\n"}
        },
        {
            "competencyText": {"en-us": "Compare forms of political participation in the colonial period to today."}
        },
        {
            "competencyText": {"en-us": "Analyze how the Constitution has expanded voting rights from our nation's early history to today."}
        },
        {
            "competencyText": {"en-us": "Evaluate the importance of civic responsibilities in American democracy."}
        },
        {
            "competencyText": {"en-us": "Identify ways good citizens go beyond basic civic and political responsibilities to improve government and society. \r\n"}
        },
        {
            "competencyText": {"en-us": "Structure and Functions of Government"}
        },
        {
            "competencyText": {"en-us": "Describe the organizational structure (legislative, executive, judicial branches) and powers of the federal government as defined in Articles I, II, and III of the U.S. Constitution.\r\n"}
        },
        {
            "competencyText": {"en-us": "Explain how popular sovereignty, rule of law, separation of powers, checks and balances, federalism, and individual rights limit the powers of the federal government as expressed in the Constitution and Bill of Rights."}
        },
        {
            "competencyText": {"en-us": "Give examples of powers granted to the federal government and those reserved for the states."}
        },
        {
            "competencyText": {"en-us": "Describe the amendment process as defined in Article V of the Constitution and give examples."}
        },
        {
            "competencyText": {"en-us": "Identify the fundamental rights of all citizens as enumerated in the Bill of Rights."}
        },
        {
            "competencyText": {"en-us": "Examine the foundations of the United States legal system by recognizing the role of the courts in interpreting law and settling conflicts."}
        },
        {
            "competencyText": {"en-us": "Grade 6"}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "Understand how to use maps and other geographic representations, tools and technology to report information."}
        },
        {
            "competencyText": {"en-us": "Use latitude and longitude coordinates to understand the relationship between people and places on the Earth."}
        },
        {
            "competencyText": {"en-us": "Analyze the purposes of map projections (political, physical, special purpose) and explain the applications of various types of maps. \r\n"}
        },
        {
            "competencyText": {"en-us": "Identify natural wonders of the ancient world."}
        },
        {
            "competencyText": {"en-us": "Utilize tools geographers use to study the world."}
        },
        {
            "competencyText": {"en-us": "Use scale, cardinal, and intermediate directions, and estimation of distances between places on current and ancient maps of the world."}
        },
        {
            "competencyText": {"en-us": "Use a map to identify major bodies of water of the world, and explain ways they have impacted the development of civilizations."}
        },
        {
            "competencyText": {"en-us": "Use maps to identify characteristics and boundaries of ancient civilizations that have shaped the world today."}
        },
        {
            "competencyText": {"en-us": "Understand physical and cultural characteristics of places."}
        },
        {
            "competencyText": {"en-us": "Explain how major physical characteristics, natural resources, climate, and absolute and relative locations have influenced settlement, interactions, and the economies of ancient civilizations of the world."}
        },
        {
            "competencyText": {"en-us": "Differentiate between continents, regions, countries, and cities in order to understand the complexities of regions created by civilizations."}
        },
        {
            "competencyText": {"en-us": "Analyze the relationship of physical geography to the development of ancient river valley civilizations."}
        },
        {
            "competencyText": {"en-us": "Explain how the geographical location of ancient civilizations contributed to the culture and politics of those societies."}
        },
        {
            "competencyText": {"en-us": "Interpret how geographic boundaries invite or limit interaction with other regions and cultures."}
        },
        {
            "competencyText": {"en-us": "Explain the concept of cultural diffusion, and identify the influences of different ancient cultures on one another."}
        },
        {
            "competencyText": {"en-us": "Interpret choropleths or dot-density maps to explain the distribution of population in the ancient world."}
        },
        {
            "competencyText": {"en-us": "Understand the relationships between the Earth's ecosystems and the populations that dwell within them."}
        },
        {
            "competencyText": {"en-us": "Explain how the physical landscape has affected the development of agriculture and industry in the ancient world."}
        },
        {
            "competencyText": {"en-us": "Analyze the impact of human populations on the ancient world's ecosystems. \r\n"}
        },
        {
            "competencyText": {"en-us": "Understand the characteristics, distribution, and migration of human populations."}
        },
        {
            "competencyText": {"en-us": "Explain how family and ethnic relationships influenced ancient cultures."}
        },
        {
            "competencyText": {"en-us": "Use maps to trace significant migrations, and analyze their results."}
        },
        {
            "competencyText": {"en-us": "Locate sites in Africa and Asia where archaeologists have found evidence of early human societies, and trace their migration patterns to other parts of the world.\r\n"}
        },
        {
            "competencyText": {"en-us": "Map and analyze the impact of the spread of various belief systems in the ancient world."}
        },
        {
            "competencyText": {"en-us": "Understand how human actions can impact the environment."}
        },
        {
            "competencyText": {"en-us": "Identify the methods used to compensate for the scarcity of resources in the ancient world."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to explain why ancient civilizations developed networks of highways, waterways, and other transportation linkages."}
        },
        {
            "competencyText": {"en-us": "Use geographic tools and terms to analyze how famine, drought, and natural disasters plagued many ancient civilizations."}
        },
        {
            "competencyText": {"en-us": "Understand how to apply geography to interpret the past and present and plan for the future."}
        },
        {
            "competencyText": {"en-us": "Describe the Six Essential Elements of Geography (The World in Spatial Terms, Places and Regions, Physical Systems, Human Systems, Environment, The Uses of Geography) as the organizing framework for understanding the world and its people."}
        },
        {
            "competencyText": {"en-us": "Compare maps of the world in ancient times with current political maps."}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts relevant to the development of a market economy."}
        },
        {
            "competencyText": {"en-us": "Identify the factors (new resources, increased productivity, education, technology, slave economy, territorial expansion) that increase economic growth. \r\n"}
        },
        {
            "competencyText": {"en-us": "Describe and identify traditional and command economies as they appear in different civilizations."}
        },
        {
            "competencyText": {"en-us": "Describe the following economic concepts as they relate to early civilization: scarcity, opportunity cost, supply and demand, barter, trade, productive resources (land, labor, capital, entrepreneurship).\r\n"}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts relevant to the institutions, structure, and functions of a national economy."}
        },
        {
            "competencyText": {"en-us": "Evaluate how civilizations through clans, leaders, and family groups make economic decisions for that civilization providing a framework for future city-state or nation development."}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts and interrelationships of the United States economy in the international marketplace."}
        },
        {
            "competencyText": {"en-us": "Identify examples of mediums of exchange (currencies) used for trade (barter) for each civilization, and explain why international trade requires a system for a medium of exchange between trading both inside and among various regions.\r\n"}
        },
        {
            "competencyText": {"en-us": "Categorize products that were traded among civilizations, and give examples of barriers to trade of those products.\r\n"}
        },
        {
            "competencyText": {"en-us": "Describe traditional economies (Egypt, Greece, Rome, Kush) and elements of those economies that led to the rise of a merchant class and trading partners. \r\n"}
        },
        {
            "competencyText": {"en-us": "Describe the relationship among civilizations that engage in trade, including the benefits and drawbacks of voluntary trade."}
        },
        {
            "competencyText": {"en-us": "World History"}
        },
        {
            "competencyText": {"en-us": "Utilize historical inquiry skills and analytical processes."}
        },
        {
            "competencyText": {"en-us": "Use timelines to identify chronological order of historical events."}
        },
        {
            "competencyText": {"en-us": "Identify terms (decade, century, epoch, era, millennium, BC/BCE, AD/CE) and designations of time periods. \r\n"}
        },
        {
            "competencyText": {"en-us": "Interpret primary and secondary sources."}
        },
        {
            "competencyText": {"en-us": "Describe the methods of historical inquiry and how history relates to the other social sciences."}
        },
        {
            "competencyText": {"en-us": "Describe the roles of historians and recognize varying historical interpretations (historiography)."}
        },
        {
            "competencyText": {"en-us": "Describe how history transmits culture and heritage and provides models of human character."}
        },
        {
            "competencyText": {"en-us": "Describe the emergence of early civilizations (Nile, Tigris-Euphrates, Indus, and Yellow Rivers, Meso and South American)."}
        },
        {
            "competencyText": {"en-us": "Compare the lifestyles of hunter-gatherers with those of settlers of early agricultural communities."}
        },
        {
            "competencyText": {"en-us": "Describe how the developments of agriculture and metallurgy related to settlement, population growth, and the emergence of civilization."}
        },
        {
            "competencyText": {"en-us": "Identify the characteristics of civilization."}
        },
        {
            "competencyText": {"en-us": "Compare the economic, political, social, and religious institutions of ancient river civilizations."}
        },
        {
            "competencyText": {"en-us": "Summarize important achievements of Egyptian civilization."}
        },
        {
            "competencyText": {"en-us": "Determine the contributions of key figures from ancient Egypt."}
        },
        {
            "competencyText": {"en-us": "Summarize the important achievements of Mesopotamian civilization."}
        },
        {
            "competencyText": {"en-us": "Determine the impact of key figures from ancient Mesopotamian civilizations."}
        },
        {
            "competencyText": {"en-us": "Identify key figures and basic beliefs of the Israelites and determine how these beliefs compared with those of others in the geographic area."}
        },
        {
            "competencyText": {"en-us": "Compare the emergence of advanced civilizations in Meso and South America with the four early river valley civilizations."}
        },
        {
            "competencyText": {"en-us": "Recognize significant events, figures, and contributions of classical civilizations (Phoenicia, Greece, Rome, Axum)."}
        },
        {
            "competencyText": {"en-us": "Analyze the cultural impact the ancient Phoenicians had on the Mediterranean world with regard to colonization (Carthage), exploration, maritime commerce (purple dye, tin), and written communication (alphabet).\r\n"}
        },
        {
            "competencyText": {"en-us": "Explain the democratic concepts (polis, civic participation and voting rights, legislative bodies, written constitutions, rule of law) developed in ancient Greece. \r\n"}
        },
        {
            "competencyText": {"en-us": "Compare life in Athens and Sparta (government and the status of citizens, women and children, foreigners, helots).\r\n"}
        },
        {
            "competencyText": {"en-us": "Explain the causes and effects of the Persian and Peloponnesian Wars."}
        },
        {
            "competencyText": {"en-us": "Summarize the important achievements and contributions of ancient Greek civilization."}
        },
        {
            "competencyText": {"en-us": "Determine the impact of key figures from ancient Greece."}
        },
        {
            "competencyText": {"en-us": "Summarize the key achievements, contributions, and figures associated with The Hellenistic Period."}
        },
        {
            "competencyText": {"en-us": "Determine the impact of significant figures associated with ancient Rome."}
        },
        {
            "competencyText": {"en-us": "Explain the impact of the Punic Wars on the development of the Roman Empire."}
        },
        {
            "competencyText": {"en-us": "Describe the government of the Roman Republic and its contribution to the development of democratic principles (separation of powers, rule of law, representative government, civic duty).\r\n"}
        },
        {
            "competencyText": {"en-us": "Explain the transition from Roman Republic to empire and Imperial Rome, and compare Roman life and culture under each one."}
        },
        {
            "competencyText": {"en-us": "Explain the causes for the growth and longevity of the Roman Empire."}
        },
        {
            "competencyText": {"en-us": "Identify key figures and the basic beliefs of early Christianity and how these beliefs impacted the Roman Empire."}
        },
        {
            "competencyText": {"en-us": "Describe the key achievements and contributions of Roman civilization. \r\n"}
        },
        {
            "competencyText": {"en-us": "Explain the reasons for the gradual decline of the Western Roman Empire after the Pax Romana."}
        },
        {
            "competencyText": {"en-us": "Compare life in the Roman Republic for patricians, plebeians, women, children, and slaves."}
        },
        {
            "competencyText": {"en-us": "Explain the spread and influence of the Latin language on Western Civilization."}
        },
        {
            "competencyText": {"en-us": "Describe the rise and fall of the ancient east African kingdoms of Kush and Axum and Christianity's development in Ethiopia. \r\n"}
        },
        {
            "competencyText": {"en-us": "Recognize significant events, figures, and contributions of classical Asian civilizations (China, India)."}
        },
        {
            "competencyText": {"en-us": "Discuss the significance of Aryan and other tribal migrations on Indian civilization."}
        },
        {
            "competencyText": {"en-us": "Explain the major beliefs and practices associated with Hinduism and the social structure of the caste system in ancient India."}
        },
        {
            "competencyText": {"en-us": "Recognize the political and cultural achievements of the Mauryan and Gupta empires."}
        },
        {
            "competencyText": {"en-us": "Explain the teachings of Buddha, the importance of Asoka, and how Buddhism spread in India, Ceylon, and other parts of Asia."}
        },
        {
            "competencyText": {"en-us": "Summarize the important achievements and contributions of ancient Indian civilization."}
        },
        {
            "competencyText": {"en-us": "Describe the concept of the Mandate of Heaven and its connection to the Zhou and later dynasties."}
        },
        {
            "competencyText": {"en-us": "Explain the basic teachings of Laozi, Confucius, and Han Fei Zi."}
        },
        {
            "competencyText": {"en-us": "Describe the contributions of classical and post classical China."}
        },
        {
            "competencyText": {"en-us": "Identify key figures from classical and post classical China."}
        },
        {
            "competencyText": {"en-us": "Explain the significance of the silk roads and maritime routes across the Indian Ocean to the movement of goods and ideas among Asia, East Africa, and the Mediterranean Basin.\r\n"}
        },
        {
            "competencyText": {"en-us": "Explain the rise and expansion of the Mongol empire and its effects on peoples of Asia and Europe including the achievements of Ghengis and Kublai Khan."}
        },
        {
            "competencyText": {"en-us": "Identify the causes and effects of Chinese isolation and the decision to limit foreign trade in the 15th century."}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the origins and purposes of government, law, and the American political system."}
        },
        {
            "competencyText": {"en-us": "Identify democratic concepts developed in ancient Greece that served as a foundation for American constitutional democracy."}
        },
        {
            "competencyText": {"en-us": "Identify how the government of the Roman Republic contributed to the development of democratic principles (separation of powers, rule of law, representative government, civic duty). \r\n"}
        },
        {
            "competencyText": {"en-us": "Evaluate the roles, rights, and responsibilities of United States citizens, and determine methods of active participation in society, government, and the political system."}
        },
        {
            "competencyText": {"en-us": "Identify principles (civic participation, role of government) from ancient Greek and Roman civilizations which are reflected in the American political process today, and discuss their effect on the American political process."}
        },
        {
            "competencyText": {"en-us": "Grade 7"}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "Understand how to use maps and other geographic representations, tools, and technology to report information."}
        },
        {
            "competencyText": {"en-us": "Locate the fifty states and their capital cities in addition to the nation's capital on a map."}
        },
        {
            "competencyText": {"en-us": "Locate on a world map the territories and protectorates of the United States of America. \r\n"}
        },
        {
            "competencyText": {"en-us": "Interpret maps to identify geopolitical divisions and boundaries of places in North America."}
        },
        {
            "competencyText": {"en-us": "Understand physical and cultural characteristics of places."}
        },
        {
            "competencyText": {"en-us": "Locate major cultural landmarks that are emblematic of the United States."}
        },
        {
            "competencyText": {"en-us": "Locate major physical landmarks that are emblematic of the United States."}
        },
        {
            "competencyText": {"en-us": "Explain how major physical characteristics, natural resources, climate, and absolute and relative location have influenced settlement, economies, and inter-governmental relations in North America."}
        },
        {
            "competencyText": {"en-us": "Describe current major cultural regions of North America."}
        },
        {
            "competencyText": {"en-us": "Understand the relationships between the Earth's ecosystems and the populations that dwell within them."}
        },
        {
            "competencyText": {"en-us": "Use maps to describe the location, abundance, and variety of natural resources in North America.\r\n"}
        },
        {
            "competencyText": {"en-us": "Understand the characteristics, distribution, and migration of human populations."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to explain cultural diffusion throughout North America."}
        },
        {
            "competencyText": {"en-us": "Use maps and other geographic tools to examine the importance of demographics within political divisions of the United States."}
        },
        {
            "competencyText": {"en-us": "Understand how human actions can impact the environment."}
        },
        {
            "competencyText": {"en-us": "Use a choropleth or other map to geographically represent current information about issues of conservation or ecology in the local community."}
        },
        {
            "competencyText": {"en-us": "Understand how to apply geography to interpret the past and present and plan for the future."}
        },
        {
            "competencyText": {"en-us": "Use Geographic Information Systems (GIS) or other technology to view maps of current information about the United States."}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": " Understand the fundamental concepts relevant to the development of a market economy."}
        },
        {
            "competencyText": {"en-us": "Explain how the principles of a market and mixed economy helped to develop the United States into a democratic nation."}
        },
        {
            "competencyText": {"en-us": "Discuss the importance of borrowing and lending in the United States, the government's role in controlling financial institutions, and list the advantages and disadvantages of using credit."}
        },
        {
            "competencyText": {"en-us": "Review the concepts of supply and demand, choice, scarcity, and opportunity cost as they relate to the development of the mixed market economy in the United States."}
        },
        {
            "competencyText": {"en-us": "Discuss the function of financial institutions in the development of a market economy."}
        },
        {
            "competencyText": {"en-us": "Assess how profits, incentives, and competition motivate individuals, households, and businesses in a free market economy."}
        },
        {
            "competencyText": {"en-us": "Compare the national budget process to the personal budget process."}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts relevant to the institutions, structure, and functions of a national economy."}
        },
        {
            "competencyText": {"en-us": "Explain how federal, state, and local taxes support the economy as a function of the United States government."}
        },
        {
            "competencyText": {"en-us": "Describe the banking system in the United States and its impact on the money supply."}
        },
        {
            "competencyText": {"en-us": "Identify and describe United States laws and regulations adopted to promote economic competition."}
        },
        {
            "competencyText": {"en-us": "Identify entrepreneurs from various gender, social, and ethnic backgrounds who started a business seeking to make a profit."}
        },
        {
            "competencyText": {"en-us": "Explain how economic institutions impact the national economy."}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts and interrelationships of the United States economy in the international marketplace."}
        },
        {
            "competencyText": {"en-us": "Explain how international trade requires a system for exchanging currency between and among nations."}
        },
        {
            "competencyText": {"en-us": "Assess how the changing value of currency affects trade of goods and services between nations."}
        },
        {
            "competencyText": {"en-us": "Compare and contrast a single resource economy with a diversified economy."}
        },
        {
            "competencyText": {"en-us": "Compare and contrast the standard of living in various countries today to that of the United States using gross domestic product (GDP) per capita as an indicator."}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the origins and purposes of government, law, and the American political system."}
        },
        {
            "competencyText": {"en-us": "Recognize how Enlightenment ideas including Montesquieu's view of separation of power and John Locke's theories related to natural law and how Locke's social contract influenced the Founding Fathers."}
        },
        {
            "competencyText": {"en-us": "Trace the impact that the Magna Carta, English Bill of Rights, Mayflower Compact, and Thomas Paine's \"Common Sense\" had on colonists' views of government."}
        },
        {
            "competencyText": {"en-us": "Describe how English policies and responses to colonial concerns led to the writing of the Declaration of Independence."}
        },
        {
            "competencyText": {"en-us": "Analyze the ideas (natural rights, role of the government) and complaints set forth in the Declaration of Independence."}
        },
        {
            "competencyText": {"en-us": "Identify how the weaknesses of the Articles of Confederation led to the writing of the Constitution."}
        },
        {
            "competencyText": {"en-us": "Interpret the intentions of the Preamble of the Constitution."}
        },
        {
            "competencyText": {"en-us": "Describe how the Constitution limits the powers of government through separation of powers and checks and balances."}
        },
        {
            "competencyText": {"en-us": "Explain the viewpoints of the Federalists and the Anti-Federalists regarding the ratification of the Constitution and inclusion of a bill of rights."}
        },
        {
            "competencyText": {"en-us": "Define the rule of law and recognize its influence on the development of the American legal, political, and governmental systems."}
        },
        {
            "competencyText": {"en-us": "Evaluate the roles, rights, and responsibilities of United States citizens, and determine methods of active participation in society, government, and the political system."}
        },
        {
            "competencyText": {"en-us": "Define the term \"citizen,\" and identify legal means of becoming a United States citizen."}
        },
        {
            "competencyText": {"en-us": "Evaluate the obligations citizens have to obey laws, pay taxes, defend the nation, and serve on juries."}
        },
        {
            "competencyText": {"en-us": "Experience the responsibilities of citizens at the local, state, or federal levels."}
        },
        {
            "competencyText": {"en-us": "Evaluate rights contained in the Bill of Rights and other amendments to the Constitution."}
        },
        {
            "competencyText": {"en-us": "Distinguish how the Constitution safeguards and limits individual rights."}
        },
        {
            "competencyText": {"en-us": "Simulate the trial process and the role of juries in the administration of justice."}
        },
        {
            "competencyText": {"en-us": "Conduct a mock election to demonstrate the voting process and its impact on a school, community, or local level."}
        },
        {
            "competencyText": {"en-us": "Identify America's current political parties, and illustrate their ideas about government."}
        },
        {
            "competencyText": {"en-us": "Evaluate candidates for political office by analyzing their qualifications, experience, issue-based platforms, debates, and political ads."}
        },
        {
            "competencyText": {"en-us": "Examine the impact of media, individuals, and interest groups on monitoring and influencing government."}
        },
        {
            "competencyText": {"en-us": "Analyze media and political communications (bias, symbolism, propaganda)."}
        },
        {
            "competencyText": {"en-us": "Develop a plan to resolve a state or local problem by researching public policy alternatives, identifying appropriate government agencies to address the issue, and determining a course of action."}
        },
        {
            "competencyText": {"en-us": "Examine multiple perspectives on public and current issues."}
        },
        {
            "competencyText": {"en-us": "Conduct a service project to further the public good."}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the principles, functions, and organization of government."}
        },
        {
            "competencyText": {"en-us": "Compare different forms of government (direct democracy, representative democracy, socialism, communism, monarchy, oligarchy, autocracy)."}
        },
        {
            "competencyText": {"en-us": "Compare parliamentary, federal, confederal, and unitary systems of government."}
        },
        {
            "competencyText": {"en-us": "Illustrate the structure and function (three branches of government established in Articles I, II, and III with corresponding powers) of government in the United States as established in the Constitution."}
        },
        {
            "competencyText": {"en-us": "Identify the relationship and division of powers between the federal government and state governments."}
        },
        {
            "competencyText": {"en-us": "Explain the Constitutional amendment process."}
        },
        {
            "competencyText": {"en-us": "Evaluate Constitutional rights and their impact on individuals and society."}
        },
        {
            "competencyText": {"en-us": "Analyze the impact of the 13th, 14th, 15th, 19th, 24th, and 26th amendments on participation of minority groups in the American political process."}
        },
        {
            "competencyText": {"en-us": "Analyze the structure, functions, and processes of the legislative, executive, and judicial branches."}
        },
        {
            "competencyText": {"en-us": "Illustrate the law making process at the local, state, and federal levels."}
        },
        {
            "competencyText": {"en-us": "Identify sources and types (civil, criminal, constitutional, military) of law."}
        },
        {
            "competencyText": {"en-us": "Diagram the levels, functions, and powers of courts at the state and federal levels."}
        },
        {
            "competencyText": {"en-us": "Analyze the significance and outcomes of landmark Supreme Court cases including, but not limited to, Marbury v. Madison, Plessy v. Ferguson, Brown v. Board of Education, Gideon v. Wainwright, Miranda v. Arizona, in re Gault, Tinker v. Des Moines, Hazelwood v. Kuhlmeier, United States v. Nixon, and Bush v. Gore."}
        },
        {
            "competencyText": {"en-us": "Compare the constitutions of the United States and Florida."}
        },
        {
            "competencyText": {"en-us": "Differentiate between local, state, and federal governments' obligations and services."}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of contemporary issues in world affairs, and evaluate the role and impact of United States foreign policy."}
        },
        {
            "competencyText": {"en-us": "Differentiate concepts related to United States domestic and foreign policy."}
        },
        {
            "competencyText": {"en-us": "Recognize government and citizen participation in international organizations."}
        },
        {
            "competencyText": {"en-us": "Describe examples of how the United States has dealt with international conflicts."}
        },
        {
            "competencyText": {"en-us": "Grade 8"}
        },
        {
            "competencyText": {"en-us": "American History"}
        },
        {
            "competencyText": {"en-us": "Use research and inquiry skills to analyze American History using primary and secondary sources."}
        },
        {
            "competencyText": {"en-us": "Provide supporting details for an answer from text, interview for oral history, check validity of information from research/text, and identify strong vs. weak arguments."}
        },
        {
            "competencyText": {"en-us": "Analyze charts, graphs, maps, photographs and timelines; analyze political cartoons; determine cause and effect.\r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze current events relevant to American History topics through a variety of electronic and print media resources."}
        },
        {
            "competencyText": {"en-us": "Differentiate fact from opinion, utilize appropriate historical research and fiction/nonfiction support materials."}
        },
        {
            "competencyText": {"en-us": "Identify, within both primary and secondary sources, the author, audience, format, and purpose of significant historical documents."}
        },
        {
            "competencyText": {"en-us": "Compare interpretations of key events and issues throughout American History."}
        },
        {
            "competencyText": {"en-us": "View historic events through the eyes of those who were there as shown in their art, writings, music, and artifacts."}
        },
        {
            "competencyText": {"en-us": "Examine the causes, course, and consequences of British settlement in the American colonies."}
        },
        {
            "competencyText": {"en-us": "Compare the relationships among the British, French, Spanish, and Dutch in their struggle for colonization of North America."}
        },
        {
            "competencyText": {"en-us": "Compare the characteristics of the New England, Middle, and Southern colonies."}
        },
        {
            "competencyText": {"en-us": "Differentiate economic systems of New England, Middle and Southern colonies including indentured servants and slaves as labor sources."}
        },
        {
            "competencyText": {"en-us": "Identify the impact of key colonial figures on the economic, political, and social development of the colonies."}
        },
        {
            "competencyText": {"en-us": "Discuss the impact of colonial settlement on Native American populations."}
        },
        {
            "competencyText": {"en-us": "Examine the causes, course, and consequences of the French and Indian War."}
        },
        {
            "competencyText": {"en-us": "Describe the contributions of key groups (Africans, Native Americans, women, and children) to the society and culture of colonial America. \r\n"}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the causes, course, and consequences of the American Revolution and the founding principles of our nation."}
        },
        {
            "competencyText": {"en-us": "Explain the consequences of the French and Indian War in British policies for the American colonies from 1763 - 1774."}
        },
        {
            "competencyText": {"en-us": "Explain American colonial reaction to British policy from 1763 - 1774."}
        },
        {
            "competencyText": {"en-us": "Recognize the contributions of the Founding Fathers (John Adams, Sam Adams, Benjamin Franklin, John Hancock, Alexander Hamilton, Thomas Jefferson, James Madison, George Mason, George Washington) during American Revolutionary efforts."}
        },
        {
            "competencyText": {"en-us": "Examine the contributions of influential groups to both the American and British war efforts during the American Revolutionary War and their effects on the outcome of the war."}
        },
        {
            "competencyText": {"en-us": "Describe the influence of individuals on social and political developments during the Revolutionary era."}
        },
        {
            "competencyText": {"en-us": "Examine the causes, course, and consequences of the American Revolution."}
        },
        {
            "competencyText": {"en-us": "Examine the structure, content, and consequences of the Declaration of Independence."}
        },
        {
            "competencyText": {"en-us": "Examine individuals and groups that affected political and social motivations during the American Revolution."}
        },
        {
            "competencyText": {"en-us": "Evaluate the structure, strengths, and weaknesses of the Articles of Confederation and its aspects that led to the Constitutional Convention."}
        },
        {
            "competencyText": {"en-us": "Examine the course and consequences of the Constitutional Convention (New Jersey Plan, Virginia Plan, Great Compromise, Three-Fifths Compromise, compromises regarding taxation and slave trade, Electoral College, state vs. federal power, empowering a president).\r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze support and opposition (Federalists, Federalist Papers, AntiFederalists, Bill of Rights) to ratification of the U.S. Constitution.\r\n"}
        },
        {
            "competencyText": {"en-us": "Examine the influences of George Washington's presidency in the formation of the new nation."}
        },
        {
            "competencyText": {"en-us": "Explain major domestic and international economic, military, political, and socio-cultural events of John Adams's presidency."}
        },
        {
            "competencyText": {"en-us": "Explain major domestic and international economic, military, political, and socio-cultural events of Thomas Jefferson's presidency."}
        },
        {
            "competencyText": {"en-us": "Examine this time period (1763-1815) from the perspective of historically under-represented groups (children, indentured servants, Native Americans, slaves, women, working class).\r\n"}
        },
        {
            "competencyText": {"en-us": "Examine key events in Florida history as each impacts this era of American history."}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the domestic and international causes, course, and consequences of westward expansion."}
        },
        {
            "competencyText": {"en-us": "Examine the causes, course, and consequences of United States westward expansion and its growing diplomatic assertiveness (War of 1812, Convention of 1818, Adams-Onis Treaty, Missouri Compromise, Monroe Doctrine, Trail of Tears, Texas annexation, Manifest Destiny, Oregon Territory, Mexican American War/Mexican Cession, California Gold Rush, Compromise of 1850, Kansas Nebraska Act, Gadsden Purchase). \r\n"}
        },
        {
            "competencyText": {"en-us": "Describe the debate surrounding the spread of slavery into western territories and Florida."}
        },
        {
            "competencyText": {"en-us": "Examine the experiences and perspectives of significant individuals and groups during this era of American History."}
        },
        {
            "competencyText": {"en-us": "Discuss the impact of westward expansion on cultural practices and migration patterns of Native American and African slave populations."}
        },
        {
            "competencyText": {"en-us": "Explain the causes, course, and consequences of the 19th century transportation revolution on the growth of the nation's economy."}
        },
        {
            "competencyText": {"en-us": "Identify technological improvements (inventions/inventors) that contributed to industrial growth."}
        },
        {
            "competencyText": {"en-us": "Explain the causes, course, and consequences (industrial growth, subsequent effect on children and women) of New England's textile industry. \r\n"}
        },
        {
            "competencyText": {"en-us": "Describe the influence of individuals on social and political developments of this era in American History."}
        },
        {
            "competencyText": {"en-us": "Analyze the causes, course and consequences of the Second Great Awakening on social reform movements."}
        },
        {
            "competencyText": {"en-us": "Analyze the impact of technological advancements on the agricultural economy and slave labor."}
        },
        {
            "competencyText": {"en-us": "Examine the aspects of slave culture including plantation life, resistance efforts, and the role of the slaves' spiritual system."}
        },
        {
            "competencyText": {"en-us": "Examine the effects of the 1804 Haitian Revolution on the United States acquisition of the Louisiana Territory."}
        },
        {
            "competencyText": {"en-us": "Explain the consequences of landmark Supreme Court decisions (McCulloch v. Maryland [1819], Gibbons v. Odgen [1824], Cherokee Nation v. Georgia [1831], and Worcester v. Georgia [1832]) significant to this era of American history. \r\n"}
        },
        {
            "competencyText": {"en-us": "Examine the causes, course, and consequences of the women's suffrage movement (1848 Seneca Falls Convention, Declaration of Sentiments).\r\n"}
        },
        {
            "competencyText": {"en-us": "Examine the causes, course, and consequences of literature movements (Transcendentalism) significant to this era of American history. \r\n"}
        },
        {
            "competencyText": {"en-us": "Identify key ideas and influences of Jacksonian democracy."}
        },
        {
            "competencyText": {"en-us": "Examine key events and peoples in Florida history as each impacts this era of American history."}
        },
        {
            "competencyText": {"en-us": "Examine the experiences and perspectives of different ethnic, national, and religious groups in Florida, explaining their contributions to Florida's and America's society and culture during the Territorial Period."}
        },
        {
            "competencyText": {"en-us": "Examine the causes, course, and consequence of the Civil War and Reconstruction including its effects on American peoples."}
        },
        {
            "competencyText": {"en-us": "Explain the causes, course, and consequence of the Civil War (sectionalism, slavery, states' rights, balance of power in the Senate).\r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze the role of slavery in the development of sectional conflict."}
        },
        {
            "competencyText": {"en-us": "Explain major domestic and international economic, military, political, and socio-cultural events of Abraham Lincoln's presidency."}
        },
        {
            "competencyText": {"en-us": "Identify the division (Confederate and Union States, Border states, western territories) of the United States at the outbreak of the Civil War. \r\n"}
        },
        {
            "competencyText": {"en-us": "Compare Union and Confederate strengths and weaknesses."}
        },
        {
            "competencyText": {"en-us": "Compare significant Civil War battles and events and their effects on civilian populations."}
        },
        {
            "competencyText": {"en-us": "Examine key events and peoples in Florida history as each impacts this era of American history."}
        },
        {
            "competencyText": {"en-us": "Explain and evaluate the policies, practices, and consequences of Reconstruction (presidential and congressional reconstruction, Johnson's impeachment, Civil Rights Act of 1866, the 13th, 14th, and 15th Amendments, opposition of Southern whites to Reconstruction, accomplishments and failures of Radical Reconstruction, presidential election of 1876, end of Reconstruction, rise of Jim Crow laws, rise of Ku Klux Klan).\r\n"}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "Understand how to use maps and other geographic representations, tools, and technology to report information."}
        },
        {
            "competencyText": {"en-us": "Use maps to explain physical and cultural attributes of major regions throughout American history."}
        },
        {
            "competencyText": {"en-us": "Use appropriate geographic tools and terms to identify and describe significant places and regions in American history."}
        },
        {
            "competencyText": {"en-us": "Understand physical and cultural characteristics of places."}
        },
        {
            "competencyText": {"en-us": "Identify the physical elements and the human elements that define and differentiate regions as relevant to American history. \r\n"}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze case studies of regional issues in different parts of the United States that have had critical economic, physical, or political ramifications."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze case studies of how selected regions of the United States have changed over time."}
        },
        {
            "competencyText": {"en-us": "Understand the relationships between the Earth's ecosystems and the populations that dwell within them."}
        },
        {
            "competencyText": {"en-us": "Locate and describe in geographic terms the major ecosystems of the United States."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to explain differing perspectives on the use of renewable and non-renewable resources in the United States and Florida over time."}
        },
        {
            "competencyText": {"en-us": "Understand the characteristics, distribution, and migration of human populations."}
        },
        {
            "competencyText": {"en-us": "Interpret population growth and other demographic data for any given place in the United States throughout its history."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze the effects throughout American history of migration to and within the United States, both on the place of origin and destination."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to explain cultural diffusion throughout the United States as it expanded its territory."}
        },
        {
            "competencyText": {"en-us": "Interpret databases, case studies, and maps to describe the role that regions play in influencing trade, migration patterns, and cultural/political interaction in the United States throughout time."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze case studies of the development, growth, and changing nature of cities and urban centers in the United States over time."}
        },
        {
            "competencyText": {"en-us": "Use political maps to describe changes in boundaries and governance throughout American history."}
        },
        {
            "competencyText": {"en-us": "Understand how human actions can impact the environment."}
        },
        {
            "competencyText": {"en-us": "Describe human dependence on the physical environment and natural resources to satisfy basic needs in local environments in the United States."}
        },
        {
            "competencyText": {"en-us": "Describe the impact of human modifications on the physical environment and ecosystems of the United States throughout history."}
        },
        {
            "competencyText": {"en-us": "Understand how to apply geography to interpret the past and present and plan for the future."}
        },
        {
            "competencyText": {"en-us": "Use appropriate maps and other graphic representations to analyze geographic problems and changes over time throughout American history."}
        },
        {
            "competencyText": {"en-us": "Illustrate places and events in U.S. history through the use of narratives and graphic representations."}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts relevant to the development of a market economy."}
        },
        {
            "competencyText": {"en-us": "Examine motivating economic factors that influenced the development of the United States economy over time including scarcity, supply and demand, opportunity costs, incentives, profits, and entrepreneurial aspects. \r\n"}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts relevant to the institutions, structure, and functions of a national economy."}
        },
        {
            "competencyText": {"en-us": "Analyze contributions of entrepreneurs, inventors, and other key individuals from various gender, social, and ethnic backgrounds in the development of the United States economy."}
        },
        {
            "competencyText": {"en-us": "Explain the economic impact of government policies."}
        },
        {
            "competencyText": {"en-us": "Assess the role of Africans and other minority groups in the economic development of the United States."}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts and interrelationships of the United States economy in the international marketplace."}
        },
        {
            "competencyText": {"en-us": "Evaluate domestic and international interdependence."}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "The student will evaluate the roles, rights, and responsibilities of United States citizens and determine methods of active participation in society, government, and the political system."}
        },
        {
            "competencyText": {"en-us": "Identify the constitutional provisions for establishing citizenship."}
        },
        {
            "competencyText": {"en-us": "Compare views of self-government and the rights and responsibilities of citizens held by Patriots, Loyalists, and other colonists."}
        },
        {
            "competencyText": {"en-us": "Recognize the role of civic virtue in the lives of citizens and leaders from the colonial period through Reconstruction."}
        },
        {
            "competencyText": {"en-us": "Identify the evolving forms of civic and political participation from the colonial period through Reconstruction."}
        },
        {
            "competencyText": {"en-us": "Apply the rights and principles contained in the Constitution and Bill of Rights to the lives of citizens today."}
        },
        {
            "competencyText": {"en-us": "Evaluate how amendments to the Constitution have expanded voting rights from our nation's early history to present day."}
        },
        {
            "competencyText": {"en-us": "The student will demonstrate an understanding of the principles, functions, and organization of government."}
        },
        {
            "competencyText": {"en-us": "Evaluate and compare the essential ideals and principles of American constitutional government expressed in primary sources from the colonial period to Reconstruction."}
        },
        {
            "competencyText": {"en-us": "Financial Literacy"}
        },
        {
            "competencyText": {"en-us": "Earning Income"}
        },
        {
            "competencyText": {"en-us": "Explain that careers are based on working at jobs in the same occupation or profession for many years. Describe the different types of education and training required by various careers."}
        },
        {
            "competencyText": {"en-us": "Identify the many decisions people must make over a lifetime about their education, jobs, and careers that affect their incomes and job opportunities."}
        },
        {
            "competencyText": {"en-us": "Explain that getting more education and learning new job skills can increase a person&rsquo;s human capital and productivity."}
        },
        {
            "competencyText": {"en-us": "Examine the fact that people with less education and fewer job skills tend to earn lower incomes than people with more education and greater job skills."}
        },
        {
            "competencyText": {"en-us": "Examine the fact that investment in education and training generally has a positive rate of return in terms of the income that people earn over a lifetime, with some education or training having a higher rate of return than others."}
        },
        {
            "competencyText": {"en-us": "Identify the opportunity costs that education, training, and development of job skills have in the terms of time, effort, and money."}
        },
        {
            "competencyText": {"en-us": "Identify that interest, dividends, and capital appreciation (gains) are forms of income earned from financial investments."}
        },
        {
            "competencyText": {"en-us": "Discuss the fact that some people receive income support from government because they have low incomes or qualify in other ways for government assistance."}
        },
        {
            "competencyText": {"en-us": "Buying Goods and Services"}
        },
        {
            "competencyText": {"en-us": "Explain why when deciding what to buy, consumers may choose to gather information from a variety of sources. Describe how the quality and usefulness of information provided by sources can vary greatly from source to source. Explain that, while many sources provide valuable information, other sources provide information that is deliberately misleading."}
        },
        {
            "competencyText": {"en-us": "Analyze a source&rsquo;s incentives in providing information about a good or service, and how a consumer can better assess the quality and usefulness of the information."}
        },
        {
            "competencyText": {"en-us": "Describe the variety of payment methods people can use in order to buy goods and services."}
        },
        {
            "competencyText": {"en-us": "Examine choosing a payment method, by weighing the costs and benefits of the different payment options."}
        },
        {
            "competencyText": {"en-us": "Discuss the fact that people may revise their budget based on unplanned expenses and changes in income."}
        },
        {
            "competencyText": {"en-us": "Saving"}
        },
        {
            "competencyText": {"en-us": "Explain that banks and other financial institutions loan funds received from depositors to borrowers and that part of the interest received from these loans is used to pay interest to depositors for the use of their money."}
        },
        {
            "competencyText": {"en-us": "Explain that, for the saver, an interest rate is the price a financial institution pays for using a saver&rsquo;s money and is normally expressed as an annual percentage of the amount saved."}
        },
        {
            "competencyText": {"en-us": "Discuss that interest rates paid on savings and charged on loans, like all prices, are determined in a market."}
        },
        {
            "competencyText": {"en-us": "Explain that, when interest rates increase, people earn more on their savings and their savings grow more quickly."}
        },
        {
            "competencyText": {"en-us": "Identify principal as the initial amount of money upon which interest is paid."}
        },
        {
            "competencyText": {"en-us": "Identify the value of a person&rsquo;s savings in the future as determined by the amount saved and the interest rate. Explain why the earlier people begin to save, the more savings they will be able to accumulate, all other things equal, as a result of the power of compound interest."}
        },
        {
            "competencyText": {"en-us": "Discuss the different reasons that people save money, including large purchases (such as higher education, autos, and homes), retirement, and unexpected events.  Discuss how people&rsquo;s tastes and preferences influence their choice of how much to save and for what to save."}
        },
        {
            "competencyText": {"en-us": "Explain that, to assure savers that their deposits are safe from bank failures, federal agencies guarantee depositors&rsquo; savings in most commercial banks, savings banks, and savings associations up to a set limit."}
        },
        {
            "competencyText": {"en-us": "Using Credit"}
        },
        {
            "competencyText": {"en-us": "Explain that people who apply for loans are told what the interest rate on the loan will be. An interest rate is the price of using someone else&rsquo;s money expressed as an annual percentage of the loan principal."}
        },
        {
            "competencyText": {"en-us": "Identify a credit card purchase as a loan from the financial institution that issued the card. Explain that credit card interest rates tend to be higher than rates for other loans. In addition, financial institutions may charge significant fees related to a credit card and its use."}
        },
        {
            "competencyText": {"en-us": "Examine the fact that borrowers who use credit cards for purchases and who do not pay the full balance when it is due pay much higher costs for their purchases because interest is charged monthly. Explain how a credit card user can avoid interest charges by paying the entire balance within the grace period specified by the financial institution."}
        },
        {
            "competencyText": {"en-us": "Explain that lenders charge different interest rates based on the risk of nonpayment by borrowers.  Describe why the higher the risk of nonpayment, the higher the interest rate charged by financial institutions, and the lower the risk of nonpayment, the lower the interest rate charged."}
        },
        {
            "competencyText": {"en-us": "Financial Investing"}
        },
        {
            "competencyText": {"en-us": "Describe the differences among the different types of financial assets, including a wide variety of financial instruments such as bank deposits, stocks, bonds, and mutual funds. Explain that real estate and commodities are also often viewed as financial assets."}
        },
        {
            "competencyText": {"en-us": "Calculate the amount of interest income received from depositing a certain amount of money in a bank account paying 1 percent per year and from owning a bond paying 5 percent per year in order to analyze that interest is received from money deposited in bank accounts as well as by owning a corporate or government bond or making a loan."}
        },
        {
            "competencyText": {"en-us": "Discuss that when people buy corporate stock, they are purchasing ownership shares in a business that if the business is profitable, they will expect to receive income in the form of dividends and/or from the increase in the stock&rsquo;s value, that the increase in the value of an asset (like a stock) is called a capital gain, and if the business is not profitable, investors could lose the money they have invested."}
        },
        {
            "competencyText": {"en-us": "Explain that the price of a financial asset is determined by the interaction of buyers and sellers in a financial market."}
        },
        {
            "competencyText": {"en-us": "Explain that the rate of return earned from investments will vary according to the amount of risk and, in general, a trade-off exists between the security of an investment and its expected rate of return."}
        },
        {
            "competencyText": {"en-us": "Protecting and Insuring"}
        },
        {
            "competencyText": {"en-us": "Analyze the fact that personal financial risk exists when unexpected events can damage health, income, property, wealth, or future opportunities."}
        },
        {
            "competencyText": {"en-us": "Identify insurance as a product that allows people to pay a fee (called a premium) now to transfer the costs of a potential loss to a third party."}
        },
        {
            "competencyText": {"en-us": "Describe how a person may self-insure by accepting a risk and saving money on a regular basis to cover a potential loss."}
        },
        {
            "competencyText": {"en-us": "Discuss why insurance policies that guarantee higher levels of payment in the event of a loss (coverage) have higher prices."}
        },
        {
            "competencyText": {"en-us": "Discuss that insurance companies charge higher premiums to cover higher-risk individuals and events because the risk of monetary loss is greater for these individuals and events."}
        },
        {
            "competencyText": {"en-us": "Explain that individuals can choose to accept some risk, to take steps to avoid or reduce risk, or to transfer risk to others through the purchase of insurance and that each option has different costs and benefits."}
        },
        {
            "competencyText": {"en-us": "Evaluate social networking sites and other online activity from the perspective of making individuals vulnerable to harm caused by identity theft or misuse of their personal information."}
        },
        {
            "competencyText": {"en-us": "Grade 9-12"}
        },
        {
            "competencyText": {"en-us": "American History"}
        },
        {
            "competencyText": {"en-us": "Use research and inquiry skills to analyze American history using primary and secondary sources."}
        },
        {
            "competencyText": {"en-us": "Describe the importance of historiography, which includes how historical knowledge is obtained and transmitted, when interpreting events in history."}
        },
        {
            "competencyText": {"en-us": "Utilize a variety of primary and secondary sources to identify author, historical significance, audience, and authenticity to understand a historical period."}
        },
        {
            "competencyText": {"en-us": "Utilize timelines to identify the time sequence of historical data."}
        },
        {
            "competencyText": {"en-us": "Analyze how images, symbols, objects, cartoons, graphs, charts, maps, and artwork may be used to interpret the significance of time periods and events from the past."}
        },
        {
            "competencyText": {"en-us": "Evaluate the validity, reliability, bias, and authenticity of current events and Internet resources."}
        },
        {
            "competencyText": {"en-us": "Use case studies to explore social, political, legal, and economic relationships in history."}
        },
        {
            "competencyText": {"en-us": "Describe various socio-cultural aspects of American life including arts, artifacts, literature, education, and publications."}
        },
        {
            "competencyText": {"en-us": "Understand the causes, course, and consequences of the Civil War and Reconstruction and its effects on the American people."}
        },
        {
            "competencyText": {"en-us": "Review causes and consequences of the Civil War."}
        },
        {
            "competencyText": {"en-us": "Assess the influence of significant people or groups on Reconstruction."}
        },
        {
            "competencyText": {"en-us": "Describe the issues that divided Republicans during the early Reconstruction era."}
        },
        {
            "competencyText": {"en-us": "Distinguish the freedoms guaranteed to African Americans and other groups with the 13th, 14th, and 15th Amendments to the Constitution."}
        },
        {
            "competencyText": {"en-us": "Assess how Jim Crow Laws influenced life for African Americans and other racial/ethnic minority groups."}
        },
        {
            "competencyText": {"en-us": "Compare the effects of the Black Codes and the Nadir on freed people, and analyze the sharecropping system and debt peonage as practiced in the United States."}
        },
        {
            "competencyText": {"en-us": "Review the Native American experience."}
        },
        {
            "competencyText": {"en-us": "Analyze the transformation of the American economy and the changing social and political conditions in response to the Industrial Revolution."}
        },
        {
            "competencyText": {"en-us": "<div>Analyze the economic challenges to American farmers and farmers' responses to these challenges in the mid to late 1800s.<\/div><p><\/p><p><\/p>"}
        },
        {
            "competencyText": {"en-us": "Examine the social, political, and economic causes, course, and consequences of the second Industrial Revolution that began in the late 19th century."}
        },
        {
            "competencyText": {"en-us": "Compare the first and second Industrial Revolutions in the United States."}
        },
        {
            "competencyText": {"en-us": "Determine how the development of steel, oil, transportation, communication, and business practices affected the United States economy."}
        },
        {
            "competencyText": {"en-us": "Identify significant inventors of the Industrial Revolution including African Americans and women."}
        },
        {
            "competencyText": {"en-us": "Analyze changes that occurred as the United States shifted from agrarian to an industrial society."}
        },
        {
            "competencyText": {"en-us": "Compare the experience of European immigrants in the east to that of Asian immigrants in the west (the Chinese Exclusion Act, Gentlemen's Agreement with Japan)."}
        },
        {
            "competencyText": {"en-us": "Examine the importance of social change and reform in the late 19th and early 20th centuries (class system, migration from farms to cities, Social Gospel movement, role of settlement houses and churches in providing services to the poor)."}
        },
        {
            "competencyText": {"en-us": "Examine causes, course, and consequences of the labor movement in the late 19th and early 20th centuries."}
        },
        {
            "competencyText": {"en-us": "Review different economic and philosophic ideologies."}
        },
        {
            "competencyText": {"en-us": "Analyze the impact of political machines in United States cities in the late 19th and early 20th centuries."}
        },
        {
            "competencyText": {"en-us": "Compare how different nongovernmental organizations and progressives worked to shape public policy, restore economic opportunities, and correct injustices in American life."}
        },
        {
            "competencyText": {"en-us": "Examine key events and peoples in Florida history as they relate to United States history."}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the changing role of the United States in world affairs through the end of World War I."}
        },
        {
            "competencyText": {"en-us": "Analyze the major factors that drove United States imperialism."}
        },
        {
            "competencyText": {"en-us": "Explain the motives of the United States acquisition of the territories."}
        },
        {
            "competencyText": {"en-us": "Examine causes, course, and consequences of the Spanish American War."}
        },
        {
            "competencyText": {"en-us": "Analyze the economic, military, and security motivations of the United States to complete the Panama Canal as well as major obstacles involved in its construction."}
        },
        {
            "competencyText": {"en-us": "Examine causes, course, and consequences of United States involvement in World War I."}
        },
        {
            "competencyText": {"en-us": "Examine how the United States government prepared the nation for war with war measures (Selective Service Act, War Industries Board, war bonds, Espionage Act, Sedition Act, Committee of Public Information)."}
        },
        {
            "competencyText": {"en-us": "Examine the impact of airplanes, battleships, new weaponry and chemical warfare in creating new war strategies (trench warfare, convoys)."}
        },
        {
            "competencyText": {"en-us": "Compare the experiences Americans (African Americans, Hispanics, Asians, women, conscientious objectors) had while serving in Europe."}
        },
        {
            "competencyText": {"en-us": "Compare how the war impacted German Americans, Asian Americans, African Americans, Hispanic Americans, Jewish Americans, Native Americans, women and dissenters in the United States."}
        },
        {
            "competencyText": {"en-us": "Examine the provisions of the Treaty of Versailles and the failure of the United States to support the League of Nations."}
        },
        {
            "competencyText": {"en-us": "Examine key events and peoples in Florida history as they relate to United States history."}
        },
        {
            "competencyText": {"en-us": "Analyze the effects of the changing social, political, and economic conditions of the Roaring Twenties and the Great Depression."}
        },
        {
            "competencyText": {"en-us": "Discuss the economic outcomes of demobilization."}
        },
        {
            "competencyText": {"en-us": "Explain the causes of the public reaction (Sacco and Vanzetti, labor, racial unrest) associated with the Red Scare."}
        },
        {
            "competencyText": {"en-us": "Examine the impact of United States foreign economic policy during the 1920s."}
        },
        {
            "competencyText": {"en-us": "Evaluate how the economic boom during the Roaring Twenties changed consumers, businesses, manufacturing, and marketing practices."}
        },
        {
            "competencyText": {"en-us": "Describe efforts by the United States and other world powers to avoid future wars."}
        },
        {
            "competencyText": {"en-us": "Analyze the influence that Hollywood, the Harlem Renaissance, the Fundamentalist movement, and prohibition had in changing American society in the 1920s."}
        },
        {
            "competencyText": {"en-us": "Examine the freedom movements that advocated civil rights for African Americans, Latinos, Asians, and women."}
        },
        {
            "competencyText": {"en-us": "Compare the views of Booker T. Washington, W.E.B. DuBois, and Marcus Garvey relating to the African American experience."}
        },
        {
            "competencyText": {"en-us": "Explain why support for the Ku Klux Klan varied in the 1920s with respect to issues such as anti-immigration, anti-African American, anti-Catholic, anti-Jewish, anti-women, and anti-union ideas."}
        },
        {
            "competencyText": {"en-us": "Analyze support for and resistance to civil rights for women, African Americans, Native Americans, and other minorities."}
        },
        {
            "competencyText": {"en-us": "Examine causes, course, and consequences of the Great Depression and the New Deal."}
        },
        {
            "competencyText": {"en-us": "Examine key events and people in Florida history as they relate to United States history."}
        },
        {
            "competencyText": {"en-us": "Understand the causes and course of World War II, the character of the war at home and abroad, and its reshaping of the United States role in the post-war world."}
        },
        {
            "competencyText": {"en-us": "Examine causes, course, and consequences of World War II on the United States and the world."}
        },
        {
            "competencyText": {"en-us": "Describe the United States response in the early years of World War II (Neutrality Acts, Cash and Carry, Lend Lease Act)."}
        },
        {
            "competencyText": {"en-us": "Analyze the impact of the Holocaust during World War II on Jews as well as other groups."}
        },
        {
            "competencyText": {"en-us": "Examine efforts to expand or contract rights for various populations during World War II."}
        },
        {
            "competencyText": {"en-us": "Explain the impact of World War II on domestic government policy."}
        },
        {
            "competencyText": {"en-us": "Analyze the use of atomic weapons during World War II and the aftermath of the bombings."}
        },
        {
            "competencyText": {"en-us": "Describe the attempts to promote international justice through the Nuremberg Trials."}
        },
        {
            "competencyText": {"en-us": "Analyze the effects of the Red Scare on domestic United States policy."}
        },
        {
            "competencyText": {"en-us": "Describe the rationale for the formation of the United Nations, including the contribution of Mary McLeod Bethune."}
        },
        {
            "competencyText": {"en-us": "Examine causes, course, and consequences of the early years of the Cold War (Truman Doctrine, Marshall Plan, NATO, Warsaw Pact)."}
        },
        {
            "competencyText": {"en-us": "Examine the controversy surrounding the proliferation of nuclear technology in the United States and the world."}
        },
        {
            "competencyText": {"en-us": "Examine causes, course, and consequences of the Korean War."}
        },
        {
            "competencyText": {"en-us": "Analyze significant foreign policy events during the Truman, Eisenhower, Kennedy, Johnson, and Nixon administrations."}
        },
        {
            "competencyText": {"en-us": "Analyze causes, course, and consequences of the Vietnam War."}
        },
        {
            "competencyText": {"en-us": "Examine key events and peoples in Florida history as they relate to United States history."}
        },
        {
            "competencyText": {"en-us": "Understand the rise and continuing international influence of the United States as a world leader and the impact of contemporary social and political movements on American life."}
        },
        {
            "competencyText": {"en-us": "Identify causes for Post-World War II prosperity and its effects on American society."}
        },
        {
            "competencyText": {"en-us": "Compare the relative prosperity between different ethnic groups and social classes in the post-World War II period."}
        },
        {
            "competencyText": {"en-us": "Examine the changing status of women in the United States from post-World War II to present."}
        },
        {
            "competencyText": {"en-us": "Evaluate the success of 1960s era presidents' foreign and domestic policies."}
        },
        {
            "competencyText": {"en-us": "Compare nonviolent and violent approaches utilized by groups (African Americans, women, Native Americans, Hispanics) to achieve civil rights."}
        },
        {
            "competencyText": {"en-us": "Assess key figures and organizations in shaping the Civil Rights Movement and Black Power Movement."}
        },
        {
            "competencyText": {"en-us": "Assess the building of coalitions between African Americans, whites, and other groups in achieving integration and equal rights."}
        },
        {
            "competencyText": {"en-us": "Analyze significant Supreme Court decisions relating to integration, busing, affirmative action, the rights of the accused, and reproductive rights."}
        },
        {
            "competencyText": {"en-us": "Examine the similarities of social movements (Native Americans, Hispanics, women, anti-war protesters) of the 1960s and 1970s.\r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze the significance of Vietnam and Watergate on the government and people of the United States."}
        },
        {
            "competencyText": {"en-us": "Analyze the foreign policy of the United States as it relates to Africa, Asia, the Caribbean, Latin America, and the Middle East."}
        },
        {
            "competencyText": {"en-us": "Analyze political, economic, and social concerns that emerged at the end of the 20th century and into the 21st century."}
        },
        {
            "competencyText": {"en-us": "Analyze the attempts to extend New Deal legislation through the Great Society and the successes and failures of these programs to promote social and economic stability."}
        },
        {
            "competencyText": {"en-us": "Review the role of the United States as a participant in the global economy (trade agreements, international competition, impact on American labor, environmental concerns)."}
        },
        {
            "competencyText": {"en-us": "Analyze the effects of foreign and domestic terrorism on the American people."}
        },
        {
            "competencyText": {"en-us": "Examine changes in immigration policy and attitudes toward immigration since 1950."}
        },
        {
            "competencyText": {"en-us": "Examine key events and key people in Florida history as they relate to United States history."}
        },
        {
            "competencyText": {"en-us": "Geography"}
        },
        {
            "competencyText": {"en-us": "Understand how to use maps and other geographic representations, tools, and technology to report information."}
        },
        {
            "competencyText": {"en-us": "Design maps using a variety of technologies based on descriptive data to explain physical and cultural attributes of major world regions."}
        },
        {
            "competencyText": {"en-us": "Use spatial perspective and appropriate geographic terms and tools, including the Six Essential Elements, as organizational schema to describe any given place."}
        },
        {
            "competencyText": {"en-us": "Employ applicable units of measurement and scale to solve simple locational problems using maps and globes."}
        },
        {
            "competencyText": {"en-us": "Analyze geographic information from a variety of sources including primary sources, atlases, computer, and digital sources, Geographic Information Systems (GIS), and a broad variety of maps."}
        },
        {
            "competencyText": {"en-us": "Understand physical and cultural characteristics of places."}
        },
        {
            "competencyText": {"en-us": "Identify the physical characteristics and the human characteristics that define and differentiate regions.<br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Describe the factors and processes that contribute to the differences between developing and developed regions of the world."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze case studies of regional issues in different parts of the world that have critical economic, physical, or political ramifications."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze case studies of how selected regions change over time."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze case studies of debates over how human actions modify a selected region."}
        },
        {
            "competencyText": {"en-us": "Understand the relationships between the Earth's ecosystems and the populations that dwell within them."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms to locate and describe major ecosystems of Earth.\r\n"}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to explain how weather and climate influence the natural character of a place."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to explain differing perspectives on the use of renewable and non-renewable resources in Florida, the United States, and the world."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to explain how the Earth's internal changes and external changes influence the character of places.<br />\r\n<br />\r\n"}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to explain how hydrology influences the physical character of a place."}
        },
        {
            "competencyText": {"en-us": "Understand the characteristics, distribution, and migration of human populations."}
        },
        {
            "competencyText": {"en-us": "Interpret population growth and other demographic data for any given place."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze the push/pull factors contributing to human migration within and among places."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze the effects of migration both on the place of origin and destination, including border areas."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze case studies of issues in globalization."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze case studies of the development, growth, and changing nature of cities and urban centers."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to predict the effect of a change in a specific characteristic of a place on the human population of that place."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to explain cultural diffusion throughout places, regions, and the world."}
        },
        {
            "competencyText": {"en-us": "Use geographic concepts to analyze spatial phenomena and to discuss economic, political, and social factors that define and interpret space."}
        },
        {
            "competencyText": {"en-us": "Use political maps to describe the change in boundaries and governments within continents over time."}
        },
        {
            "competencyText": {"en-us": "Understand how human actions can impact the environment."}
        },
        {
            "competencyText": {"en-us": "Analyze case studies of how the Earth's physical systems affect humans."}
        },
        {
            "competencyText": {"en-us": "Analyze case studies of how changes in the physical environment of a place can increase or diminish its capacity to support human activity."}
        },
        {
            "competencyText": {"en-us": "Analyze case studies of the effects of human use of technology on the environment of places."}
        },
        {
            "competencyText": {"en-us": "Analyze case studies of how humans impact the diversity and productivity of ecosystems."}
        },
        {
            "competencyText": {"en-us": "Use geographic terms and tools to analyze case studies of policies and programs for resource use and management."}
        },
        {
            "competencyText": {"en-us": "Analyze case studies to predict how a change to an environmental factor can affect an ecosystem."}
        },
        {
            "competencyText": {"en-us": "Understand how to apply geography to interpret the past and present and plan for the future."}
        },
        {
            "competencyText": {"en-us": "Use appropriate maps and other graphic representations to analyze geographic problems and changes over time."}
        },
        {
            "competencyText": {"en-us": "Develop databases about specific places and provide a simple analysis about their importance."}
        },
        {
            "competencyText": {"en-us": "Formulate hypotheses and test geographic models that demonstrate complex relationships between physical and cultural phenomena."}
        },
        {
            "competencyText": {"en-us": "Translate narratives about places and events into graphic representations. \r\n"}
        },
        {
            "competencyText": {"en-us": "Develop criteria for assessing issues relating to human spatial organization and environmental stability to identify solutions."}
        },
        {
            "competencyText": {"en-us": "Economics"}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts relevant to the development of a market economy."}
        },
        {
            "competencyText": {"en-us": "Identify the factors of production and why they are necessary for the production of goods and services."}
        },
        {
            "competencyText": {"en-us": "Analyze production possibilities curves to explain choice, scarcity, and opportunity costs."}
        },
        {
            "competencyText": {"en-us": "Compare how the various economic systems (traditional, market, command, mixed) answer the questions: (1) What to produce?; (2) How to produce?; and (3) For whom to produce?\r\n"}
        },
        {
            "competencyText": {"en-us": "Define supply, demand, quantity supplied,and quantity demanded;graphically illustrate situations that would cause changes in each, and demonstrate how the equilibrium price of a product is determined by the interaction of supply and demand in the market place. \r\n"}
        },
        {
            "competencyText": {"en-us": "Compare different forms of business organizations."}
        },
        {
            "competencyText": {"en-us": "Compare the basic characteristics of the four market structures (monopoly, oligopoly, monopolistic competition, pure competition).\r\n"}
        },
        {
            "competencyText": {"en-us": "Graph and explain how firms determine price and output through marginal cost analysis."}
        },
        {
            "competencyText": {"en-us": "Explain ways firms engage in price and nonprice competition."}
        },
        {
            "competencyText": {"en-us": "Describe how the earnings of workers are determined."}
        },
        {
            "competencyText": {"en-us": "Explain the use of fiscal policy (taxation, spending) to promote price stability, full employment, and economic growth.\r\n"}
        },
        {
            "competencyText": {"en-us": "Explain how the Federal Reserve uses the tools of monetary policy (discount rate, reserve requirement, open market operations) to promote price stability, full employment, and economic growth.\r\n"}
        },
        {
            "competencyText": {"en-us": "Examine the four phases of the business cycle (peak, contraction - unemployment, trough, expansion - inflation).\r\n"}
        },
        {
            "competencyText": {"en-us": "Explain the basic functions and characteristics of money, and describe the composition of the money supply in the United States.\r\n"}
        },
        {
            "competencyText": {"en-us": "Compare credit, savings, and investment services available to the consumer from financial institutions."}
        },
        {
            "competencyText": {"en-us": "Describe the risk and return profiles of various investment vehicles and the importance of diversification."}
        },
        {
            "competencyText": {"en-us": "Construct a one-year budget plan for a specific career path including expenses and construction of a credit plan for purchasing a major item."}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts relevant to the institutions, structure, and functions of a national economy."}
        },
        {
            "competencyText": {"en-us": "Identify and explain broad economic goals. \r\n"}
        },
        {
            "competencyText": {"en-us": "Use a decision-making model to analyze a public policy issue affecting the student's community that incorporates defining a problem, analyzing the potential consequences, and considering the alternatives."}
        },
        {
            "competencyText": {"en-us": "Research contributions of entrepreneurs, inventors, and other key individuals from various gender, social, and ethnic backgrounds in the development of the United States."}
        },
        {
            "competencyText": {"en-us": "Diagram and explain the problems that occur when government institutes wage and price controls, and explain the rationale for these controls."}
        },
        {
            "competencyText": {"en-us": "Analyze how capital investments may impact productivity and economic growth. \r\n"}
        },
        {
            "competencyText": {"en-us": "Examine the benefits of natural monopolies and the purposes of government regulation of these monopolies. \r\n"}
        },
        {
            "competencyText": {"en-us": "Identify the impact of inflation on society."}
        },
        {
            "competencyText": {"en-us": "Differentiate between direct and indirect taxes, and describe the progressivity of taxes (progressive, proportional, regressive)."}
        },
        {
            "competencyText": {"en-us": "Analyze how changes in federal spending and taxation affect budget deficits and surpluses and the national debt."}
        },
        {
            "competencyText": {"en-us": "Describe the organization and functions of the Federal Reserve System."}
        },
        {
            "competencyText": {"en-us": "Assess the economic impact of negative and positive externalities on the local, state, and national environment."}
        },
        {
            "competencyText": {"en-us": "Construct a circular flow diagram for an open-market economy including elements of households, firms, government, financial institutions, product and factor markets, and international trade."}
        },
        {
            "competencyText": {"en-us": "Understand the fundamental concepts and interrelationships of the United States economy in the international marketplace."}
        },
        {
            "competencyText": {"en-us": "Demonstrate the impact of inflation on world economies."}
        },
        {
            "competencyText": {"en-us": "Examine absolute and comparative advantage, and explain why most trade occurs because of comparative advantage.\r\n"}
        },
        {
            "competencyText": {"en-us": "Discuss the effect of barriers to trade and why nations sometimes erect barriers to trade or establish free trade zones."}
        },
        {
            "competencyText": {"en-us": "Assess the economic impact of negative and positive externalities on the international environment."}
        },
        {
            "competencyText": {"en-us": "Compare the current United States economy with other developed and developing nations."}
        },
        {
            "competencyText": {"en-us": "Differentiate and draw conclusions about historical economic thought theorized by economists."}
        },
        {
            "competencyText": {"en-us": "World History"}
        },
        {
            "competencyText": {"en-us": "Utilize historical inquiry skills and analytical processes."}
        },
        {
            "competencyText": {"en-us": "Use timelines to establish cause and effect relationships of historical events."}
        },
        {
            "competencyText": {"en-us": "Compare time measurement systems used by different cultures. \r\n"}
        },
        {
            "competencyText": {"en-us": "Interpret and evaluate primary and secondary sources."}
        },
        {
            "competencyText": {"en-us": "Explain how historians use historical inquiry and other sciences to understand the past."}
        },
        {
            "competencyText": {"en-us": "Compare conflicting interpretations or schools of thought about world events and individual contributions to history (historiography).\r\n"}
        },
        {
            "competencyText": {"en-us": "Evaluate the role of history in shaping identity and character."}
        },
        {
            "competencyText": {"en-us": "Recognize significant events, figures, and contributions of medieval civilizations (Byzantine Empire, Western Europe, Japan)."}
        },
        {
            "competencyText": {"en-us": "Locate the extent of Byzantine territory at the height of the empire."}
        },
        {
            "competencyText": {"en-us": "Describe the impact of Constantine the Great's establishment of \"New Rome\" (Constantinople) and his recognition of Christianity as a legal religion.\r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze the extent to which the Byzantine Empire was a continuation of the old Roman Empire and in what ways it was a departure."}
        },
        {
            "competencyText": {"en-us": "Identify key figures associated with the Byzantine Empire."}
        },
        {
            "competencyText": {"en-us": "Explain the contributions of the Byzantine Empire. \r\n"}
        },
        {
            "competencyText": {"en-us": "Describe the causes and effects of the Iconoclast controversy of the 8th and 9th centuries and the 11th century Christian schism between the churches of Constantinople and Rome.\r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze causes (Justinian's Plague, ongoing attacks from the \"barbarians,\" the Crusades, and internal political turmoil) of the decline of the Byzantine Empire. \r\n"}
        },
        {
            "competencyText": {"en-us": "Describe the rise of the Ottoman Turks, the conquest of Constantinople in 1453, and the subsequent growth of the Ottoman empire under the sultanate including Mehmet the Conqueror and Suleyman the Magnificent."}
        },
        {
            "competencyText": {"en-us": "Analyze the impact of the collapse of the Western Roman Empire on Europe."}
        },
        {
            "competencyText": {"en-us": "Describe the orders of medieval social hierarchy, the changing role of the Church, the emergence of feudalism, and the development of private property as a distinguishing feature of Western Civilization."}
        },
        {
            "competencyText": {"en-us": "Describe the rise and achievements of significant rulers in medieval Europe."}
        },
        {
            "competencyText": {"en-us": "Recognize the importance of Christian monasteries and convents as centers of education, charitable and missionary activity, economic productivity, and political power."}
        },
        {
            "competencyText": {"en-us": "Explain how Western civilization arose from a synthesis of classical Greco-Roman civilization, Judeo-Christian influence, and the cultures of northern European peoples promoting a cultural unity in Europe."}
        },
        {
            "competencyText": {"en-us": "Describe the causes and effects of the Great Famine of 1315-1316, The Black Death, The Great Schism of 1378, and the Hundred Years War on Western Europe."}
        },
        {
            "competencyText": {"en-us": "Determine the factors that contributed to the growth of a modern economy."}
        },
        {
            "competencyText": {"en-us": "Trace the growth and development of a national identity in the countries of England, France, and Spain."}
        },
        {
            "competencyText": {"en-us": "Identify key figures, artistic, and intellectual achievements of the medieval period in Western Europe."}
        },
        {
            "competencyText": {"en-us": "Describe developments in medieval English legal and constitutional history and their importance to the rise of modern democratic institutions and procedures."}
        },
        {
            "competencyText": {"en-us": "Describe the impact of Japan's physiography on its economic and political development."}
        },
        {
            "competencyText": {"en-us": "Summarize the major cultural, economic, political, and religious developments in medieval Japan."}
        },
        {
            "competencyText": {"en-us": "Compare Japanese feudalism with Western European feudalism during the Middle Ages."}
        },
        {
            "competencyText": {"en-us": "Describe Japan's cultural and economic relationship to China and Korea."}
        },
        {
            "competencyText": {"en-us": "Recognize significant events, figures, and contributions of Islamic, Meso and South American, and Sub-Saharan African civilizations."}
        },
        {
            "competencyText": {"en-us": "Discuss significant people and beliefs associated with Islam."}
        },
        {
            "competencyText": {"en-us": "Compare the major beliefs and principles of Judaism, Christianity, and Islam.\r\n"}
        },
        {
            "competencyText": {"en-us": "Determine the causes, effects, and extent of Islamic military expansion through Central Asia, North Africa, and the Iberian Peninsula."}
        },
        {
            "competencyText": {"en-us": "Describe the expansion of Islam into India and the relationship between Muslims and Hindus."}
        },
        {
            "competencyText": {"en-us": "Describe the achievements, contributions, and key figures associated with the Islamic Golden Age."}
        },
        {
            "competencyText": {"en-us": "Describe key economic, political, and social developments in Islamic history."}
        },
        {
            "competencyText": {"en-us": "Analyze the causes, key events, and effects of the European response to Islamic expansion beginning in the 7th century."}
        },
        {
            "competencyText": {"en-us": "Identify important figures associated with the Crusades."}
        },
        {
            "competencyText": {"en-us": "Trace the growth of major sub-Saharan African kingdoms and empires."}
        },
        {
            "competencyText": {"en-us": "Identify key significant economic, political, and social characteristics of Ghana."}
        },
        {
            "competencyText": {"en-us": "Identify key figures and significant economic, political, and social characteristics associated with Mali."}
        },
        {
            "competencyText": {"en-us": "Identify key figures and significant economic, political, and social characteristics associated with Songhai."}
        },
        {
            "competencyText": {"en-us": "Compare economic, political, and social developments in East, West, and South Africa."}
        },
        {
            "competencyText": {"en-us": "Examine the internal and external factors that led to the fall of the empires of Ghana, Mali, and Songhai."}
        },
        {
            "competencyText": {"en-us": "Analyze the legacies of the Olmec, Zapotec, and Chavin on later Meso and South American civilizations."}
        },
        {
            "competencyText": {"en-us": "Locate major civilizations of Mesoamerica and Andean South America."}
        },
        {
            "competencyText": {"en-us": "Describe the roles of people in the Maya, Inca, and Aztec societies."}
        },
        {
            "competencyText": {"en-us": "Compare the key economic, cultural, and political characteristics of the major civilizations of Meso and South America."}
        },
        {
            "competencyText": {"en-us": "Determine the impact of significant Meso and South American rulers such as Pacal the Great, Moctezuma I, and Huayna Capac."}
        },
        {
            "competencyText": {"en-us": "Analyze the causes, events, and effects of the Renaissance, Reformation, Scientific Revolution, and Age of Exploration."}
        },
        {
            "competencyText": {"en-us": "Identify the economic and political causes for the rise of the Italian city-states (Florence, Milan, Naples, Rome, Venice).\r\n"}
        },
        {
            "competencyText": {"en-us": "Recognize major influences on the architectural, artistic, and literary developments of Renaissance Italy (Classical, Byzantine, Islamic, Western European).\r\n"}
        },
        {
            "competencyText": {"en-us": "Identify the major artistic, literary, and technological contributions of individuals during the Renaissance."}
        },
        {
            "competencyText": {"en-us": "Identify characteristics of Renaissance humanism in works of art."}
        },
        {
            "competencyText": {"en-us": "Describe how ideas from the Middle Ages and Renaissance led to the Scientific Revolution."}
        },
        {
            "competencyText": {"en-us": "Describe how scientific theories and methods of the Scientific Revolution challenged those of the early classical and medieval periods."}
        },
        {
            "competencyText": {"en-us": "Identify criticisms of the Roman Catholic Church by individuals such as Wycliffe, Hus and Erasmus and their impact on later reformers."}
        },
        {
            "competencyText": {"en-us": "Summarize religious reforms associated with Luther, Calvin, Zwingli, Henry VIII, and John of Leyden and the effects of the Reformation on Europe."}
        },
        {
            "competencyText": {"en-us": "Analyze the Roman Catholic Church's response to the Protestant Reformation in the forms of the Counter and Catholic Reformation."}
        },
        {
            "competencyText": {"en-us": "Identify the major contributions of individuals associated with the Scientific Revolution."}
        },
        {
            "competencyText": {"en-us": "Summarize the causes that led to the Age of Exploration, and identify major voyages and sponsors."}
        },
        {
            "competencyText": {"en-us": "Evaluate the scope and impact of the Columbian Exchange on Europe, Africa, Asia, and the Americas.\r\n"}
        },
        {
            "competencyText": {"en-us": "Examine the various economic and political systems of Portugal, Spain, the Netherlands, France, and England in the Americas."}
        },
        {
            "competencyText": {"en-us": "Recognize the practice of slavery and other forms of forced labor experienced during the 13th through 17th centuries in East Africa, West Africa, Europe, Southwest Asia, and the Americas."}
        },
        {
            "competencyText": {"en-us": "Explain the origins, developments, and impact of the trans-Atlantic slave trade between West Africa and the Americas."}
        },
        {
            "competencyText": {"en-us": "Analyze the causes, events, and effects of the Enlightenment and its impact on the American, French and other Revolutions."}
        },
        {
            "competencyText": {"en-us": "Compare the causes and effects of the development of constitutional monarchy in England with those of the development of absolute monarchy in France, Spain, and Russia."}
        },
        {
            "competencyText": {"en-us": "Identify major causes of the Enlightenment."}
        },
        {
            "competencyText": {"en-us": "Summarize the major ideas of Enlightenment philosophers.\r\n"}
        },
        {
            "competencyText": {"en-us": "Evaluate the impact of Enlightenment ideals on the development of economic, political, and religious structures in the Western world."}
        },
        {
            "competencyText": {"en-us": "Analyze the extent to which the Enlightenment impacted the American and French Revolutions."}
        },
        {
            "competencyText": {"en-us": "Summarize the important causes, events, and effects of the French Revolution including the rise and rule of Napoleon."}
        },
        {
            "competencyText": {"en-us": "Describe the causes and effects of 19th Latin American and Caribbean independence movements led by people including Bolivar, de San Martin, and L' Ouverture."}
        },
        {
            "competencyText": {"en-us": "Understand the development of Western and non-Western nationalism, industrialization and imperialism, and the significant processes and consequences of each."}
        },
        {
            "competencyText": {"en-us": "Describe the agricultural and technological innovations that led to industrialization in Great Britain and its subsequent spread to continental Europe, the United States, and Japan."}
        },
        {
            "competencyText": {"en-us": "Summarize the social and economic effects of the Industrial Revolution."}
        },
        {
            "competencyText": {"en-us": "Compare the philosophies of capitalism, socialism, and communism as described by Adam Smith, Robert Owen, and Karl Marx."}
        },
        {
            "competencyText": {"en-us": "Describe the 19th and early 20th century social and political reforms and reform movements and their effects in Africa, Asia, Europe, the United States, the Caribbean, and Latin America."}
        },
        {
            "competencyText": {"en-us": "Summarize the causes, key events, and effects of the unification of Italy and Germany."}
        },
        {
            "competencyText": {"en-us": "Analyze the causes and effects of imperialism."}
        },
        {
            "competencyText": {"en-us": "Identify major events in China during the 19th and early 20th centuries related to imperialism."}
        },
        {
            "competencyText": {"en-us": "Recognize significant causes, events, figures, and consequences of the Great War period and the impact on worldwide balance of power."}
        },
        {
            "competencyText": {"en-us": "Analyze the causes of World War I including the formation of European alliances and the roles of imperialism, nationalism, and militarism."}
        },
        {
            "competencyText": {"en-us": "Describe the changing nature of warfare during World War I."}
        },
        {
            "competencyText": {"en-us": "Summarize significant effects of World War I."}
        },
        {
            "competencyText": {"en-us": "Describe the causes and effects of the German economic crisis of the 1920s and the global depression of the 1930s, and analyze how governments responded to the Great Depression."}
        },
        {
            "competencyText": {"en-us": "Describe the rise of authoritarian governments in the Soviet Union, Italy, Germany, and Spain, and analyze the policies and main ideas of Vladimir Lenin, Joseph Stalin, Benito Mussolini, Adolf Hitler, and Francisco Franco.\r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze the restriction of individual rights and the use of mass terror against populations in the Soviet Union, Nazi Germany, and occupied territories."}
        },
        {
            "competencyText": {"en-us": "Trace the causes and key events related to World War II."}
        },
        {
            "competencyText": {"en-us": "Explain the causes, events, and effects of the Holocaust (1933-1945) including its roots in the long tradition of anti-Semitism, 19th century ideas about race and nation, and Nazi dehumanization of the Jews and other victims."}
        },
        {
            "competencyText": {"en-us": "Identify the wartime strategy and post-war plans of the Allied leaders. \r\n"}
        },
        {
            "competencyText": {"en-us": "Summarize the causes and effects of President Truman's decision to drop the atomic bombs on Japan."}
        },
        {
            "competencyText": {"en-us": "Describe the effects of World War II."}
        },
        {
            "competencyText": {"en-us": "Recognize significant events and people from the post World War II and Cold War eras."}
        },
        {
            "competencyText": {"en-us": "Identify the United States and Soviet aligned states of Europe, and contrast their political and economic characteristics.\r\n"}
        },
        {
            "competencyText": {"en-us": "Describe characteristics of the early Cold War."}
        },
        {
            "competencyText": {"en-us": "Summarize key developments in post-war China."}
        },
        {
            "competencyText": {"en-us": "Summarize the causes and effects of the arms race and proxy wars in Africa, Asia, Latin America, and the Middle East."}
        },
        {
            "competencyText": {"en-us": "Identify the factors that led to the decline and fall of communism in the Soviet Union and Eastern Europe."}
        },
        {
            "competencyText": {"en-us": "Explain the 20th century background for the establishment of the modern state of Israel in 1948 and the ongoing military and political conflicts between Israel and the Arab-Muslim world."}
        },
        {
            "competencyText": {"en-us": "Compare post-war independence movements in African, Asian, and Caribbean countries."}
        },
        {
            "competencyText": {"en-us": "Describe the rise and goals of nationalist leaders in the post-war era and the impact of their rule on their societies."}
        },
        {
            "competencyText": {"en-us": "Analyze the successes and failures of democratic reform movements in Africa, Asia, the Caribbean, and Latin America."}
        },
        {
            "competencyText": {"en-us": "Explain the impact of religious fundamentalism in the last half of the 20th century, and identify related events and forces in the Middle East over the last several decades."}
        },
        {
            "competencyText": {"en-us": "Identify major economic, political, social, and technological trends beginning in the 20th century."}
        },
        {
            "competencyText": {"en-us": "Identify major scientific figures and breakthroughs of the 20th century, and assess their impact on contemporary life."}
        },
        {
            "competencyText": {"en-us": "Describe the causes and effects of post-World War II economic and demographic changes."}
        },
        {
            "competencyText": {"en-us": "Explain cultural, historical, and economic factors and governmental policies that created the opportunities for ethnic cleansing or genocide in Cambodia, the Balkans, Rwanda, and Darfur, and describe various governmental and non-governmental responses to them."}
        },
        {
            "competencyText": {"en-us": "Describe the causes and effects of twentieth century nationalist conflicts."}
        },
        {
            "competencyText": {"en-us": "Assess the social and economic impact of pandemics on a global scale, particularly within the developing and under-developed world."}
        },
        {
            "competencyText": {"en-us": "Analyze the rise of regional trade blocs such as the European Union and NAFTA, and predict the impact of increased globalization in the 20th and 21st centuries."}
        },
        {
            "competencyText": {"en-us": "Describe the impact of and global response to international terrorism."}
        },
        {
            "competencyText": {"en-us": "Humanities"}
        },
        {
            "competencyText": {"en-us": "Identify and analyze the historical, social, and cultural contexts of the arts."}
        },
        {
            "competencyText": {"en-us": "Relate works in the arts (architecture, dance, music, theatre, and visual arts) of varying styles and genre according to the periods in which they were created."}
        },
        {
            "competencyText": {"en-us": "Describe how historical events, social context, and culture impact forms, techniques, and purposes of works in the arts, including the relationship between a government and its citizens."}
        },
        {
            "competencyText": {"en-us": "Relate works in the arts to various cultures."}
        },
        {
            "competencyText": {"en-us": "Explain philosophical beliefs as they relate to works in the arts."}
        },
        {
            "competencyText": {"en-us": "Examine artistic response to social issues and new ideas in various cultures."}
        },
        {
            "competencyText": {"en-us": "Analyze how current events are explained by artistic and cultural trends of the past."}
        },
        {
            "competencyText": {"en-us": "Know terminology of art forms (narthex, apse, triforium of Gothic cathedral) within cultures and use appropriately in oral and written references. \r\n"}
        },
        {
            "competencyText": {"en-us": "Respond critically and aesthetically to various works in the arts."}
        },
        {
            "competencyText": {"en-us": "Identify specific characteristics of works within various art forms (architecture, dance, film, literature, music, theatre, and visual arts).\r\n"}
        },
        {
            "competencyText": {"en-us": "Classify styles, forms, types, and genres within art forms. \r\n"}
        },
        {
            "competencyText": {"en-us": "Apply various types of critical analysis (contextual, formal, and intuitive criticism) to works in the arts, including the types and use of symbolism within art forms and their philosophical implications.\r\n"}
        },
        {
            "competencyText": {"en-us": "Examine the effects that works in the arts have on groups, individuals, and cultures."}
        },
        {
            "competencyText": {"en-us": "Describe how historical, social, cultural, and physical settings influence an audience's aesthetic response."}
        },
        {
            "competencyText": {"en-us": "Understand how transportation, trade, communication, science, and technology influence the progression and regression of cultures."}
        },
        {
            "competencyText": {"en-us": "Analyze the effects of transportation, trade, communication, science, and technology on the preservation and diffusion of culture."}
        },
        {
            "competencyText": {"en-us": "Identify social, moral, ethical, religious, and legal issues arising from technological and scientific developments, and examine their influence on works of arts within a culture.\r\n"}
        },
        {
            "competencyText": {"en-us": "Identify contributions made by various world cultures through trade and communication, and form a hypothesis on future contributions and changes.\r\n"}
        },
        {
            "competencyText": {"en-us": "Civics and Government"}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the origins and purposes of government, law, and the American political system."}
        },
        {
            "competencyText": {"en-us": "Evaluate, take, and defend positions on the founding ideals and principles in American Constitutional government."}
        },
        {
            "competencyText": {"en-us": "Explain how the Declaration of Independence reflected the political principles of popular sovereignty, social contract, natural rights, and individual rights."}
        },
        {
            "competencyText": {"en-us": "Evaluate the ideals and principles of the founding documents (Declaration of Independence, Articles of Confederation, Federalist Papers) that shaped American Democracy.\r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze and categorize the diverse viewpoints presented by the Federalists and the Anti-Federalists concerning ratification of the Constitution and inclusion of a bill of rights."}
        },
        {
            "competencyText": {"en-us": "Evaluate how the Constitution and its amendments reflect the political principles of rule of law, checks and balances, separation of powers, republicanism, democracy, and federalism."}
        },
        {
            "competencyText": {"en-us": "Evaluate the roles, rights, and responsibilities of United States citizens and determine methods of active participation in society, government, and the political system."}
        },
        {
            "competencyText": {"en-us": "Evaluate the constitutional provisions establishing citizenship, and assess the criteria among citizens by birth, naturalized citizens, and non-citizens. \r\n"}
        },
        {
            "competencyText": {"en-us": "Evaluate the importance of political participation and civic participation."}
        },
        {
            "competencyText": {"en-us": "Experience the responsibilities of citizens at the local, state, or federal levels."}
        },
        {
            "competencyText": {"en-us": "Evaluate, take, and defend positions on issues that cause the government to balance the interests of individuals with the public good.\r\n"}
        },
        {
            "competencyText": {"en-us": "Conduct a service project to further the public good."}
        },
        {
            "competencyText": {"en-us": "Evaluate, take, and defend positions about rights protected by the Constitution and Bill of Rights."}
        },
        {
            "competencyText": {"en-us": "Explain why rights have limits and are not absolute."}
        },
        {
            "competencyText": {"en-us": "Analyze the impact of citizen participation as a means of achieving political and social change."}
        },
        {
            "competencyText": {"en-us": "Identify the expansion of civil rights and liberties by examining the principles contained in primary documents."}
        },
        {
            "competencyText": {"en-us": "Monitor current public issues in Florida. \r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze public policy solutions or courses of action to resolve a local, state, or federal issue."}
        },
        {
            "competencyText": {"en-us": "Explain the changing roles of television, radio, press, and Internet in political communication."}
        },
        {
            "competencyText": {"en-us": "Analyze various forms of political communication and evaluate for bias, factual accuracy, omission, and emotional appeal."}
        },
        {
            "competencyText": {"en-us": "Evaluate the processes and results of an election at the state or federal level."}
        },
        {
            "competencyText": {"en-us": "Evaluate the origins and roles of political parties, interest groups, media, and individuals in determining and shaping public policy."}
        },
        {
            "competencyText": {"en-us": "Analyze trends in voter turnout."}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the principles, functions, and organization of government."}
        },
        {
            "competencyText": {"en-us": "Examine the constitutional principles of representative government, limited government, consent of the governed, rule of law, and individual rights."}
        },
        {
            "competencyText": {"en-us": "Define federalism, and identify examples of the powers granted and denied to states and the national government in the American federal system of government.\r\n"}
        },
        {
            "competencyText": {"en-us": "Analyze the structures, functions, and processes of the legislative branch as described in Article I of the Constitution."}
        },
        {
            "competencyText": {"en-us": "Analyze the structures, functions, and processes of the executive branch as described in Article II of the Constitution."}
        },
        {
            "competencyText": {"en-us": "Identify the impact of independent regulatory agencies in the federal bureaucracy."}
        },
        {
            "competencyText": {"en-us": "Analyze the structures, functions, and processes of the judicial branch as described in Article III of the Constitution."}
        },
        {
            "competencyText": {"en-us": "Describe the role of judicial review in American constitutional government."}
        },
        {
            "competencyText": {"en-us": "Compare the role of judges on the state and federal level with other elected officials."}
        },
        {
            "competencyText": {"en-us": "Analyze the various levels and responsibilities of courts in the federal and state judicial system and the relationships among them."}
        },
        {
            "competencyText": {"en-us": "Evaluate the significance and outcomes of landmark Supreme Court cases."}
        },
        {
            "competencyText": {"en-us": "Contrast how the Constitution safeguards and limits individual rights."}
        },
        {
            "competencyText": {"en-us": "Simulate the judicial decision-making process in interpreting law at the state and federal level."}
        },
        {
            "competencyText": {"en-us": "Illustrate examples of how government affects the daily lives of citizens at the local, state, and national levels."}
        },
        {
            "competencyText": {"en-us": "Examine constitutional powers (expressed, implied, concurrent, reserved).\r\n"}
        },
        {
            "competencyText": {"en-us": "Examine how power and responsibility are distributed, shared, and limited by the Constitution."}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of contemporary issues in world affairs, and evaluate the role and impact of United States foreign policy."}
        },
        {
            "competencyText": {"en-us": "Explain how the world's nations are governed differently."}
        },
        {
            "competencyText": {"en-us": "Evaluate the influence of American foreign policy on other nations and the influences of other nations on American policies and society.\r\n"}
        },
        {
            "competencyText": {"en-us": "Assess human rights policies of the United States and other countries."}
        },
        {
            "competencyText": {"en-us": "Compare indicators of democratization in multiple countries."}
        },
        {
            "competencyText": {"en-us": "Psychology"}
        },
        {
            "competencyText": {"en-us": "Scientific Inquiry Domain/Perspectives in Psychological Science"}
        },
        {
            "competencyText": {"en-us": "Define psychology as a discipline and identify its goals as a science."}
        },
        {
            "competencyText": {"en-us": "Describe the emergence of psychology as a scientific discipline."}
        },
        {
            "competencyText": {"en-us": "Describe perspectives employed to understand behavior and mental processes."}
        },
        {
            "competencyText": {"en-us": "Discuss the value of both basic and applied psychological research with human and non-human animals."}
        },
        {
            "competencyText": {"en-us": "Describe the major subfields of psychology."}
        },
        {
            "competencyText": {"en-us": "Identify the important role psychology plays in benefiting society and improving people&rsquo;s lives."}
        },
        {
            "competencyText": {"en-us": "Scientific Inquiry Domain/Research Methods, Measurement, and Statistics"}
        },
        {
            "competencyText": {"en-us": "Describe the scientific method and its role in psychology."}
        },
        {
            "competencyText": {"en-us": "Describe and compare a variety of quantitative (e.g., surveys, correlations, experiments) and qualitative (e.g., interviews, narratives, focus groups) research methods."}
        },
        {
            "competencyText": {"en-us": "Define systematic procedures used to improve the validity of research findings, such as external validity."}
        },
        {
            "competencyText": {"en-us": "Discuss how and why psychologists use non-human animals in research."}
        },
        {
            "competencyText": {"en-us": "Identify ethical standards psychologists must address regarding research with human participants."}
        },
        {
            "competencyText": {"en-us": "Identify ethical guidelines psychologists must address regarding research with non-human animals."}
        },
        {
            "competencyText": {"en-us": "Define descriptive statistics and explain how they are used by psychological scientists."}
        },
        {
            "competencyText": {"en-us": "Define forms of qualitative data and explain how they are used by psychological scientists."}
        },
        {
            "competencyText": {"en-us": "Define correlation coefficients and explain their appropriate interpretation."}
        },
        {
            "competencyText": {"en-us": "Interpret graphical representations of data as used in both quantitative and qualitative methods."}
        },
        {
            "competencyText": {"en-us": "Explain other statistical concepts, such as statistical significance and effect size."}
        },
        {
            "competencyText": {"en-us": "Explain how validity and reliability of observations and measurements relate to data analysis."}
        },
        {
            "competencyText": {"en-us": "Biopsychology Domain/Biological Bases of Behavior"}
        },
        {
            "competencyText": {"en-us": "Identify the major divisions and subdivisions of the human nervous system."}
        },
        {
            "competencyText": {"en-us": "Identify the parts of the neuron and describe the basic process of neural transmission."}
        },
        {
            "competencyText": {"en-us": "Differentiate between the structures and functions of the various parts of the central nervous system."}
        },
        {
            "competencyText": {"en-us": "Describe lateralization of brain functions."}
        },
        {
            "competencyText": {"en-us": "Discuss the mechanisms and the importance of plasticity of the nervous system."}
        },
        {
            "competencyText": {"en-us": "Describe how the endocrine glands are linked to the nervous system."}
        },
        {
            "competencyText": {"en-us": "Describe the effects of hormones on behavior and mental processes."}
        },
        {
            "competencyText": {"en-us": "Describe hormone effects on the immune system."}
        },
        {
            "competencyText": {"en-us": "Describe concepts in genetic transmission."}
        },
        {
            "competencyText": {"en-us": "Describe the interactive effects of heredity and environment."}
        },
        {
            "competencyText": {"en-us": "Explain how evolved tendencies influence behavior."}
        },
        {
            "competencyText": {"en-us": "Identify tools used to study the nervous system."}
        },
        {
            "competencyText": {"en-us": "Describe advances made in neuroscience."}
        },
        {
            "competencyText": {"en-us": "Discuss issues related to scientific advances in neuroscience and genetics."}
        },
        {
            "competencyText": {"en-us": "Biopsychology Domain/Sensation and Perception"}
        },
        {
            "competencyText": {"en-us": "Discuss processes of sensation and perception and how they interact"}
        },
        {
            "competencyText": {"en-us": "Explain the concepts of threshold and adaptation."}
        },
        {
            "competencyText": {"en-us": "List forms of physical energy for which humans and non-human animals do and do not have sensory receptors."}
        },
        {
            "competencyText": {"en-us": "Describe the visual sensory system."}
        },
        {
            "competencyText": {"en-us": "Describe the auditory sensory system."}
        },
        {
            "competencyText": {"en-us": "Describe other sensory systems, such as olfaction, gestation, and somesthesis (e.g., skin senses, kinesthesis, and vestibular sense)."}
        },
        {
            "competencyText": {"en-us": "Explain Gestalt principles of perception."}
        },
        {
            "competencyText": {"en-us": "Describe binocular and monocular depth cues."}
        },
        {
            "competencyText": {"en-us": "Describe the importance of perceptual constancies."}
        },
        {
            "competencyText": {"en-us": "Describe perceptual illusions."}
        },
        {
            "competencyText": {"en-us": "Describe the nature of attention."}
        },
        {
            "competencyText": {"en-us": "Explain how experiences and expectations influence perception."}
        },
        {
            "competencyText": {"en-us": "Biopsychology Domain/Consciousness"}
        },
        {
            "competencyText": {"en-us": "Identify states of consciousness."}
        },
        {
            "competencyText": {"en-us": "Distinguish between processing that is conscious (i.e., explicit) and other processing that happens without conscious awareness (i.e., implicit)."}
        },
        {
            "competencyText": {"en-us": "Describe the circadian rhythm and its relation to sleep."}
        },
        {
            "competencyText": {"en-us": "Describe the sleep cycle."}
        },
        {
            "competencyText": {"en-us": "Compare theories about the functions of sleep."}
        },
        {
            "competencyText": {"en-us": "Describe types of sleep disorders."}
        },
        {
            "competencyText": {"en-us": "Compare theories about the functions of dreams."}
        },
        {
            "competencyText": {"en-us": "Characterize the major categories of psychoactive drugs and their effects."}
        },
        {
            "competencyText": {"en-us": "Describe how psychoactive drugs act at the synaptic level."}
        },
        {
            "competencyText": {"en-us": "Evaluate the biological and psychological effects of psychoactive drugs."}
        },
        {
            "competencyText": {"en-us": "Explain how culture and expectations influence the use and experience of drugs."}
        },
        {
            "competencyText": {"en-us": "Describe meditation and relaxation and their effects."}
        },
        {
            "competencyText": {"en-us": "Describe hypnosis and controversies surrounding its nature and use."}
        },
        {
            "competencyText": {"en-us": "Describe flow states."}
        },
        {
            "competencyText": {"en-us": "Development and Learning Domain/Life Span Development"}
        },
        {
            "competencyText": {"en-us": "Explain the interaction of environmental and biological factors in development, including the role of the brain in all aspects of development."}
        },
        {
            "competencyText": {"en-us": "Explain issues of continuity/discontinuity and stability/change."}
        },
        {
            "competencyText": {"en-us": "Distinguish methods used to study development."}
        },
        {
            "competencyText": {"en-us": "Describe the role of sensitive and critical periods in development."}
        },
        {
            "competencyText": {"en-us": "Discuss issues related to the end of life."}
        },
        {
            "competencyText": {"en-us": "Discuss theories of cognitive development."}
        },
        {
            "competencyText": {"en-us": "Discuss theories of moral development."}
        },
        {
            "competencyText": {"en-us": "Discuss theories of social development."}
        },
        {
            "competencyText": {"en-us": "Describe physical development from conception through birth and identify influences on prenatal development."}
        },
        {
            "competencyText": {"en-us": "Describe newborns&rsquo; reflexes, temperament, and abilities."}
        },
        {
            "competencyText": {"en-us": "Describe physical and motor development in infancy."}
        },
        {
            "competencyText": {"en-us": "Describe how infant perceptual abilities and intelligence develop."}
        },
        {
            "competencyText": {"en-us": "Describe the development of attachment and the role of the caregiver."}
        },
        {
            "competencyText": {"en-us": "Describe the development of communication and language in infancy."}
        },
        {
            "competencyText": {"en-us": "Describe physical and motor development in childhood."}
        },
        {
            "competencyText": {"en-us": "Describe how memory and thinking ability develops in childhood."}
        },
        {
            "competencyText": {"en-us": "Describe social, cultural, and emotional development through childhood."}
        },
        {
            "competencyText": {"en-us": "Identify major physical changes in adolescence."}
        },
        {
            "competencyText": {"en-us": "Describe the development of reasoning and morality in adolescence."}
        },
        {
            "competencyText": {"en-us": "Describe identity formation in adolescence."}
        },
        {
            "competencyText": {"en-us": "Discuss the role of family and peers in adolescent development."}
        },
        {
            "competencyText": {"en-us": "Identify major physical changes associated with adulthood and aging."}
        },
        {
            "competencyText": {"en-us": "Describe cognitive changes in adulthood and aging."}
        },
        {
            "competencyText": {"en-us": "Discuss social, cultural, and emotional issues in aging."}
        },
        {
            "competencyText": {"en-us": "Development and Learning Domain/Learning"}
        },
        {
            "competencyText": {"en-us": "Describe the principles of classical conditioning."}
        },
        {
            "competencyText": {"en-us": "Describe clinical and experimental examples of classical conditioning."}
        },
        {
            "competencyText": {"en-us": "Apply classical conditioning to everyday life."}
        },
        {
            "competencyText": {"en-us": "Describe the Law of Effect."}
        },
        {
            "competencyText": {"en-us": "Describe the principles of operant conditioning."}
        },
        {
            "competencyText": {"en-us": "Describe clinical and experimental examples of operant conditioning."}
        },
        {
            "competencyText": {"en-us": "Apply operant conditioning to everyday life."}
        },
        {
            "competencyText": {"en-us": "Describe the principles of observational and cognitive learning."}
        },
        {
            "competencyText": {"en-us": "Apply observational and cognitive learning to everyday life."}
        },
        {
            "competencyText": {"en-us": "Development and Learning Domain/Language Development"}
        },
        {
            "competencyText": {"en-us": "Describe the structure and function of language."}
        },
        {
            "competencyText": {"en-us": "Discuss the relationship between language and thought."}
        },
        {
            "competencyText": {"en-us": "Explain the process of language acquisition."}
        },
        {
            "competencyText": {"en-us": "Discuss how acquisition of a second language can affect language development and possibly other cognitive processes."}
        },
        {
            "competencyText": {"en-us": "Evaluate the theories of language acquisition."}
        },
        {
            "competencyText": {"en-us": "Identify the brain structures associated with language."}
        },
        {
            "competencyText": {"en-us": "Discuss how damage to the brain may affect language."}
        },
        {
            "competencyText": {"en-us": "Sociocultural Context Domain/Social Interactions"}
        },
        {
            "competencyText": {"en-us": "Describe attributional explanations of behavior."}
        },
        {
            "competencyText": {"en-us": "Describe the relationship between attitudes (implicit and explicit) and behavior."}
        },
        {
            "competencyText": {"en-us": "Identify persuasive methods used to change attitudes."}
        },
        {
            "competencyText": {"en-us": "Describe the power of the situation."}
        },
        {
            "competencyText": {"en-us": "Describe effects of others&rsquo; presence on individuals&rsquo; behavior."}
        },
        {
            "competencyText": {"en-us": "Describe how group dynamics influence behavior."}
        },
        {
            "competencyText": {"en-us": "Discuss how an individual influences group behavior."}
        },
        {
            "competencyText": {"en-us": "Discuss the nature and effects of stereotyping, prejudice, and discrimination."}
        },
        {
            "competencyText": {"en-us": "Describe determinants of prosocial behavior."}
        },
        {
            "competencyText": {"en-us": "Discuss influences upon aggression and conflict."}
        },
        {
            "competencyText": {"en-us": "Discuss factors influencing attraction and relationships."}
        },
        {
            "competencyText": {"en-us": "Sociocultural Context Domain/Sociocultural Diversity"}
        },
        {
            "competencyText": {"en-us": "Define culture and diversity."}
        },
        {
            "competencyText": {"en-us": "Identify how cultures change over time and vary within nations and internationally."}
        },
        {
            "competencyText": {"en-us": "Discuss the relationship between culture and conceptions of self and identity."}
        },
        {
            "competencyText": {"en-us": "Discuss psychological research examining race and ethnicity."}
        },
        {
            "competencyText": {"en-us": "Discuss psychological research examining socioeconomic status."}
        },
        {
            "competencyText": {"en-us": "Discuss how privilege and social power structures relate to stereotypes, prejudice, and discrimination."}
        },
        {
            "competencyText": {"en-us": "Discuss psychological research examining gender identity."}
        },
        {
            "competencyText": {"en-us": "Discuss psychological research examining diversity in sexual orientation."}
        },
        {
            "competencyText": {"en-us": "Compare and contrast gender identity and sexual orientation."}
        },
        {
            "competencyText": {"en-us": "Discuss psychological research examining gender similarities and differences and the impact of gender discrimination."}
        },
        {
            "competencyText": {"en-us": "Discuss the psychological research on gender and how the roles of women and men in societies are perceived."}
        },
        {
            "competencyText": {"en-us": "Examine how perspectives affect stereotypes and treatment of minority and majority groups in society."}
        },
        {
            "competencyText": {"en-us": "Discuss psychological research examining differences in individual cognitive and physical abilities."}
        },
        {
            "competencyText": {"en-us": "Examine societal treatment of people with disabilities and the effect of treatment by others on individual identity/status."}
        },
        {
            "competencyText": {"en-us": "Cognition Domain/Memory"}
        },
        {
            "competencyText": {"en-us": "Identify factors that influence encoding."}
        },
        {
            "competencyText": {"en-us": "Characterize the difference between shallow (surface) and deep (elaborate) processing."}
        },
        {
            "competencyText": {"en-us": "Discuss strategies for improving the encoding of memory."}
        },
        {
            "competencyText": {"en-us": "Describe the differences between working memory and long-term memory."}
        },
        {
            "competencyText": {"en-us": "Identify and explain biological processes related to how memory is stored."}
        },
        {
            "competencyText": {"en-us": "Discuss types of memory and memory disorders (e.g., amnesias, dementias)."}
        },
        {
            "competencyText": {"en-us": "Discuss strategies for improving the storage of memories."}
        },
        {
            "competencyText": {"en-us": "Analyze the importance of retrieval cues in memory."}
        },
        {
            "competencyText": {"en-us": "Explain the role that interference plays in retrieval."}
        },
        {
            "competencyText": {"en-us": "Discuss the factors influencing how memories are retrieved."}
        },
        {
            "competencyText": {"en-us": "Explain how memories can be malleable."}
        },
        {
            "competencyText": {"en-us": "Discuss strategies for improving the retrieval of memories."}
        },
        {
            "competencyText": {"en-us": "Cognition Domain/Thinking"}
        },
        {
            "competencyText": {"en-us": "Define cognitive processes involved in understanding information."}
        },
        {
            "competencyText": {"en-us": "Define processes involved in problem solving and decision making."}
        },
        {
            "competencyText": {"en-us": "Discuss non-human problem-solving abilities."}
        },
        {
            "competencyText": {"en-us": "Describe obstacles to problem solving."}
        },
        {
            "competencyText": {"en-us": "Describe obstacles to decision making."}
        },
        {
            "competencyText": {"en-us": "Describe obstacles to making good judgments."}
        },
        {
            "competencyText": {"en-us": "Cognition Domain/Intelligence"}
        },
        {
            "competencyText": {"en-us": "Discuss intelligence as a general factor."}
        },
        {
            "competencyText": {"en-us": "Discuss alternative conceptualizations of intelligence."}
        },
        {
            "competencyText": {"en-us": "Describe the extremes of intelligence."}
        },
        {
            "competencyText": {"en-us": "Discuss the history of intelligence testing, including historical use and misuse in the context of fairness."}
        },
        {
            "competencyText": {"en-us": "Identify current methods of assessing human abilities."}
        },
        {
            "competencyText": {"en-us": "Identify measures of and data on reliability and validity for intelligence test scores."}
        },
        {
            "competencyText": {"en-us": "Discuss issues related to the consequences of intelligence testing."}
        },
        {
            "competencyText": {"en-us": "Discuss the influences of biological, cultural, and environmental factors on intelligence."}
        },
        {
            "competencyText": {"en-us": "Individual Variations Domain/Motivation"}
        },
        {
            "competencyText": {"en-us": "Explain biologically based theories of motivation."}
        },
        {
            "competencyText": {"en-us": "Explain cognitively based theories of motivation."}
        },
        {
            "competencyText": {"en-us": "Explain humanistic theories of motivation."}
        },
        {
            "competencyText": {"en-us": "Explain the role of culture in human motivation."}
        },
        {
            "competencyText": {"en-us": "Discuss eating behavior."}
        },
        {
            "competencyText": {"en-us": "Discuss sexual behavior and orientation."}
        },
        {
            "competencyText": {"en-us": "Discuss achievement motivation."}
        },
        {
            "competencyText": {"en-us": "Discuss other ways in which humans and non-human animals are motivated."}
        },
        {
            "competencyText": {"en-us": "Individual Variations Domain/Emotion"}
        },
        {
            "competencyText": {"en-us": "Explain the biological and cognitive components of emotion."}
        },
        {
            "competencyText": {"en-us": "Discuss psychological research on basic human emotions."}
        },
        {
            "competencyText": {"en-us": "Differentiate among theories of emotional experience."}
        },
        {
            "competencyText": {"en-us": "Explain how biological factors influence emotional interpretation and expression."}
        },
        {
            "competencyText": {"en-us": "Explain how culture and gender influence emotional interpretation and expression."}
        },
        {
            "competencyText": {"en-us": "Explain how other environmental factors influence emotional interpretation and expression."}
        },
        {
            "competencyText": {"en-us": "Identify biological and environmental influences on the expression experience of negative emotions, such as fear."}
        },
        {
            "competencyText": {"en-us": "Identify biological and environmental influences on the expression and experience of positive emotions, such as happiness."}
        },
        {
            "competencyText": {"en-us": "Individual Variations Domain/Personality"}
        },
        {
            "competencyText": {"en-us": "Evaluate psychodynamic theories."}
        },
        {
            "competencyText": {"en-us": "Evaluate trait theories."}
        },
        {
            "competencyText": {"en-us": "Evaluate humanistic theories."}
        },
        {
            "competencyText": {"en-us": "Evaluate social-cognitive theories."}
        },
        {
            "competencyText": {"en-us": "Differentiate personality assessment techniques."}
        },
        {
            "competencyText": {"en-us": "Discuss the reliability and validity of personality assessment techniques."}
        },
        {
            "competencyText": {"en-us": "Discuss biological and situational influences."}
        },
        {
            "competencyText": {"en-us": "Discuss stability and change."}
        },
        {
            "competencyText": {"en-us": "Discuss connection to health and work on personality."}
        },
        {
            "competencyText": {"en-us": "Discuss self-concept."}
        },
        {
            "competencyText": {"en-us": "Analyze how individualistic and collectivistic cultural perspectives relate to personality."}
        },
        {
            "competencyText": {"en-us": "Individual Variations Domain/Psychological Disorders"}
        },
        {
            "competencyText": {"en-us": "Define psychologically abnormal behavior."}
        },
        {
            "competencyText": {"en-us": "Describe historical and cross-cultural views of abnormality."}
        },
        {
            "competencyText": {"en-us": "Describe major models of abnormality."}
        },
        {
            "competencyText": {"en-us": "Discuss how stigma relates to abnormal behavior."}
        },
        {
            "competencyText": {"en-us": "Discuss the impact of psychological disorders on the individual, family, and society."}
        },
        {
            "competencyText": {"en-us": "Describe the classification of psychological disorders."}
        },
        {
            "competencyText": {"en-us": "Discuss the challenges associated with diagnosis."}
        },
        {
            "competencyText": {"en-us": "Describe symptoms and causes of major categories of psychological disorders (including schizophrenic, mood, anxiety, and personality disorders)."}
        },
        {
            "competencyText": {"en-us": "Evaluate how different factors influence an individual&rsquo;s experience of psychological disorders."}
        },
        {
            "competencyText": {"en-us": "Applications of Psychological Science Domain/Treatment of Psychological Disorders"}
        },
        {
            "competencyText": {"en-us": "Explain how psychological treatments have changed over time and among cultures."}
        },
        {
            "competencyText": {"en-us": "Match methods of treatment to psychological perspectives."}
        },
        {
            "competencyText": {"en-us": "Explain why psychologists use a variety of treatment options."}
        },
        {
            "competencyText": {"en-us": "Identify biomedical treatments."}
        },
        {
            "competencyText": {"en-us": "Identify psychological treatments."}
        },
        {
            "competencyText": {"en-us": "Describe appropriate treatments for different age groups."}
        },
        {
            "competencyText": {"en-us": "Evaluate the efficacy of treatments for particular disorders."}
        },
        {
            "competencyText": {"en-us": "Identify other factors that improve the efficacy of treatment."}
        },
        {
            "competencyText": {"en-us": "Identify treatment providers for psychological disorders and the training required for each."}
        },
        {
            "competencyText": {"en-us": "Identify ethical challenges involved in delivery of treatment."}
        },
        {
            "competencyText": {"en-us": "Identify national and local resources available to support individuals with psychological disorders and their families (e.g., NAMI and support groups)."}
        },
        {
            "competencyText": {"en-us": "Applications of Psychological Science Domain/ Health"}
        },
        {
            "competencyText": {"en-us": "Define stress as a psychophysiological reaction."}
        },
        {
            "competencyText": {"en-us": "Identify and explain potential sources of stress."}
        },
        {
            "competencyText": {"en-us": "Explain physiological and psychological consequences of stress for health."}
        },
        {
            "competencyText": {"en-us": "Identify and explain physiological, cognitive, and behavioral strategies to deal with stress."}
        },
        {
            "competencyText": {"en-us": "Identify ways to promote mental health and physical fitness."}
        },
        {
            "competencyText": {"en-us": "Describe the characteristics of and factors that promote resilience and optimism."}
        },
        {
            "competencyText": {"en-us": "Distinguish between effective and ineffective means of dealing with stressors and other health issues."}
        },
        {
            "competencyText": {"en-us": "Applications of Psychological Science Domain/Vocational Applications"}
        },
        {
            "competencyText": {"en-us": "Identify careers in psychological science and practice."}
        },
        {
            "competencyText": {"en-us": "Identify resources to help select psychology programs for further study."}
        },
        {
            "competencyText": {"en-us": "Identify degree requirements for psychologists and psychology-related careers."}
        },
        {
            "competencyText": {"en-us": "Identify careers related to psychology."}
        },
        {
            "competencyText": {"en-us": "Discuss ways in which psychological science addresses domestic and global issues."}
        },
        {
            "competencyText": {"en-us": "Identify careers in psychological science that have evolved as a result of domestic and global issues."}
        },
        {
            "competencyText": {"en-us": "Sociology"}
        },
        {
            "competencyText": {"en-us": "Foundations of Sociology as a Social Science/Identify methods and strategies of research and examine the contributions of sociology to the understanding of social issues."}
        },
        {
            "competencyText": {"en-us": "Discuss the development of the field of sociology as a social science."}
        },
        {
            "competencyText": {"en-us": "Identify early leading theorists within social science."}
        },
        {
            "competencyText": {"en-us": "Compare sociology with other social science disciplines."}
        },
        {
            "competencyText": {"en-us": "Examine changing points of view of social issues, such as poverty, crime and discrimination."}
        },
        {
            "competencyText": {"en-us": "Evaluate various types of sociologic research methods."}
        },
        {
            "competencyText": {"en-us": "Distinguish fact from opinion in data sources to analyze various points of view about a social issue."}
        },
        {
            "competencyText": {"en-us": "Determine cause-and-effect relationship issues among events as they relate to sociology."}
        },
        {
            "competencyText": {"en-us": "Identify, evaluate and use appropriate reference materials and technology to interpret information about cultural life in the United States and other world cultures, both in the past and today."}
        },
        {
            "competencyText": {"en-us": "Develop a working definition of sociology that has personal application."}
        },
        {
            "competencyText": {"en-us": "Culture/Examine the influence on the individual and the way cultural transmission is accomplished."}
        },
        {
            "competencyText": {"en-us": "Define the key components of a culture, such as knowledge, language and communication, customs, values, norms, and physical objects."}
        },
        {
            "competencyText": {"en-us": "Explain the differences between a culture and a society."}
        },
        {
            "competencyText": {"en-us": "Recognize the influences of genetic inheritance and culture on human behavior."}
        },
        {
            "competencyText": {"en-us": "Give examples of subcultures and describe what makes them unique."}
        },
        {
            "competencyText": {"en-us": "Compare social norms among various subcultures."}
        },
        {
            "competencyText": {"en-us": "Identify the factors that promote cultural diversity within the United States."}
        },
        {
            "competencyText": {"en-us": "Explain how various practices of the culture create differences within group behavior."}
        },
        {
            "competencyText": {"en-us": "Compare and contrast different types of societies, such as hunting and gathering, agrarian, industrial, and post-industrial."}
        },
        {
            "competencyText": {"en-us": "Prepare original written and oral reports and presentations on specific events, people or historical eras."}
        },
        {
            "competencyText": {"en-us": "Identify both rights and responsibilities the individual has to the group."}
        },
        {
            "competencyText": {"en-us": "Demonstrate democratic approaches to managing disagreements and resolving conflicts within a culture."}
        },
        {
            "competencyText": {"en-us": "Compare and contrast ideas about citizenship and cultural participation from the past with those of the present community."}
        },
        {
            "competencyText": {"en-us": "Social Status/Identify how social status influences individual and group behaviors and how that status relates to the position a person occupies within a social group."}
        },
        {
            "competencyText": {"en-us": "Describe how social status affects social order."}
        },
        {
            "competencyText": {"en-us": "Explain how roles and role expectations can lead to role conflict."}
        },
        {
            "competencyText": {"en-us": "Examine and analyze various points of view relating to historical and current events."}
        },
        {
            "competencyText": {"en-us": "Social Groups/Explore the impacts of social groups on individual and group behavior."}
        },
        {
            "competencyText": {"en-us": "Describe how individuals are affected by the different social groups to which they belong."}
        },
        {
            "competencyText": {"en-us": "Identify major characteristics of social groups familiar to the students."}
        },
        {
            "competencyText": {"en-us": "Examine the ways that groups function, such as roles, interactions and leadership."}
        },
        {
            "competencyText": {"en-us": "Discuss the social norms of at least two groups to which the student belongs."}
        },
        {
            "competencyText": {"en-us": "Analyze what can occur when the rules of behavior are broken and analyze the possible consequences for unacceptable behavior."}
        },
        {
            "competencyText": {"en-us": "Identify the various types of norms (folkways, mores, laws, and taboos) and explain why these rules of behavior are considered important to society."}
        },
        {
            "competencyText": {"en-us": "Discuss the concept of deviance and how society discourages deviant behavior using social control."}
        },
        {
            "competencyText": {"en-us": "Explain how students are members of primary and secondary groups and how those group memberships influence students&rsquo; behavior."}
        },
        {
            "competencyText": {"en-us": "Discuss how formal organizations influence behavior of their members."}
        },
        {
            "competencyText": {"en-us": "Distinguish the degree of assimilation that ethnic, cultural, and social groups achieve with the United States culture."}
        },
        {
            "competencyText": {"en-us": "Discuss how humans interact in a variety of social settings."}
        },
        {
            "competencyText": {"en-us": "Determine the cultural patterns of behavior within such social groups as rural/urban or rich/poor."}
        },
        {
            "competencyText": {"en-us": "Investigate and compare the ideas about citizenship and cultural participation of social groups from the past with those of the present community."}
        },
        {
            "competencyText": {"en-us": "Social Institutions/Identify the effects of social institutions on individual and group behavior."}
        },
        {
            "competencyText": {"en-us": "Identify basic social institutions and explain their impact on individuals, groups and organizations within society and how they transmit the values of society."}
        },
        {
            "competencyText": {"en-us": "Discuss the concept of political power and factors that influence political power."}
        },
        {
            "competencyText": {"en-us": "Discuss how societies recognize rites of passage."}
        },
        {
            "competencyText": {"en-us": "Investigate stereotypes of the various United States subcultures, such as &ldquo;American Indian,&rdquo; &ldquo;American cowboys,&rdquo; teenagers,&rdquo; &ldquo;Americans,&rdquo; &ldquo;gangs,&rdquo; and &ldquo;hippies,&rdquo; from a world perspective."}
        },
        {
            "competencyText": {"en-us": "Define ethnocentrism and explain how it can be beneficial or destructive to a culture."}
        },
        {
            "competencyText": {"en-us": "Identify the factors that influence change in social norms over time."}
        },
        {
            "competencyText": {"en-us": "Use various resources to interpret information about cultural life in the United States and other world cultures, both in the past and today."}
        },
        {
            "competencyText": {"en-us": "Analyze the primary and secondary groups common to different age groups in society."}
        },
        {
            "competencyText": {"en-us": "Conduct research and analysis on an issue associated with social structure or social institutions."}
        },
        {
            "competencyText": {"en-us": "Identify both rights and responsibilities the individual has to primary and secondary groups."}
        },
        {
            "competencyText": {"en-us": "Demonstrate democratic approaches to managing disagreements and solving conflicts within a social institution."}
        },
        {
            "competencyText": {"en-us": "Explain how roles and role expectations can lead to role conflict."}
        },
        {
            "competencyText": {"en-us": "Social Change/Examine the changing nature of society."}
        },
        {
            "competencyText": {"en-us": "Describe how and why societies change over time."}
        },
        {
            "competencyText": {"en-us": "Examine various social influences that can lead to immediate and long-term changes."}
        },
        {
            "competencyText": {"en-us": "Describe how collective behavior can influence and change society."}
        },
        {
            "competencyText": {"en-us": "Examine how technological innovations and scientific discoveries have influenced major social institutions."}
        },
        {
            "competencyText": {"en-us": "Discuss how social interactions and culture could be affected in the future due to innovations in science and technological change."}
        },
        {
            "competencyText": {"en-us": "Describe how the role of the mass media has changed over time and project what changes might occur in the future."}
        },
        {
            "competencyText": {"en-us": "Distinguish major differences between social movements and collective behavior with examples from history and the contemporary world."}
        },
        {
            "competencyText": {"en-us": "Investigate the consequences in society as result of changes."}
        },
        {
            "competencyText": {"en-us": "Trace the development of the use of a specific type of technology in the community."}
        },
        {
            "competencyText": {"en-us": "Propose a plan to improve a social structure, and design the means needed to implement the change."}
        },
        {
            "competencyText": {"en-us": "Cite examples of the use of technology in social research."}
        },
        {
            "competencyText": {"en-us": "Evaluate a current issue that has resulted from scientific discoveries and/or technological innovations."}
        },
        {
            "competencyText": {"en-us": "Social Problems/Analyze a range of social problems in today’s world."}
        },
        {
            "competencyText": {"en-us": "Identify characteristics of a &ldquo;social&rdquo; problem, as opposed to an &ldquo;individual&rdquo; problem."}
        },
        {
            "competencyText": {"en-us": "Describe how social problems have changed over time."}
        },
        {
            "competencyText": {"en-us": "Explain how patterns of behavior are found with certain social problems."}
        },
        {
            "competencyText": {"en-us": "Discuss the implications of social problems for society."}
        },
        {
            "competencyText": {"en-us": "Examine how individual and group responses are often associated with social problems."}
        },
        {
            "competencyText": {"en-us": "Evaluate possible solutions to resolving social problems and the consequences that might result from those solutions."}
        },
        {
            "competencyText": {"en-us": "Survey local agencies involved in addressing social problems to determine the extent of the problems in the local community."}
        },
        {
            "competencyText": {"en-us": "Design and carry out school- and community-based projects to address a local aspect of a social problem."}
        },
        {
            "competencyText": {"en-us": "Individual and Community/Examine the role of the individual as a member of the community; explore both individual and collective behavior."}
        },
        {
            "competencyText": {"en-us": "Describe traditions, roles, and expectations necessary for a community to continue."}
        },
        {
            "competencyText": {"en-us": "Describe how collective behavior (working in groups) can influence and change society.  Use historical and contemporary examples to define collective behavior."}
        },
        {
            "competencyText": {"en-us": "Discuss theories that attempt to explain collective behavior."}
        },
        {
            "competencyText": {"en-us": "Define a social issue to be analyzed."}
        },
        {
            "competencyText": {"en-us": "Examine factors that could lead to the breakdown and disruption of an existing community."}
        },
        {
            "competencyText": {"en-us": "Discuss the impact of leaders of different social movements."}
        },
        {
            "competencyText": {"en-us": "Define propaganda and discuss the methods of propaganda and discuss the methods of propaganda used to influence social behavior."}
        },
        {
            "competencyText": {"en-us": "Discuss both the benefits and social costs of collective behavior in society."}
        },
        {
            "competencyText": {"en-us": "Identify a community social problem and discuss appropriate actions to address the problem."}
        },
        {
            "competencyText": {"en-us": "Investigate how incorrect communications, such as rumors or gossip, can influence group behavior."}
        },
        {
            "competencyText": {"en-us": "Financial Literacy"}
        },
        {
            "competencyText": {"en-us": "Earning Income"}
        },
        {
            "competencyText": {"en-us": "Discuss that people choose jobs or careers for which they are qualified based on non-income factors, such as job satisfaction, independence, risk, family, or location."}
        },
        {
            "competencyText": {"en-us": "Explain that people vary in their willingness to obtain more education or training because these decisions involve incurring immediate costs to obtain possible future benefits. Describe how discounting the future benefits of education and training may lead some people to pass up potentially high rates of return that more education and training may offer."}
        },
        {
            "competencyText": {"en-us": "Evaluate ways people can make more informed education, job, or career decisions by evaluating the benefits and costs of different choices."}
        },
        {
            "competencyText": {"en-us": "Analyze the reasons why the wage or salary paid to workers in jobs is usually determined by the labor market and that businesses are generally willing to pay more productive workers higher wages or salaries than less productive workers."}
        },
        {
            "competencyText": {"en-us": "Discuss reasons why changes in economic conditions or the labor market can cause changes in a worker&rsquo;s income or may cause unemployment."}
        },
        {
            "competencyText": {"en-us": "Explain that taxes are paid to federal, state, and local governments to fund government goods and services and transfer payments from government to individuals and that the major types of taxes are income taxes, payroll (Social Security) taxes, property taxes, and sales taxes."}
        },
        {
            "competencyText": {"en-us": "Discuss how people&rsquo;s sources of income, amount of income, as well as the amount and type of spending affect the types and amounts of taxes paid."}
        },
        {
            "competencyText": {"en-us": "Buying Goods and Services"}
        },
        {
            "competencyText": {"en-us": "Compare consumer decisions as they are influenced by the price of a good or service, the price of alternatives, and the consumer&rsquo;s income as well as his or her preferences."}
        },
        {
            "competencyText": {"en-us": "Analyze situations in which when people consume goods and services, their consumption can have positive and negative effects on others."}
        },
        {
            "competencyText": {"en-us": "Discuss that when buying a good, consumers may consider various aspects of the product including the product&rsquo;s features. Explain why for goods that last for a longer period of time, the consumer should consider the product&rsquo;s durability and maintenance costs."}
        },
        {
            "competencyText": {"en-us": "Describe ways that consumers may be influenced by how the price of a good is expressed."}
        },
        {
            "competencyText": {"en-us": "Discuss ways people incur costs and realize benefits when searching for information related to their purchases of goods and services and describe how the amount of information people should gather depends on the benefits and costs of the information."}
        },
        {
            "competencyText": {"en-us": "Explain that people may choose to donate money to charitable organizations and other not-for-profits because they gain satisfaction from donating."}
        },
        {
            "competencyText": {"en-us": "Examine governments establishing laws and institutions to provide consumers with information about goods or services being purchased and to protect consumers from fraud."}
        },
        {
            "competencyText": {"en-us": "Saving"}
        },
        {
            "competencyText": {"en-us": "Discuss the reasons why some people have a tendency to be impatient and choose immediate spending over saving for the future."}
        },
        {
            "competencyText": {"en-us": "Examine the ideas that inflation reduces the value of money, including savings, that the real interest rate expresses the rate of return on savings, taking into account the effect of inflation and that the real interest rate is calculated as the nominal interest rate minus the rate of inflation."}
        },
        {
            "competencyText": {"en-us": "Compare the difference between the nominal interest rate which tells savers how the dollar value of their savings or investments will grow, and the real interest rate which tells savers how the purchasing power of their savings or investments will grow."}
        },
        {
            "competencyText": {"en-us": "Describe ways that money received (or paid) in the future can be compared to money held today by discounting the future value based on the rate of interest."}
        },
        {
            "competencyText": {"en-us": "Explain ways that government agencies supervise and regulate financial institutions to help protect the safety, soundness, and legal compliance of the nation&rsquo;s banking and financial system."}
        },
        {
            "competencyText": {"en-us": "Describe government policies that create incentives and disincentives for people to save."}
        },
        {
            "competencyText": {"en-us": "Explain how employer benefit programs create incentives and disincentives to save and how an employee&rsquo;s decision to save can depend on how the alternatives are presented by the employer."}
        },
        {
            "competencyText": {"en-us": "Using Credit"}
        },
        {
            "competencyText": {"en-us": "Discuss ways that consumers can compare the cost of credit by using the annual percentage rate (APR), initial fees charged, and fees charged for late payment or missed payments."}
        },
        {
            "competencyText": {"en-us": "Discuss that banks and financial institutions sometimes compete by offering credit at low introductory rates, which increase after a set period of time or when the borrower misses a payment or makes a late payment."}
        },
        {
            "competencyText": {"en-us": "Explain that loans can be unsecured or secured with collateral, that collateral is a piece of property that can be sold by the lender to recover all or part of a loan if the borrower fails to repay.  Explain why secured loans are viewed as having less risk and why lenders charge a lower interest rate than they charge for unsecured loans."}
        },
        {
            "competencyText": {"en-us": "Describe why people often make a cash payment to the seller of a good&mdash;called a down payment&mdash;in order to reduce the amount they need to borrow.  Describe why lenders may consider loans made with a down payment to have less risk because the down payment gives the borrower some equity or ownership right away and why these loans may carry a lower interest rate."}
        },
        {
            "competencyText": {"en-us": "Explain that lenders make credit decisions based in part on consumer payment history. Credit bureaus record borrowers&rsquo; credit and payment histories and provide that information to lenders in credit reports."}
        },
        {
            "competencyText": {"en-us": "Discuss that lenders can pay to receive a borrower&rsquo;s credit score from a credit bureau and that a credit score is a number based on information in a credit report and assesses a person&rsquo;s credit risk."}
        },
        {
            "competencyText": {"en-us": "Describe that, in addition to assessing a person&rsquo;s credit risk, credit reports and scores may be requested and used by employers in hiring decisions, landlords in deciding whether to rent apartments, and insurance companies in charging premiums."}
        },
        {
            "competencyText": {"en-us": "Examine the fact that failure to repay a loan has significant consequences for borrowers such as negative entries on their credit report, repossession of property (collateral), garnishment of wages, and the inability to obtain loans in the future."}
        },
        {
            "competencyText": {"en-us": "Explain that consumers who have difficulty repaying debt can seek assistance through credit counseling services and by negotiating directly with creditors."}
        },
        {
            "competencyText": {"en-us": "Analyze the fact that, in extreme cases, bankruptcy may be an option for consumers who are unable to repay debt, and although bankruptcy provides some benefits, filing for bankruptcy also entails considerable costs, including having notice of the bankruptcy appear on a consumer&rsquo;s credit report for up to 10 years."}
        },
        {
            "competencyText": {"en-us": "Explain that people often apply for a mortgage to purchase a home and identify a mortgage is a type of loan that is secured by real estate property as collateral."}
        },
        {
            "competencyText": {"en-us": "Discuss that consumers who use credit should be aware of laws that are in place to protect them and that these include requirements to provide full disclosure of credit terms such as APR and fees, as well as protection against discrimination and abusive marketing or collection practices."}
        },
        {
            "competencyText": {"en-us": "Explain that consumers are entitled to a free copy of their credit report annually so that they can verify that no errors were made that might increase their cost of credit."}
        },
        {
            "competencyText": {"en-us": "Financial Investing"}
        },
        {
            "competencyText": {"en-us": "Compare the ways that federal, state, and local tax rates vary on different types of investments.  Describe the taxes effect on the after-tax rate of return of an investment."}
        },
        {
            "competencyText": {"en-us": "Explain how the expenses of buying, selling, and holding financial assets decrease the rate of return from an investment."}
        },
        {
            "competencyText": {"en-us": "Discuss that buyers and sellers in financial markets determine prices of financial assets and therefore influence the rates of return on those assets."}
        },
        {
            "competencyText": {"en-us": "Explain that an investment with greater risk than another investment will commonly have a lower market price, and therefore a higher rate of return, than the other investment."}
        },
        {
            "competencyText": {"en-us": "Explain that shorter-term investments will likely have lower rates of return than longer-term investments."}
        },
        {
            "competencyText": {"en-us": "Describe how diversifying investments in different types of financial assets can lower investment risk."}
        },
        {
            "competencyText": {"en-us": "Describe how financial markets adjust to new financial news and that prices in those markets reflect what is known about those financial assets."}
        },
        {
            "competencyText": {"en-us": "Discuss ways that the prices of financial assets are affected by interest rates and explain that the prices of financial assets are also affected by changes in domestic and international economic conditions, monetary policy, and fiscal policy."}
        },
        {
            "competencyText": {"en-us": "Examine why investors should be aware of tendencies that people have that may result in poor choices, which may include avoiding selling assets at a loss because they weigh losses more than they weigh gains and investing in financial assets with which they are familiar, such as their own employer&rsquo;s stock or domestic rather than international stocks."}
        },
        {
            "competencyText": {"en-us": "Explain that people vary in their willingness to take risks because the willingness to take risks depends on factors such as personality, income, and family situation."}
        },
        {
            "competencyText": {"en-us": "Describe why an economic role for a government may exist if individuals do not have complete information about the nature of alternative investments or access to competitive financial markets."}
        },
        {
            "competencyText": {"en-us": "Compare the Securities and Exchange Commission (SEC), the Federal Reserve, and other government agencies that regulate financial markets."}
        },
        {
            "competencyText": {"en-us": "Protecting and Insuring"}
        },
        {
            "competencyText": {"en-us": "Describe how individuals vary with respect to their willingness to accept risk and why most people are willing to pay a small cost now if it means they can avoid a possible larger loss later."}
        },
        {
            "competencyText": {"en-us": "Analyze how judgment regarding risky events is subject to errors because people tend to overestimate the probability of infrequent events, often because they&rsquo;ve heard of or seen a recent example."}
        },
        {
            "competencyText": {"en-us": "Describe why people choose different amounts of insurance coverage based on their willingness to accept risk, as well as their occupation, lifestyle, age, financial profile, and the price of insurance."}
        },
        {
            "competencyText": {"en-us": "Explain that people may be required by governments or by certain types of contracts (e.g., home mortgages) to purchase some types of insurance."}
        },
        {
            "competencyText": {"en-us": "Describe how an insurance contract can increase the probability or size of a potential loss because having the insurance results in the person taking more risks, and that policy features such as deductibles and copayments are cost-sharing features that encourage the policyholder to take steps to reduce the potential size of a loss (claim)."}
        },
        {
            "competencyText": {"en-us": "Explain that people can lower insurance premiums by behaving in ways that show they pose a lower risk."}
        },
        {
            "competencyText": {"en-us": "Compare the purposes of various types of insurance, including that health insurance provides for funds to pay for health care in the event of illness and may also pay for the cost of preventative care; disability insurance is income insurance that provides funds to replace income lost while an individual is ill or injured and unable to work; property and casualty insurance pays for damage or loss to the insured&rsquo;s property; life insurance benefits are paid to the insured&rsquo;s beneficiaries in the event of the policyholder&rsquo;s death."}
        },
        {
            "competencyText": {"en-us": "Discuss the fact that, in addition to privately purchased insurance, some government benefit programs provide a social safety net to protect individuals from economic hardship created by unexpected events."}
        },
        {
            "competencyText": {"en-us": "Explain that loss of assets, wealth, and future opportunities can occur if an individual&rsquo;s personal information is obtained by others through identity theft and then used fraudulently, and that by managing their personal information and choosing the environment in which it is revealed, individuals can accept, reduce, and insure against the risk of loss due to identity theft."}
        },
        {
            "competencyText": {"en-us": "Compare federal and state regulations that provide some remedies and assistance for victims of identity theft."}
        }
    ]
}