{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://case.georgiastandards.org/uri/0765f630-44ce-11e9-9922-0242ac150004",
        "name": {"en-us": "National Standards for Quality Online Teaching"},
        "description": {"en-us": "The National Standards for Quality Online Teaching provide a framework for schools, districts, state agencies, statewide online programs and other interested educational organizations to improve online teaching and learning."},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://case.georgiastandards.org/uri/7eb5e85a-6fef-59f4-a5f2-6665ab9681db",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "The online teacher demonstrates professional responsibilities in keeping with the best practices of online instruction."}
        },
        {
            "competencyText": {"en-us": "The online teacher meets the professional teaching standards or has academic credentials in the field in which he or she is teaching."},
            "comment": {
                "en-us": ["EXPLANATIONS\t\r\n* Professional teaching standards may include state or teaching requirements specific to teaching online.\r\n* The online teacher is able to demonstrate best practices in the online classroom.\r\n* The online teacher demonstrates knowledge of the subject area(s) and pedagogy appropriate for learners.\r\n\r\nEXAMPLES\t\r\n* The online teacher holds credentials in the field of study he or she is teaching.\r\n* The online teacher has a valid teaching certificate and/or is highly qualified"]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher is a reflective practitioner."},
            "comment": {
                "en-us": ["EXPLANATIONS\t\r\nThe online teacher is a reflective practitioner who continues to focus on his or her practice and finds opportunities for growth.\r\nEXAMPLES\t\r\nThe online teacher seeks out colleagues for feedback/suggestions on areas of practice that, after reflection, show room for growth."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher continuously pursues knowledge and skills related to online learning and pedagogy."},
            "comment": {
                "en-us": ["EXPLANATIONS\t\r\n* The online teacher understands the importance of staying up to date in best practices in his or her ever-evolving field.\r\n* The online teacher identifies areas for professional growth and seeks learning opportunities both independently and through professional learning groups/communities.\r\n\r\nEXAMPLES\t\r\n* Annual evaluations of the online teacher show growth in meeting professional goals.\r\n* The online teacher has evidence of professional development and/or has evidence of meeting individual professional growth plan goals."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher serves as an ambassador of knowledge to stakeholders."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nThe online teacher models best practices in the online classroom and advocates for all teachers to practice reflection and add to their knowledge about online education throughout their lives.\r\nEXAMPLES\r\nThe online teacher serves as a mentor, leads a Professional Learning Community (PLC), or leads staff professional development."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher demonstrates knowledge of the role of online learning in preparing learners to participate as global citizens."},
            "comment": {
                "en-us": ["EXPLANATIONS\t\r\n* The online teacher builds learner capacity for collaboration in the online environment and encourages learners to participate as global citizens.\r\n* The online teacher creates a collaborative environment where learners participate as global citizens.\r\n* Learners are encouraged to participate in groups and complete assignments in a collaborative manner.\r\n\r\nEXAMPLES\t\r\n* The online teacher provides digital opportunities for learners to use skills such as critical thinking, collaboration, communication, and problem solving that prepare them to become global citizens.\r\n* Examples include: peer-based learning, peer coaching, authentic learning experiences, inquiry-based activities, a structured but flexible learning environment, collaborative learning, discussion groups, self-directed learning, case studies, small group work, collaborative learning, and guided design built into the course."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher demonstrates an understanding of effective time management strategies."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nTime management is a crucial component to successful online instruction.\r\nEXAMPLES\r\nThe online teacher structures his or her day by blocking out time for communication, feedback, and professional development."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher models digital citizenship."},
            "comment": {
                "en-us": ["EXPLANATIONS\t\r\n* The online teacher needs to advocate for, and to be aware of, the risks as well as the benefits of Internet usage and collaboration.\r\n* The online teacher must provide guidelines for appropriate behavior and usage of digital resources as relates to intellectual property and fair use.\r\n* The online teacher also educates learners as to why following such guidelines is crucial to positive global citizenship for the protection of all users.\r\n\r\nEXAMPLES\t\r\n* Netiquette guidelines should be accessible to stakeholders and may include: guidelines for all online communication, use of social media, careful management of the digital footprint, respecting copyright and intellectual property, policies that clearly outline the consequences of inappropriate use of digital resources, and clear alignment of classroom policies to program-level policies.\r\n* Digital citizenship should include the online teacher modeling and advocating for appropriate and balanced technology usage (i.e., healthy media diet). The American Academy of Pediatrics offers recommendations for healthy use of screen time and media for children."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher maintains accurate records of relevant information and communications in the appropriate format."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nOnline teacher records should include communications as well as documents, images, work samples, and others.\r\nEXAMPLES\r\n* The online teacher maintains a communication log documenting contacts with site mentors, parents, and other support. The teacher maintains records of communications with students and encourages students to respond to any teacher-initiated communications.\r\n* The online teacher gives in-course feedback, which appears on the students’ grades page. The teacher uses a Student Information System, which documents and sends progress reports and key communications with parents and coaches.\r\n* The online teacher uses school-provided logs for documenting parent communication. As a back-up, he or she also saves email messages and other records in on-going, complex cases."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher can explain his or her responsibilities in carrying out local or national law, or mandates related to accessibility."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nThe laws and mandates regarding support for diverse learners vary by country and even within states in the United States. They include, the Americans with Disabilities Act (ADA), the Individuals with Disabilities Education Act (IDEA), the Assistive Technology Act, and Section 508. It is important that the online teacher understands how his or her specific online program requires local laws and mandates to be met, and the process for accessing the tools to which he or she has access for educating diverse learners.\r\nEXAMPLES\t\r\n* The online teacher can work with the learners’ local schools to understand the disability service plans and then report to colleagues what can be done to provide the most supportive learning environment for the learner.\r\n* An online teacher who does not have access to the learner disability service information can work with a coordinator within the online program to ensure learners are provided with the most supportive learning environment.\r\n* The online teacher, after reviewing the IEP, reaches out to the school contact to ensure the student has the adaptive technology required by the IEP. The online teacher also shares training videos on the hardware/software with the parent(s)."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher supports learning and facilitates presence (teacher, social, and learner) with digital pedagogy."}
        },
        {
            "competencyText": {"en-us": "The online teacher uses digital pedagogical tools that support communication, productivity, collaboration, analysis, presentation, research, content delivery, and interaction."},
            "comment": {
                "en-us": ["EXPLANATIONS\t\r\n* The online teacher selects and uses a variety of tools for communication, including tools used to explain content, develop conceptual understanding, deepen social interaction, and develop an online social presence.\r\n* The online teacher needs to communicate with learners through means other than, and in addition to, phone calls or email messages.\r\n* The online teacher needs to understand the connection between using tools and building meaningful relationships with learners (presence) in order to support achievement and persistence.\r\n* The online teacher demonstrates meaningful relationships with learners (presence) through the use of specific tools in order to support achievement and persistence.\r\n\r\nEXAMPLES\t\r\n* An online teacher starts a discussion board with academic content as well as announcements and support for self-regulation of learning online. In addition, the teacher uses applications based on learner recommendations to send out announcements and offer support.\r\n* The online teacher may conduct daily live sessions with learners in a web-conferencing application to provide learners with opportunities to interact with the content alongside and with their peers.\r\n* In a blended setting, the teacher engages with learners in authentic ways through Book Study or by inviting discussion with an author to develop conceptual understanding and deepen social interaction.\r\n* The online teacher can create an authentic online learning experience for learners by asking them to interact with researchers about the topic. For example, an online instructor teaching horticulture can coordinate with an heirloom seed organization focused on local crop sustainability to create an authentic online learning experience."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher incorporates discipline-specific technologies, tools, and resources to meet individualized learner needs."},
            "comment": {
                "en-us": ["EXPLANATIONS\t\r\n* Frameworks like the Universal Design for Learning emphasize the need for learner agency and instructor responsiveness for optimal learning, as well as the need to utilize discipline-specific technologies, tools, and resources to meet the individual needs of diverse learners through consideration of what will work for all.\r\n* The online teacher varies resources and strategies depending on individual student needs.\r\n\r\nEXAMPLES\t\r\n* The online teacher can use open educational resources (OER) to develop lessons, which allow for learner choice.\r\n* The online teacher can demonstrate evaluation strategies for resources that use a variety of cultural contexts.\r\n* The online teacher of blended courses can confer with small groups about sources found online for a particular topic and then have the groups re-configure (into smaller or larger groups) to find corroborating sources.\r\n* The online teacher may develop (or work with others to develop) games to teach content and develop social skills. Teachers and researchers might collaborate to develop the gaming technology. For example, the online teacher may gamify lessons to engage students learning about the solar system."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher uses different types of tools to interact in online courses in order to nurture learner relationships, encourage learner interactions, and monitor and motivate learner engagement."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nOnline teacher presence is embodied through nurturing learner relationships, encouraging learner interactions, and monitoring and motivating learner engagement. This includes learner-teacher relationship building as well.\r\n\r\nEXAMPLES\r\n* The online teacher may give explicit instruction for online discussion forums regarding etiquette and providing feedback about how learners should communicate with each other.\r\n* Online and blended teachers may perform action research to explore the ways in which they nurture inquiry and/or social and emotional development."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher demonstrates basic troubleshooting skills and addresses basic technical issues as they arise."},
            "comment": {
                "en-us": ["EXPLANATIONS\t\r\n* The online teacher uses troubleshooting skills (e.g., changing passwords, downloading plug-ins, etc.) for him or herself and learners.\r\n* Additionally, the teacher knows how to contact local technology support, if more advanced help is needed, and can direct learners to the appropriate support.\r\n* The online teacher has the knowledge to serve as the first point of contact when learners need unexpected problem solving with accessing and using technology.\r\n\r\nEXAMPLES\t\r\n* Basic troubleshooting skills may require the online teacher to, for example, change passwords, and help learners download plug-ins.\r\n* The online teacher is able to contact local tech support, which may take the form of a help desk or ticket system. The online teacher knows if and how learners can get advanced technological support and access to technology as various situations arise."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher supports safe digital learning spaces for all learners (e.g., data ownership and privacy expectations, digital identity curation)."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* The online teacher needs to consider how to create safe spaces that honor learners’ rights to privacy and support them in determining who they want to be known as when they are online.\r\n* The online teacher needs to model and understand how digital information can be used in both negative and positive ways.\r\n\r\nEXAMPLES\r\nThe online teacher creates examples of email address or social media handles for learners to review, critique, and reflect upon and shares his or her experience with creating online identities, which could be done in an orientation prior to the course or at the beginning of it."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher facilitates interactions and collaboration to build a supportive online community that fosters active learning."}
        },
        {
            "competencyText": {"en-us": "The online teacher employs learner-centered instructional strategies and current practices that leverage technology for learner collaboration."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nWhere possible, the online teacher should strive to integrate approaches that actively engage learners and foster collaborative learning.\r\n\r\nEXAMPLES\r\n* The online teacher uses digital software to monitor individuals who may not be participating in the learning community, so he or she can intervene and provide assistance where needed.\r\n* The online teacher may use any number of active learning strategies, including peer-based learning, inquiry-based activities, collaborative learning, discussion groups, and small group work to cultivate learner interaction."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher creates expectations for appropriate interaction among learners, including establishing netiquette requirements, modeling implementation, and enforcing the requirements."},
            "comment": {
                "en-us": [
                    "EXPLANATIONS\r\nIt is important for online teachers to establish and enforce netiquette guidelines for acceptable online behavior to ensure that learners are interacting in an appropriate, safe, and constructive manner, especially in diverse environments. This also allows the instructor to maintain an active presence to monitor constructive interaction in both asynchronous and synchronous online settings.\r\n\r\nEXAMPLES\r\nThe online teacher actively participates and models both asynchronous and synchronous facilitation and interaction. This may include, but is not limited to, the following: instant messaging, text chat, audio and/or video conferencing, and other live exchange of information (synchronous)",
                    " as well as email, discussion boards, blogs, and other non-live methods (asynchronous)."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher develops a community among culturally diverse learners by providing opportunities for interaction that are conducive to active learning."},
            "comment": {
                "en-us": [
                    "EXPLANATIONS\r\n* An essential component of online teaching is creating a diverse community conducive to active learning, where learners can openly communicate and work to achieve a mutual objective.\r\n* In addition, it is important that online learners feel a sense of inclusion, control, and care created by the teacher, which is accomplished through effective facilitation.\r\n* Once community is established, active learning such as authentic assessment and peer-to-peer discovery can take place.\r\n\r\nEXAMPLES\r\nThe online teacher builds the community by modeling appropriate communication and creating a relationship of trust. This is done by establishing consistent and reliable expectations and encouraging independence and creativity. Examples are: communicating with learners on an on-going and consistent basis to encourage their participation, including sending important class announcements and reminders to keep learners on track",
                    " expressing an interest in their personal lives",
                    " and creating areas in the course for personal connection, such as a discussion board lounge or personal 1-1 chat with instructor."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher promotes learner-learner interaction in online groups in order to foster collaboration and promote higher-order thinking skills such as analysis, synthesis, and/or evaluation."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nLearner-learner interaction may take place in group activities, such as projects, discussions, and instruction. An important component to building higher-order thinking skills among learners is facilitating their interaction in online settings, particularly in groups, projects, and/or discussions to allow for collaborative interaction.\r\n\r\nEXAMPLES\r\n* The online teacher encourages learners who have little active online contribution to the collaborative activity to share their ideas within the safe space of group discussion.\r\n* The online teacher follows up with active online discussion, posing deeper questions to push learners’ thinking forward."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher is able to meet the learning needs of all learners, regardless of cultural background and perspective."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* Because any course may have learners from diverse backgrounds and with varying learning needs, the online instructor must be able to meet the needs of a wide variety of learners.\r\n* It is important for the online teacher to encourage diversity of perspectives when facilitating online discussions or interactions so that a multitude of learner voices are represented, and, as a result, viewpoints and perspectives can be broadened.\r\n\r\nEXAMPLES\r\n* The rubrics for online discussions indicate that the online teacher takes original thought into account when grading assessments.\r\n* The online teacher ensures that learners take turns leading discussions, so that all learner voices are represented.\r\n* The online teacher establishes guidelines for learners to follow to ensure a productive discussion that represents diverse perspectives.\r\n* The online teacher demonstrates respect for diversity in online discussion contributions by commenting on a variety of ideas.\r\n* The online teacher may play devil’s advocate or assign the devil’s advocate (or similar) role within a discussion to encourage a wide array of perspectives.\r\n* The online teacher implements different teaching strategies, depending on the cultural background and proficiency levels of each learner."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher promotes learner success through interactions with learners and other stakeholders and by facilitating meaningful learner engagement in learning activities."}
        },
        {
            "competencyText": {"en-us": "The online teacher uses digital tools to identify patterns in learner engagement and performance that will inform improvements to achieve individual learner growth."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nThe online teacher needs to be able to analyze and interpret a wide range of activity and performance-level data provided in LMSs, adaptive software, and other digital tools. Further, the online teacher needs to be able to identify patterns in the data that can inform interventions geared towards maximizing each learner’s growth.\r\n\r\nEXAMPLES\t\r\n* The online teacher uses a mastery dashboard to keep track of whether learners need remediation, are near mastery, or have achieved mastery (as well as what defines an individual’s level of mastery based on growth). Data from the dashboard are used to determine who needs 1-1 sessions with the instructor, learner grouping, etc.\r\n* The online teacher uses activity data with the course LMS or dashboard to identify how often a learner logs into the system and what areas/objectives the learner is spending instructional time on. This data helps the teacher in a goal-setting consultation with the learner.\r\n* The online teacher has integrated adaptive learning software into the classroom. The teacher uses data dashboards from the software to monitor learner progress and activity and uses this data to provide targeted instruction to learners in areas where they are struggling.\r\n* The online teacher works with his or her campus instructional design and data departments to extract useful, actionable data from the LMS regarding learner behavior."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher engages learner agency."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nIt is important for teachers to promote learner agency by jointly setting goals and conferencing with them about their progress towards the goals that have been set. This buy-in is an important part of motivation (see Self-Determination Theory) as opposed to teachers themselves setting all the goals and just monitoring learner progress themselves.\r\n\r\nEXAMPLES\t\r\n* The online teacher regularly conferences with each learner to establish some individual goals regarding performance on mastery outcomes and then follows up to encourage the learner regarding progress towards those goals.\r\n* The online teacher communicates with individual learners to review progress in the class and learn from the learner perspective about personal interests and barriers to learning that can inform the support that is provided to the learner."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher enables a learner-customized pace and/or path through instruction aligned with learners’ individual goals, learning trajectories, and interests."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* The online teacher uses varied assessment strategies, not limited to the course curriculum, which identify the learner’s ability.\r\n* Assessment allows both instructor and learner to monitor progress towards achieving learning objectives and can be approached in a variety of ways, including the online curriculum.\r\n* Learners learn best when they:\r\n\t(1) engage with content just at the edge of their own expertise, and\r\n\t(2) are learning for mastery, which is facilitated by intrinsic motivation, shared ownership of learning goals, and learner agency.\r\n\r\nEXAMPLES\r\n* The online teacher adjusts or adapts content representations or explanations and creates or points learners to simpler explanations or additional/supplemental activities aligned to their level/background.\r\n* The online teacher provides additional scaffolding activities or content through announcements or other means to learners that need them.\r\n* The online teacher allows learners to choose from different options for completing an assignment to demonstrate mastery of the skill they are working on.\r\n* The online teacher guides learners through the content at different speeds, or in a different order, based on their needs and interests."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher establishes relationships through timely and encouraging communication using various formats."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* Regardless of who the online teacher is communicating with, effective communication methods are necessary to successful two-way communication.\r\n* The online teacher is proficient at communicating using various formats (e.g., text audio, video, synchronous, asynchronous) and selects the format that is best for the specific situation and purpose.\r\n\r\nEXAMPLES\r\n* Depending on the situation, purpose, and participants, the online teacher strategically selects a communication format (e.g., text, audio, video, synchronous, asynchronous).\r\n* At the start of the course, the online teacher works to develop relationships with learners by communicating in a welcoming way that allows learners to recognize the online teacher as a “real” person who wants them to be successful."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher helps learners reach content mastery through instruction and quality feedback using various formats."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* The online teacher provides actionable, specific, and timely feedback.\r\n* As the content expert, the online teacher is responsible for helping learners to master the course content via flexible and interactive instruction, tutoring, and personalized feedback.\r\n* When appropriate, the online teacher incorporates rich media.\r\n\r\nEXAMPLES\r\n* Following a project-based learning unit, the online teacher uses screencast recordings to provide learners with specific feedback on their portfolio pages.\r\n* The online teacher holds regular office hours that provide learners the opportunity to receive tutoring synchronously.\r\n* The online teacher responds to learners’ content-related questions via email."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher ensures that learners have necessary course resources and the information needed to navigate the learning platform and perform required tasks in a timely manner."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nAs the content expert, the online teacher is responsible for helping learners to navigate the course platform and perform the required tasks within the course.\r\n\r\nEXAMPLES\r\n* At the beginning of the course, the online teacher provides learners with a welcome letter that directs learners to important information, such as a syllabus, pacing guide, where to find their grades, etc.\r\n* During the course, the online teacher emails learners or initiates a course check-in to ensure that learners know where to find feedback from their instructor.\r\n* The online teacher provides a screencast showing learners how to submit an assignment with media.\r\n* The course commences with a Start Here/Welcome page. which provides key information about the course, teacher, and how to navigate to the first activity."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher communicates frequently with stakeholders regarding learner progress and strategies for supporting learner engagement."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* As the course facilitator, the online teacher is responsible for communicating with all of the stakeholders regarding the learner’s progress and strategies for supporting the learner.\r\n* Communication should be ongoing, open, proactive, and continuous. It should address both learner successes and challenges and be documented appropriately.\r\n\r\nEXAMPLES\r\n* Examples of stakeholders include parents, on-site facilitators, and counselors.\r\n* The online teacher communicates with parents, learners, and guidance counselors when a learner falls behind in a course.\r\n* The online teacher communicates various study practices with parents that they can use to support their child.\r\n* The online teacher communicates concerns about the learner’s grade to all pertinent stakeholders.\r\n* The online teacher communicates to the learner how his or her work clearly demonstrates mastery of knowledge and skills, with specific examples.\r\n* The online teacher maintains a communication log documenting contact with site mentors, parents, and other support. The teacher maintains a record of communications with learners and encourages them to respond to teacher-initiated communications.\r\n* The online teacher gives in-course feedback, which appears on the learners’ grades page. Teachers use a Student Information System, which sends and documents progress reports and key communications with parents and coaches."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher models, guides, and encourages legal, ethical, and safe behavior related to technology use."}
        },
        {
            "competencyText": {"en-us": "The online teacher facilitates learning experiences that model and promote digital citizenship."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* Through announcements and feedback, the online teacher models and provides instruction that promotes information literacy and digital literacy skills.\r\n* Note: In, for example, courses that are already created, teachers may not be able to create learning experiences but can provide additional direction to students through feedback and other communications.\r\n\r\nEXAMPLES\r\n* Some examples of teacher activities that model and promote digital citizenship are: a screencast demonstrating how to locate reliable digital content, an announcement explaining how to evaluate the usefulness of information for a specific task, and instruction in how to locate and cite reliable resources.\r\n* The online teacher provides information about evaluating reliable sources and providing factual evidence when discussing issues.\r\n* The online teacher knows how to attribute Creative Commons-licensed, open content/Open Educational Resources.\r\n* The online teacher requires learners to find valid information when conducting research and to cite it appropriately.\r\n* The online teacher facilitates learner investigations of the legal and ethical issues related to technology and a global society."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher establishes standards for learner behavior that are designed to ensure academic integrity and appropriate use of the Internet that adhere to program-level policies."},
            "comment": {
                "en-us": [
                    "EXPLANATIONS\r\n* Academic integrity includes responsible and honest behavior.\r\n* The online teacher knows and understands how the use of technology may lead to instances of academic dishonesty.\r\n* The online teacher is able to identify the risks of academic dishonesty for learners and intervene when incidents of academic dishonesty occur.\r\n\r\nEXAMPLES\r\n* Course content includes a module/unit where learners can demonstrate academic integrity. The online teacher is able to practice and model proper academic integrity for learners.\r\n* The online teacher provides information about using and citing sources, as well as other academic integrity resources available, like plagiarism-checking tools. The online teacher actively participates in and models both asynchronous and synchronous facilitation and interaction. This includes, but is not limited to, synchronous methods, such as instant messaging, live chat, and audio/video conferencing",
                    " and asynchronous methods, such as discussion boards and blogs.\r\n* The teacher provides information about using and citing sources or other resources available, like plagiarism-checking tools.\r\n* Specific guidelines for learner behavior are included in the course.\r\n* The online teacher models expected behavior and does not present another’s work as his or her own."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher models and complies with intellectual property policies and fair-use standards and reinforces their use with learners."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* The online teacher respects copyright law, demonstrates appropriate use, and models the use of correct citations in teacher-created materials.\r\n* The online teacher knows and understands how the use of technology may lead to instances of academic dishonesty.\r\n* The online teacher is able to identify the risks and intervene in incidents of academic dishonesty for learners.\r\n\r\nEXAMPLES\r\n* The online teacher provides clear links to program policies in the course and does not share learner work or information without proper permissions. The teacher provides specific instructions or guidelines to learners regarding collaborative work and sharing of information.\r\n* Course policies align with and support program policies, and the online teacher adheres to program policies when creating course content and/or materials.\r\n* The online teacher may have learners complete a module or unit on copyright and fair use and/or work with the school’s teacher librarian to review appropriate resources."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher implements policies, including federal, state, and program-level policies (where applicable), designed to protect learners in the classroom and follows program and classroom Acceptable Use Policies (AUP)."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* It is imperative that online teachers follow federal, state, and program policies in order to create a safe and supportive learning environment for learners.\r\n* Examples of policies include national, state, and local program coverage of the Family Education Rights and Privacy Act (FERPA), the Individuals with Disabilities Education Act (IDEA), the Children’s Online Protection Act (COPA), the General Data Protection Regulation (GDPR), and the Acceptable Use Policy (AUP) etc.\r\n* Note: program policies typically include federal and state policies.\r\n\r\nEXAMPLES\r\nThe online teacher has participated in policy training and signed off on program policies. The teacher has implemented links to program policies in course(s)."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher personalizes instruction based on the learner’s diverse academic, social, and emotional needs."}
        },
        {
            "competencyText": {"en-us": "The online teacher and support staff, where applicable, monitor and interpret learner progress and provide reasonable additional supports to all learners, paying particular attention to learners with identified disabilities or who represent traditionally underserved groups."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nOnline teachers discern when and how to employ alternate instructional strategies to support individual learners as identified by their learning patterns and federal, state, or local requirements.\r\n\r\nEXAMPLES\r\nAfter analyzing benchmarks, the online teacher observes that an English Language Learner (ELL) isn’t making adequate progress and that unfamiliarity with English is the reason. The online teacher then provides additional support using strategies that are effective for English Language Learners."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher communicates with appropriate school staff regarding specific accommodations, modifications, or needs and works in collaboration with others to address learner needs."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nThe online teacher correctly executes the process for connecting with local support personnel to verify a learner’s individualized education plan (IEP) requirements or the 504 accommodations needed for learner success.\r\n\r\nEXAMPLES\r\nThe online teacher, after reviewing the IEP, reaches out to the school contact to ensure the learner has the adaptive technology required by the IEP. The online teacher also shares training videos on the hardware/software with the parent."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher uses data (quantitative and qualitative) to identify learners who need additional support services."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* Support services include those for special education, gifted education, therapies, English language development, and/or economic aid.\r\n* All educators in the United States are obligated to identify learners for services in accordance with the Individuals with Disabilities Education Act (IDEA, 2004).\r\n\r\nEXAMPLES\r\nBy listening to learner speech in a small group, the online teacher can notice a learner who might need speech therapy or English-language support and then refer that learner through the appropriate channels."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher creates alternative formats of course materials, if needed, in order to meet the needs of diverse learners and accommodate alternative means of access."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* When additional course content is needed to supplement instructional material, the online teacher needs to ensure that it is accessible, allowing all learners an equivalent educational experience.\r\n* In some cases, the online teacher may need to provide content in alternative formats to accommodate student learning needs.\r\n\r\nEXAMPLES\r\n* The online teacher modifies numeric scores on a rubric for a student who is learning disabled.\r\n* Rather than assigning an essay to a learner with a processing disorder, the online teacher allows the learner to create a poster with artifacts to illustrate his or her point.\r\n* Rather than having a learner read *Alice in Wonderland*, the online teacher asks the student to watch the movie."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher recommends assistive technologies where appropriate to meet mandated needs and address learner preferences."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nCowan and Turner-Smith (1999) defined assistive technology “as any device or system that allows an individual to perform a task that they would otherwise be unable to do, or increases the ease and safety with which the task can be performed” (p. 2).\r\n\r\nEXAMPLES\r\nThe online teacher chooses accessible supplementary materials based on factors such as compatibility with screen readers."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher provides additional opportunities for personalized learner growth or enrichment."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nMany learners, including those with high achievement scores, can be challenged better by having opportunities to expand their learning beyond the established curriculum.\r\n\r\nEXAMPLES\r\nThe online teacher can encourage a learner to submit additional resources to be considered for a school-based or class-based OER repository around a given topic of the learner’s choice, providing multiple opportunities to go beyond what is being taught and develop a positive attitude toward learning and the competencies of their peers."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher supports and provides a forum for sharing the varied talents and skills that learners bring to the online environment."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nOften conceptualizations of diverse learners use a deficit orientation rather than a strengths one. If online learning is going to be a medium for innovation, then the online teacher has to lead the way in developing and leveraging diverse learners’ strengths.\r\n\r\nEXAMPLES\r\nThe online teacher collaborates with a learner with autism to develop a creative video-based assessment plan for the course based on that learners’ declared strength in video-editing technology."]
            }
        },
        {
            "competencyText": {"en-us": "Assessment and Measurement – The online teacher creates and/or implements assessments in online learning environments in ways that ensure the validity and reliability of the instruments and procedures. The teacher measures learner progress through assessments, projects, and assignments that meet standards-based learning goals, and evaluates learner understanding of how these assessments measure achievement of the learning objectives. (Note: In courses that are already created, teachers may not be able to create or include additional assessments.)"}
        },
        {
            "competencyText": {"en-us": "The online teacher chooses appropriate assessment tools, which allow students the opportunity to demonstrate mastery of the content."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nOrganizations can determine the appropriate instruments according to their LMS and the role of the online teacher in creating and/or implementing them.\r\n\r\nEXAMPLES\r\n* Examples include a variety of formative and summative assessments, which could include auto-graded assessments, student projects, videos, student-created multimedia, or live presentations.\r\n* The online teacher adds formative assessments to the courses, which encourage students to check their knowledge and ask questions as needed.\r\n* The teacher suggests improvements to formative and summative assessments, which allow students to demonstrate mastery.\r\n* The teacher analyzes the items in the assessment instrument to inform needed modifications.\r\n* The teacher can determine the appropriate assessment tools as allowed by the LMS and knows his or her role in creating/implementing assessments."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher employs pedagogy and content knowledge to develop and effectively implement assessments in ways that ensure validity and reliability of the instruments and procedures."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nThe online teacher uses his or her content knowledge to verify that assessments align with the content and are, therefore, valid measurements of student performance.\r\n\r\nEXAMPLES\r\n* Use of pedagogy and knowledge of content are evident in teacher-provided feedback.\r\n* The online teacher ensures that assessments are aligned with content objectives.\r\n* The online teacher previews assessments for accuracy and relevancy to content.\r\n* The online teacher keeps a list of questions that most students miss or misinterpret and revises or removes them."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher uses strategies to ensure learner academic integrity and the security of learner assessment data."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* The online teacher works with schools and organizations to determine the best testing and monitoring protocols based on program policies.\r\n* Individual schools and organizations have varying procedures and policies on how they protect learner data. The online teacher is responsible for determining and implementing effective strategies to secure learner data based on program policies.\r\n* The online teacher implements the school’s strategies and policies on academic integrity and data security.\r\n\r\nEXAMPLES\r\n* The online teacher communicates to learners and stakeholders about assessment procedures (passwords, test-taking conditions, etc.).\r\n* The teacher monitors learners’ academic integrity in completion of their assessments.\r\n* The teacher uses plagiarism software.\r\n* The teacher equips assessments with an academic integrity tool."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher implements a variety of assessments that accurately measure learner proficiency."},
            "comment": {
                "en-us": [
                    "EXPLANATIONS\r\nThe online teacher is able to apply authentic assessments as part of the evaluation process, assess learner knowledge in a forum beyond traditional assessments, and monitor the academic integrity of assessments. No assessment is perfect",
                    " so multiple and varied assessments give a clearer picture of progress.\r\n\r\nNote: The options for assessment instruments available to teachers will vary according to the LMS used. Teacher access to learner assessment data may vary.\r\n\r\nEXAMPLES\r\n* The online teacher uses a variety of formative and summative assessments.\r\n* The online teacher knows and understands the reach of authentic assessments (i.e., the opportunity to demonstrate understanding of acquired knowledge and skills, as opposed to testing isolated skills or retained facts) and that they are a part of the evaluation process.\r\n* The online teacher uses a variety of formative and summative assessments, which could include auto-graded assessments, student projects, videos, student-created multimedia, embedded self-checks, portfolios, or live presentations.\r\n* The online teacher uses a school-created or endorsed exam for a concept but also asks the students in small group discussion to share something they learned that was not on the test"
                ]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher evaluates learner readiness and progress using formative and summative assessments and learner feedback throughout the course."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* The online teacher evaluates student learning through a variety of assessment methods and provides opportunities for learners to reflect on their learning. The teacher may gather learner feedback to inform learning needs through a variety of methods available.\r\n* The online teacher recognizes when learners are ready for course content based on prior performance.\r\n* The online teacher identifies learners who struggle to learn in the online environment.\r\n* The online teacher demonstrates data literacy skills by evaluating learning progress using formative and summative assessments and learner feedback throughout the course.\r\n\r\nEXAMPLES\r\n* The online teacher uses data from a variety of formative and summative assessments to inform him or her of student learning progress.\r\n* The teacher creates learner surveys, polls, check-in calls, live sessions, etc. to inform him or her of student learning progress and instructional needs.\r\n* The teacher reads and interprets information presented in data form to effectively implement interventions to support learner success.\r\n* The teacher uses an orientation lesson or learning environment navigation activity to assess learner readiness for the learning environment.\r\n* The online teacher provides a pre-assessment that triggers what content is visible and will be completed by the learner.\r\n* The online teacher provides learners the opportunity to practice skills, like recording their voices, prior to having to submit a recording for a graded activity."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher assures alignment between the assignments, assessments, and standards-based learning goals."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nTeacher-created assignments/assessments clearly demonstrate alignment with standards-based learning goals.\r\n\r\nEXAMPLES\r\nThe online teacher reviews formative and summative assessments and tracks items that do not align with the content and need to be removed or revised."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher customizes instruction to personalize the learning experience based on performance and assessment data and learner need."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nThe online teacher responds to learner engagement and performance data by adjusting instruction and teacher-implemented support strategies while remaining true to the rigor and goals of the course.\r\n\r\nEXAMPLES\r\n* The online teacher looks at a learner’s search history and realizes the learner has spent three days on the same website. The teacher then arranges to meet with the learner to discuss potential problems and restore momentum.\r\n* The teacher uses assessment data, suggests an online review activity to help the learner master the material on which he or she did not perform well, and asks the learner to respond to three follow-up questions that relate to mastery of the material.\r\n* The teacher creates an alternate pacing guide or schedule to help a learner get back on schedule.\r\n* An individual learner might be exempted from certain assignments or given an alternate means of demonstrating understanding based on formative assessment data."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher creates opportunities for learner self-assessment within courses."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nSelf-assessment of learning is an effective form of feedback in the learning experience, and it has one of the highest impacts on learner success.\r\n\r\nEXAMPLES\r\nThe online teacher uses a variety of self-assessment strategies, including reflections, rubrics, graphic organizers, oral assessments, and targets."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher curates and creates instructional materials, tools, strategies, and resources to engage all learners and ensure achievement of academic goals."},
            "comment": {
                "en-us": ["These standards are considered optional, as instructional design does not always fall under online teaching responsibilities. For full online course design standards, see the National Standards for Quality Online Courses. The following section outlines standards for instructional design skills for the online teacher of record, where applicable."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher designs learning experiences that use technology effectively to engage learners."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nThe online teacher uses technology to increase learner engagement by giving learners control over their interactions with media.\r\n\r\nEXAMPLES\r\nWherever possible, the online teacher provides opportunities for learners to engage in social learning, global networks, and classroom-to-classroom connections. The online teacher makes assignments active, allowing students to build, design, create, and investigate."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher uses a formative approach to lesson design."},
            "comment": {
                "en-us": [
                    "EXPLANATIONS\r\n* The online teacher utilizes a variety of assessments to measure learner progress. Learner feedback through polls or surveys can be used as evidence of instructional needs.\r\n* Learning is a dynamic process",
                    " if the online teacher realizes a learner hasn’t mastered a topic, then he or she reteaches it.\r\n* The online teacher continually, teaches, elicits feedback, and makes revisions to the online course.\r\n\r\nEXAMPLES\r\nThe online teacher creates surveys or polls to gather learner feedback on a lesson. The online teacher is open to reviewing learner feedback and data to determine if a lesson may be better presented synchronously rather than asynchronously in the future."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher incorporates diverse media into online learning modules."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\nThe online teacher uses media that represent the diversity of today’s learners in his or her classes.\r\n\r\nEXAMPLES\r\nThe online teacher represents all subgroups of learners in art selected in the course to assist learners in identifying with the course.\r\nThe online teacher, conversely, does not stereotype or scapegoat individuals of a particular background anywhere in his or her courses. For example, media that negatively positions Muslims in a U.S. history course in connection with the events of September 11, 2001, would not be used in a course."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher is able to incorporate subject-specific and developmentally appropriate digital learning resources into online learning modules."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* The online teacher adds engaging content and grade-level assessments in the online environment (Learning Management System).\r\n* Course content is at the appropriate reading and comprehension level for the grade level of the learners engaging with it.\r\n\r\nEXAMPLES\r\n* The online teacher includes content to which students can relate. For example, a 4th-grade math class poses a problem that would be encountered by 4th and 5th grade students rather than seniors in high school.\r\n* The online teacher of an 8th-grade current events course tests the reading level and appropriateness of content by making sure it is free of adult content, unnecessary advertisements, and bias before including it in the discussion forum."]
            }
        },
        {
            "competencyText": {"en-us": "The online teacher continuously reviews and aligns all course content with applicable course objectives and standards."}
        },
        {
            "competencyText": {"en-us": "The online teacher creates, selects, and organizes appropriate assignments and assessments to align curricular content with associated standards-based learning goals."},
            "comment": {
                "en-us": ["EXPLANATIONS\r\n* The online teacher demonstrates an understanding of the alignment between the assignments, assessments, and standards-based learning goals.\r\n* Instructional planning accounts for the continuous evaluation process, and course assessments demonstrate alignment with associated standards.\r\n\r\nEXAMPLES\r\n* Learning targets appropriately align with course objectives.\r\n* Courses progress clearly from assignments and assessments at Webb’s Depth of Knowledge 1 to Webb’s Depth of Knowledge 4."]
            }
        }
    ]
}