{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://teks-api.texasgateway.org/ims/case/v1p0/CFDocuments/4ed742d2-1d41-54e2-b862-a8deead80353",
        "name": {"en-us": "Capítulo 128. Conocimientos y Destrezas Esenciales de Texas para Artes del Lenguaje y Lectura en Español"},
        "description": {"en-us": "Updated Spanish translation of 128.1-7 and 128.20-21."},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "Implementación de los conocimientos y destrezas esenciales para artes del lenguaje y lectura en español de primaria, adoptado en 2017."}
        },
        {
            "competencyText": {"en-us": "Las estipulaciones de este subcapítulo y de las secciones §§128.2-128.7 serán implementadas por los distritos escolares."}
        },
        {
            "competencyText": {"en-us": "Con fecha máxima del 31 de agosto del 2018, el comisionado de educación determinará si hay financiamiento disponible para materiales de instrucción para las escuelas públicas de Texas que cubren los conocimientos y destrezas esenciales de artes del lenguaje y lectura en español según lo adoptado en la sección §§128.2-128.7 de este apartado."}
        },
        {
            "competencyText": {"en-us": "Si el comisionado toma la determinación de que hay financiamiento disponible para materiales de instrucción bajo el inciso (b) de esta sección, la sección §§128.2-128.7 de este apartado deberá implementarse empezando el año escolar 2019-2020 y aplicarse a partir del año escolar 2019-2020 y años escolares posteriores."}
        },
        {
            "competencyText": {"en-us": "Si el comisionado no toma la determinación de que hay financiamiento disponible para materiales de instrucción bajo el inciso (b) de esta sección, el comisionado determinará con fecha máxima del 31 de agosto de cada año escolar posterior si hay o no financiamiento disponible para materiales de instrucción. Si el comisionado determina que hay financiamiento disponible para materiales de instrucción, el comisionado notificará al Consejo de Educación Estatal y a los distritos escolares que la sección §§128.2-128.7 de este apartado será implementada para el siguiente año escolar."}
        },
        {
            "competencyText": {"en-us": "Artes del Lenguaje y Lectura en español, Kindergarten, adoptado en 2017."}
        },
        {
            "competencyText": {"en-us": "Introducción."}
        },
        {
            "competencyText": {"en-us": "El currículo Conocimientos y Destrezas Esenciales de Texas (TEKS, por sus siglas en inglés) en español para artes del lenguaje y lectura refleja los estándares de artes del lenguaje que son auténticos al idioma español, así como a la lectura y escritura en español; éste no es una traducción ni una modificación del currículo TEKS de artes del lenguaje en inglés. El currículo TEKS de artes del lenguaje y lectura en español incluye la interrelación natural de escuchar, hablar, leer, escribir y pensar a partir de siete áreas integradas: desarrollo y apoyo de las destrezas fundamentales del lenguaje, comprensión, habilidades para responder, múltiples géneros, propósito y arte del escritor, composición, e indagación e investigación. Las áreas se enfocan en la capacidad oral académica (dominio en la expresión y comprensión oral), en la lectura auténtica y en la escritura reflexiva para asegurar un estado de Texas alfabetizado. Las áreas están integradas y son progresivas para que los estudiantes continúen desarrollando conocimientos y destrezas con un grado de complejidad y de variantes cada vez mayor que les permita pensar críticamente y adaptarse a la naturaleza siempre evolutiva del lenguaje, así como de la lectura y escritura."}
        },
        {
            "competencyText": {"en-us": "Subcapítulo A. Educación Primaria"}
        },
        {
            "competencyText": {"en-us": "Las siete áreas sobre los conocimientos y las destrezas esenciales para artes del lenguaje y lectura en español están pensadas para ser integradas con propósitos de instrucción y son recurrentes por naturaleza. Las áreas incluyen los cuatro componentes del lenguaje (escuchar, hablar, leer y escribir) y su aplicación para acelerar la adquisición de las destrezas de lenguaje, de tal manera que los estudiantes desarrollen niveles óptimos de desempeño lingüístico en los ámbitos social y académico. Aunque algunas áreas pudieran necesitar mayor tiempo de instrucción, cada área es de igual valor, pueden presentarse sin seguir un orden determinado y deben ser incorporadas a lo largo del año. Es importante señalar que codificar (escribir) y decodificar (leer) son destrezas recíprocas. La decodificación se internaliza cuando se ofrecen actividades táctiles y cinestésicas (codificación). Además, los estudiantes deben participar en conversaciones académicas, escribir, leer y se les debe leer diariamente en situaciones en las que puedan interactuar con contenidos intercurriculares y en donde ellos puedan elegir."}
        },
        {
            "competencyText": {"en-us": "El español, a diferencia del inglés, tiene una relación letra-sonido más cercana y claramente define los límites de las sílabas. La sílaba en español es una unidad más crítica de conciencia fonológica que en inglés debido a la consistente correspondencia fonema-grafema. Las sílabas son unidades importantes en el español debido a su fuerte efecto en el reconocimiento visual de las palabras (Carreiras et al., 1993) y a su esencial papel para predecir una lectura en español exitosa. Además, el español presenta un nivel mucho mayor de transparencia ortográfica que el inglés y no se apoya en palabras reconocibles visualmente para la decodificación. Esta transparencia ortográfica acelera el proceso de decodificación y el enfoque se dirige rápidamente a la fluidez y a la comprensión. Sin embargo, en inglés, las palabras reconocibles visualmente son utilizadas debido a la existencia de ciertas palabras que no son decodificables, como are y one. En español, los problemas de decodificación no predominan tanto como los problemas de comprensión. Estos aspectos específicos de la lengua española van a influir tanto en la metodología como en el desarrollo de la lectura."}
        },
        {
            "competencyText": {"en-us": "La complejidad del texto aumenta con un vocabulario más desafiante, con estructuras sofisticadas de las oraciones, con rasgos del texto sutiles, con un contenido cognitivo elevado y con relaciones sutiles entre las ideas (Agencia de Educación de Texas, descripciones de los niveles de desempeño de STAAR 2013). En la medida que se logre la adquisición de destrezas y conocimientos en cada una de las siete áreas, los estudiantes continuarán aplicando estándares previos con mayor profundidad en textos cada vez más complejos de múltiples géneros; a la vez, podrán convertirse en estudiantes independientes y críticos que trabajan de forma colaborativa, al mismo tiempo que utilizan continuamente sus destrezas metacognitivas."}
        },
        {
            "competencyText": {"en-us": "La investigación muestra de manera consistente que el desarrollo del lenguaje, y de la lectura y la escritura en la lengua materna de los estudiantes no sólo facilita el aprendizaje del idioma inglés, así como leerlo y escribirlo, sino que también es la base para el desarrollo cognitivo y el aprendizaje (Cummins, 2001; Thomas & Collier, 2002; Coelho, 2001). Los estudiantes bilingües emergentes (Sparrow et al., 2014; Slavin & Cheving. 2013) son aquéllos que están en el proceso de adquirir dos o más códigos lingüísticos para convertirse en personas bilingües, biletradas y biculturales. Los estudiantes bilingües emergentes son a menudo definidos por sus deficiencias aparentes (limitados en el manejo del lenguaje) (Escamilla, 2012). Sin embargo, la investigación ha mostrado que los bilingües desarrollan un sistema interdependiente único (Escamilla et al., 2007; Grosjean, 1989; Valdes and Figueroa, 1994), en el cual los idiomas se interconectan para incrementar la funcionalidad lingüística. Esta interdependencia lingüística en la adquisición del lenguaje facilita una transferencia de las habilidades de lectura y escritura del lenguaje primario (L1) al segundo lenguaje (L2) (August & Shanahan, 2006; Bialystok, 2007; Miramontes, et al., 1997). La solidez del aprendizaje a través de la instrucción formal en español determina el alcance de la transferencia al inglés (August, Calderon & Carlo, 2002; Slavin & Calderon, 2001; Garcia, 2001). Para que esta transferencia alcance su nivel máximo, se deben enseñar de forma explícita las conexiones interlingüísticas entre las dos lenguas mientras los estudiantes participan en el análisis del español y el inglés para ver sus similitudes y diferencias (Cummins, 2007). Un desarrollo sólido y continuo en la lectura y escritura en español aporta las bases y la estructura para el desarrollo de la lectura y escritura dado que existe entre los dos idiomas lo que se conoce como Dominio Común Subyacente (CUP, por sus siglas en inglés) (Cummins, 1991). En consecuencia, instrucción directa y sistemática (Genesee et al., 2005) en la secuencia apropiada de las destrezas en español, junto con instrucción temprana de lectura y escritura basada en el inglés como segundo idioma, es crucial para el éxito del estudiante. Como resultado de estar trabajando bajo dos sistemas lingüísticos, las destrezas metalingüísticas y metacognitivas de los estudiantes se fortalecen al aprender acerca de las similitudes y diferencias entre los idiomas (Escamilla et al., 2014). Hasta qué punto el inglés y el español son utilizados depende del tipo de modelo de programa bilingüe empleado (ver Código de Educación de Texas, §29.066)."}
        },
        {
            "competencyText": {"en-us": "Para los estudiantes que están aprendiendo inglés (estudiantes ELL, por sus siglas en inglés), se espera que cumplan ciertos estándares en un segundo idioma y que su desempeño en inglés impacte directamente su habilidad para cumplir estos estándares. La comprensión de un texto a través de las etapas en el aprendizaje del idioma inglés requiere de una estructura didáctica, como modificaciones textuales, traducciones, apoyo en el idioma materno, uso de cognados, resúmenes, fotografías, objetos comunes, glosarios, diccionarios bilingües y/o de sinónimos, y otras formas de apoyo comprensibles. El uso estratégico del lenguaje primario del estudiante es importante para asegurar el desarrollo lingüístico, afectivo, cognitivo y académico en inglés. Los estudiantes ELL pueden y deben ser motivados a usar lo que saben de su primer idioma para mejorar el desarrollo de su vocabulario; éste necesita estar en el contexto del discurso oral y escrito interconectado para que sea significativo."}
        },
        {
            "competencyText": {"en-us": "La investigación actual enfatiza la importancia de integrar eficazmente el aprendizaje del segundo idioma con una educación de calidad en el área de contenido para asegurar que los estudiantes ELL adquieran un dominio del lenguaje social y académico en inglés, aprendan conocimientos y destrezas, y alcancen su mayor potencial académico. La instrucción tiene que incluir los ajustes lingüísticos que corresponden con los Estándares de Desempeño del Idioma Inglés (ELPS, por sus siglas en inglés) y con los niveles de dominio del inglés del estudiante para asegurar que el dominio absoluto de los conocimientos y las destrezas en el currículum requerido sea accesible. Para una mayor comprensión de las necesidades del aprendizaje de un segundo idioma, favor de referirse a los ELPS y a las descripciones de los niveles de dominio adoptados en el Capítulo 74, subcapítulo A, de este apartado (relacionado con el currículo requerido)."}
        },
        {
            "competencyText": {"en-us": "El dominio del lenguaje oral por parte de los estudiantes juega un papel primordial para lograr el éxito escolar; su participación en actividades verbales tiene que alcanzar su nivel máximo a lo largo de los grados escolares (Kinsella, 2010). Para que ellos se conviertan en individuos pensantes y hábiles para expresarse oralmente en ciencias, estudios sociales, matemáticas, bellas artes, artes del lenguaje y lectura, así como en los programas técnicos y de estudios profesionales, tienen que tener múltiples oportunidades para practicar y aplicar el leguaje académico de cada disciplina (Fisher, Frey & Rothenberg, 2008)."}
        },
        {
            "competencyText": {"en-us": "Los enunciados que tienen la palabra “incluyendo” se refieren a contenidos que tienen que dominarse muy bien; aquéllos que tienen la expresión “tales como” tienen la intención de ser posibles ejemplos ilustrativos."}
        },
        {
            "competencyText": {"en-us": "Conocimientos y destrezas."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, discutir y pensar —lenguaje oral—. El estudiante desarrolla el lenguaje oral por medio de la actividad de escuchar, hablar y discutir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "escuche activamente y haga preguntas relevantes para entender la información y conteste preguntas usando respuestas de múltiples palabras;"}
        },
        {
            "competencyText": {"en-us": "replantee y siga instrucciones orales que impliquen acciones cortas relacionadas en una secuencia;"}
        },
        {
            "competencyText": {"en-us": "comparta información e ideas hablando de forma audible y clara usando las convenciones del lenguaje;"}
        },
        {
            "competencyText": {"en-us": "trabaje en colaboración con otros siguiendo reglas acordadas para la discusión, incluyendo tomar turnos; y"}
        },
        {
            "competencyText": {"en-us": "desarrolle la comunicación social, tal como presentarse a sí mismo con los demás, usar saludos comunes y expresar necesidades y deseos."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —inicio de la lectura y la escritura—. El estudiante desarrolla conocimiento de la estructura de las palabras a través de la conciencia fonológica, los conceptos impresos, la fonética y la morfología para comunicar, decodificar y escribir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre conciencia fonológica al:"}
        },
        {
            "competencyText": {"en-us": "identificar y producir palabras que rimen;"}
        },
        {
            "competencyText": {"en-us": "reconocer la aliteración hablada o grupos de palabras que comienzan con la misma sílaba simple o sonido inicial;"}
        },
        {
            "competencyText": {"en-us": "identificar las palabras individuales en una oración hablada;"}
        },
        {
            "competencyText": {"en-us": "identificar sílabas en palabras habladas;"}
        },
        {
            "competencyText": {"en-us": "mezclar sílabas para formar palabras multisilábicas;"}
        },
        {
            "competencyText": {"en-us": "segmentar palabras multisilábicas en sílabas;"}
        },
        {
            "competencyText": {"en-us": "identificar los sonidos iniciales y finales en palabras simples;"}
        },
        {
            "competencyText": {"en-us": "mezclar fonemas hablados para formar sílabas; y"}
        },
        {
            "competencyText": {"en-us": "manipular sílabas en una palabra multisilábica;"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique conocimiento fonético al:"}
        },
        {
            "competencyText": {"en-us": "identificar y asociar los sonidos comunes que las letras representan;"}
        },
        {
            "competencyText": {"en-us": "usar la relación letra-sonido para decodificar palabras de una y dos sílabas, y palabras multisilábicas, incluyendo CV, VC, CCV, CVC, VCV, CVCV, CCVCV y CVCCV;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con la letra “h” que es silenciosa y dígrafos formados por consonantes, tales como “ch”, “rr” y “ll”; y"}
        },
        {
            "competencyText": {"en-us": "reconocer que se forman nuevas palabras cuando las sílabas se cambian, se agregan o se borran;"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique el conocimiento ortográfico al:"}
        },
        {
            "competencyText": {"en-us": "escribir letras comunes según su sonido correspondiente; y"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con patrones silábicos comunes, tales como CV, VC, CCV, CVC, VCV, CVCV, CCVCV y CVCCV;"}
        },
        {
            "competencyText": {"en-us": "demuestre conciencia del texto impreso al:"}
        },
        {
            "competencyText": {"en-us": "identificar la portada, la contraportada y la página del título de un libro;"}
        },
        {
            "competencyText": {"en-us": "sostener un libro con el lado correcto hacia arriba, dar vuelta a las páginas correctamente y saber que la lectura se mueve de arriba hacia abajo y de izquierda a derecha, con un movimiento de regreso en el renglón siguiente;"}
        },
        {
            "competencyText": {"en-us": "reconocer que las oraciones están compuestas de palabras separadas por espacios y reconocer los límites de las palabras;"}
        },
        {
            "competencyText": {"en-us": "reconocer la diferencia entre una letra y una palabra impresa; e"}
        },
        {
            "competencyText": {"en-us": "identificar todas las letras mayúsculas y minúsculas; y"}
        },
        {
            "competencyText": {"en-us": "desarrolle la escritura al formar de manera precisa todas las letras mayúsculas y minúsculas usando la direccionalidad apropiada."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —vocabulario—. El estudiante usa el vocabulario recién adquirido de forma expresiva. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "use un recurso, tal como un diccionario pictográfico o un recurso digital, para encontrar palabras;"}
        },
        {
            "competencyText": {"en-us": "use ilustraciones y textos que el estudiante pueda leer o escuchar para aprender o clarificar el significado de las palabras; e"}
        },
        {
            "competencyText": {"en-us": "identifique y use palabras que nombren acciones; direcciones; posiciones; secuencias; categorías, tales como colores, formas y texturas; y ubicaciones."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —lectura autodirigida—. El estudiante lee textos apropiados para su nivel escolar de forma independiente. Se espera que el estudiante autoseleccione el texto e interactúe independientemente con el texto por períodos de tiempo cada vez mayores."}
        },
        {
            "competencyText": {"en-us": "Habilidades de comprensión: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante usa habilidades metacognitivas para desarrollar y profundizar la comprensión de textos cada vez más complejos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "establezca un propósito para la lectura de textos asignados y autoseleccionados con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "formule preguntas sobre el texto antes, durante y después de la lectura para profundizar la comprensión y obtener información con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "haga y confirme predicciones utilizando los rasgos y las estructuras del texto con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "cree imágenes mentales para profundizar la comprensión con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "haga conexiones relacionadas con experiencias personales, ideas de otros textos y la sociedad con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "haga inferencias y use evidencia para apoyar la comprensión con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "evalúe los detalles para determinar qué es lo más importante con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "sintetice información para crear un nuevo entendimiento con la asistencia de un adulto; y"}
        },
        {
            "competencyText": {"en-us": "revise la comprensión y haga ajustes, tales como releer, usar conocimiento previo, observar pistas visuales y formular preguntas cuando la comprensión se pierde, con la asistencia de un adulto."}
        },
        {
            "competencyText": {"en-us": "Habilidades para responder: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante responde a una variedad cada vez más desafiante de fuentes de información que lee, escucha o ve. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "describa conexiones personales respecto a una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "proporcione una respuesta oral, pictórica o escrita respecto a un texto;"}
        },
        {
            "competencyText": {"en-us": "use evidencia textual para apoyar una respuesta apropiada;"}
        },
        {
            "competencyText": {"en-us": "vuelva a contar textos de manera que mantengan su significado;"}
        },
        {
            "competencyText": {"en-us": "interactúe con las fuentes de información de manera significativa, tal como al hacer ilustraciones o al escribir; y"}
        },
        {
            "competencyText": {"en-us": "responda usando el vocabulario recién adquirido según sea apropiado."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —elementos literarios—. El estudiante reconoce y analiza elementos literarios dentro y a través del contenido cada vez más complejo de textos literarios tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "discuta tópicos y determine el tema básico usando evidencia textual con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "identifique y describa al personaje principal (personajes principales);"}
        },
        {
            "competencyText": {"en-us": "describa los elementos del desarrollo de la trama, incluyendo los eventos principales, el problema y la resolución, de textos leídos en voz alta con la asistencia de un adulto; y"}
        },
        {
            "competencyText": {"en-us": "describa el escenario."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante reconoce y analiza las características, estructuras y propósitos específicos del género dentro y a través del contenido cada vez más complejo de textos tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre conocimiento de las características distintivas de la literatura infantil más conocida, tal como cuentos populares, fábulas, cuentos de hadas y rimas infantiles;"}
        },
        {
            "competencyText": {"en-us": "discuta la rima y el ritmo en rimas infantiles y en una variedad de poemas;"}
        },
        {
            "competencyText": {"en-us": "discuta los personajes principales del drama;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características y estructuras del texto informativo, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "la idea central y la evidencia que la apoya con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "títulos y gráficas simples para obtener información; y"}
        },
        {
            "competencyText": {"en-us": "los pasos en una secuencia con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características del texto persuasivo con la asistencia de un adulto y exprese lo que el autor está tratando de persuadir al lector a pensar o hacer; y"}
        },
        {
            "competencyText": {"en-us": "reconozca las características de los textos multimodales y digitales."}
        },
        {
            "competencyText": {"en-us": "Propósito y arte del escritor: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante hace indagaciones críticas para analizar las decisiones de los autores y cómo éstas influyen y comunican significado dentro de una variedad de textos. El estudiante analiza y aplica el arte del escritor con el propósito de desarrollar sus propios productos y presentaciones. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "discuta con la asistencia de un adulto el propósito del autor al escribir textos;"}
        },
        {
            "competencyText": {"en-us": "discuta con la asistencia de un adulto cómo el uso de la estructura del texto contribuye al propósito del autor;"}
        },
        {
            "competencyText": {"en-us": "discuta con la asistencia de un adulto el uso que hace el autor de los aspectos impresos y gráficos para lograr propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "discuta con la asistencia de un adulto cómo el autor usa palabras que ayudan al lector a crear imágenes; y"}
        },
        {
            "competencyText": {"en-us": "escuche y experimente textos en primera y tercera persona."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos—proceso de escritura—. El estudiante utiliza el proceso de escritura en forma recurrente para redactar múltiples textos que sean legibles y usa las convenciones apropiadas. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "planifique generando ideas para escribir por medio de discusiones en la clase y de dibujos;"}
        },
        {
            "competencyText": {"en-us": "desarrolle borradores en forma oral, pictórica o escrita organizando las ideas;"}
        },
        {
            "competencyText": {"en-us": "revise borradores agregando detalles en imágenes o palabras;"}
        },
        {
            "competencyText": {"en-us": "edite borradores con la asistencia de un adulto usando las convenciones comunes de la lengua española, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "oraciones completas;"}
        },
        {
            "competencyText": {"en-us": "verbos, incluyendo la diferencia entre ser y estar;"}
        },
        {
            "competencyText": {"en-us": "sustantivos singulares y plurales, incluyendo los artículos específicos de acuerdo al género;"}
        },
        {
            "competencyText": {"en-us": "adjetivos, incluyendo artículos;"}
        },
        {
            "competencyText": {"en-us": "preposiciones;"}
        },
        {
            "competencyText": {"en-us": "pronombres, incluyendo pronombres personales, y la diferencia en el uso del pronombre personal formal usted y el pronombre informal tú;"}
        },
        {
            "competencyText": {"en-us": "uso de mayúscula en la primera letra de una oración y en los nombres;"}
        },
        {
            "competencyText": {"en-us": "signos de puntuación al final de las oraciones declarativas; y"}
        },
        {
            "competencyText": {"en-us": "escritura correcta de las palabras con patrones ortográficos y reglas ortográficas apropiados para el nivel del grado escolar; y"}
        },
        {
            "competencyText": {"en-us": "comparta la escritura."}
        },
        {
            "competencyText": {"en-us": "Indagación e investigación: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante se involucra en procesos de indagación a corto plazo y de forma recurrente y continua para una variedad de propósitos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "formule preguntas para la indagación formal e informal con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "elabore y siga un plan de investigación con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "recopile información de una variedad de fuentes de información con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "demuestre comprensión de la información recopilada con la asistencia de un adulto; y"}
        },
        {
            "competencyText": {"en-us": "utilice un modo apropiado de entrega, ya sea escrito, oral o multimodal, para presentar los resultados."}
        },
        {
            "competencyText": {"en-us": "Artes del Lenguaje y Lectura en español, 1er grado, adoptado en 2017."}
        },
        {
            "competencyText": {"en-us": "Introducción."}
        },
        {
            "competencyText": {"en-us": "El currículo Conocimientos y Destrezas Esenciales de Texas (TEKS, por sus siglas en inglés) en español para artes del lenguaje y lectura refleja los estándares de artes del lenguaje que son auténticos al idioma español, así como a la lectura y escritura en español; éste no es una traducción ni una modificación del currículo TEKS de artes del lenguaje en inglés. El currículo TEKS de artes del lenguaje y lectura en español incluye la interrelación natural de escuchar, hablar, leer, escribir y pensar a partir de siete áreas integradas: desarrollo y apoyo de las destrezas fundamentales del lenguaje, comprensión, habilidades para responder, múltiples géneros, propósito y arte del escritor, composición, e indagación e investigación. Las áreas se enfocan en la capacidad oral académica (dominio en la expresión y comprensión oral), en la lectura auténtica y en la escritura reflexiva para asegurar un estado de Texas alfabetizado. Las áreas están integradas y son progresivas para que los estudiantes continúen desarrollando conocimientos y destrezas con un grado de complejidad y de variantes cada vez mayor que les permita pensar críticamente y adaptarse a la naturaleza siempre evolutiva del lenguaje, así como de la lectura y escritura."}
        },
        {
            "competencyText": {"en-us": "Las siete áreas sobre los conocimientos y las destrezas esenciales para artes del lenguaje y lectura en español están pensadas para ser integradas con propósitos de instrucción y son recurrentes por naturaleza. Las áreas incluyen los cuatro componentes del lenguaje (escuchar, hablar, leer y escribir) y su aplicación para acelerar la adquisición de las destrezas de lenguaje, de tal manera que los estudiantes desarrollen niveles óptimos de desempeño lingüístico en los ámbitos social y académico. Aunque algunas áreas pudieran necesitar mayor tiempo de instrucción, cada área es de igual valor, pueden presentarse sin seguir un orden determinado y deben ser incorporadas a lo largo del año. Es importante señalar que codificar (escribir) y decodificar (leer) son destrezas recíprocas. La decodificación se internaliza cuando se ofrecen actividades táctiles y cinestésicas (codificación). Además, los estudiantes deben participar en conversaciones académicas, escribir, leer y se les debe leer diariamente en situaciones en las que puedan interactuar con contenidos intercurriculares y en donde ellos puedan elegir."}
        },
        {
            "competencyText": {"en-us": "El español, a diferencia del inglés, tiene una relación letra-sonido más cercana y claramente define los límites de las sílabas. La sílaba en español es una unidad más crítica de conciencia fonológica que en inglés debido a la consistente correspondencia fonema-grafema. Las sílabas son unidades importantes en el español debido a su fuerte efecto en el reconocimiento visual de las palabras (Carreiras et al., 1993) y a su esencial papel para predecir una lectura en español exitosa. Además, el español presenta un nivel mucho mayor de transparencia ortográfica que el inglés y no se apoya en palabras reconocibles visualmente para la decodificación. Esta transparencia ortográfica acelera el proceso de decodificación y el enfoque se dirige rápidamente a la fluidez y a la comprensión. Sin embargo, en inglés, las palabras reconocibles visualmente son utilizadas debido a la existencia de ciertas palabras que no son decodificables, como are y one. En español, los problemas de decodificación no predominan tanto como los problemas de comprensión. Estos aspectos específicos de la lengua española van a influir tanto en la metodología como en el desarrollo de la lectura."}
        },
        {
            "competencyText": {"en-us": "La complejidad del texto aumenta con un vocabulario más desafiante, con estructuras sofisticadas de las oraciones, con rasgos del texto sutiles, con un contenido cognitivo elevado y con relaciones sutiles entre las ideas (Agencia de Educación de Texas, descripciones de los niveles de desempeño de STAAR 2013). En la medida que se logre la adquisición de destrezas y conocimientos en cada una de las siete áreas, los estudiantes continuarán aplicando estándares previos con mayor profundidad en textos cada vez más complejos de múltiples géneros; a la vez, podrán convertirse en estudiantes independientes y críticos que trabajan de forma colaborativa, al mismo tiempo que utilizan continuamente sus destrezas metacognitivas."}
        },
        {
            "competencyText": {"en-us": "La investigación muestra de manera consistente que el desarrollo del lenguaje, y de la lectura y la escritura en la lengua materna de los estudiantes no sólo facilita el aprendizaje del idioma inglés, así como leerlo y escribirlo, sino que también es la base para el desarrollo cognitivo y el aprendizaje (Cummins, 2001; Thomas & Collier, 2002; Coelho, 2001). Los estudiantes bilingües emergentes (Sparrow et al., 2014; Slavin & Cheving. 2013) son aquéllos que están en el proceso de adquirir dos o más códigos lingüísticos para convertirse en personas bilingües, biletradas y biculturales. Los estudiantes bilingües emergentes son a menudo definidos por sus deficiencias aparentes (limitados en el manejo del lenguaje) (Escamilla, 2012). Sin embargo, la investigación ha mostrado que los bilingües desarrollan un sistema interdependiente único (Escamilla et al., 2007; Grosjean, 1989; Valdes and Figueroa, 1994), en el cual los idiomas se interconectan para incrementar la funcionalidad lingüística. Esta interdependencia lingüística en la adquisición del lenguaje facilita una transferencia de las habilidades de lectura y escritura del lenguaje primario (L1) al segundo lenguaje (L2) (August & Shanahan, 2006; Bialystok, 2007; Miramontes, et al., 1997). La solidez del aprendizaje a través de la instrucción formal en español determina el alcance de la transferencia al inglés (August, Calderon & Carlo, 2002; Slavin & Calderon, 2001; Garcia, 2001). Para que esta transferencia alcance su nivel máximo, se deben enseñar de forma explícita las conexiones interlingüísticas entre las dos lenguas mientras los estudiantes participan en el análisis del español y el inglés para ver sus similitudes y diferencias (Cummins, 2007). Un desarrollo sólido y continuo en la lectura y escritura en español aporta las bases y la estructura para el desarrollo de la lectura y escritura dado que existe entre los dos idiomas lo que se conoce como Dominio Común Subyacente (CUP, por sus siglas en inglés) (Cummins, 1991). En consecuencia, instrucción directa y sistemática (Genesee et al., 2005) en la secuencia apropiada de las destrezas en español, junto con instrucción temprana de lectura y escritura basada en el inglés como segundo idioma, es crucial para el éxito del estudiante. Como resultado de estar trabajando bajo dos sistemas lingüísticos, las destrezas metalingüísticas y metacognitivas de los estudiantes se fortalecen al aprender acerca de las similitudes y diferencias entre los idiomas (Escamilla et al., 2014). Hasta qué punto el inglés y el español son utilizados depende del tipo de modelo de programa bilingüe empleado (ver Código de Educación de Texas, §29.066)."}
        },
        {
            "competencyText": {"en-us": "Para los estudiantes que están aprendiendo inglés (estudiantes ELL, por sus siglas en inglés), se espera que cumplan ciertos estándares en un segundo idioma y que su desempeño en inglés impacte directamente su habilidad para cumplir estos estándares. La comprensión de un texto a través de las etapas en el aprendizaje del idioma inglés requiere de una estructura didáctica, como modificaciones textuales, traducciones, apoyo en el idioma materno, uso de cognados, resúmenes, fotografías, objetos comunes, glosarios, diccionarios bilingües y/o de sinónimos, y otras formas de apoyo comprensibles. El uso estratégico del lenguaje primario del estudiante es importante para asegurar el desarrollo lingüístico, afectivo, cognitivo y académico en inglés. Los estudiantes ELL pueden y deben ser motivados a usar lo que saben de su primer idioma para mejorar el desarrollo de su vocabulario; éste necesita estar en el contexto del discurso oral y escrito interconectado para que sea significativo."}
        },
        {
            "competencyText": {"en-us": "La investigación actual enfatiza la importancia de integrar eficazmente el aprendizaje del segundo idioma con una educación de calidad en el área de contenido para asegurar que los estudiantes ELL adquieran un dominio del lenguaje social y académico en inglés, aprendan conocimientos y destrezas, y alcancen su mayor potencial académico. La instrucción tiene que incluir los ajustes lingüísticos que corresponden con los Estándares de Desempeño del Idioma Inglés (ELPS, por sus siglas en inglés) y con los niveles de dominio del inglés del estudiante para asegurar que el dominio absoluto de los conocimientos y las destrezas en el currículum requerido sea accesible. Para una mayor comprensión de las necesidades del aprendizaje de un segundo idioma, favor de referirse a los ELPS y a las descripciones de los niveles de dominio adoptados en el Capítulo 74, subcapítulo A, de este apartado (relacionado con el currículo requerido)."}
        },
        {
            "competencyText": {"en-us": "El dominio del lenguaje oral por parte de los estudiantes juega un papel primordial para lograr el éxito escolar; su participación en actividades verbales tiene que alcanzar su nivel máximo a lo largo de los grados escolares (Kinsella, 2010). Para que ellos se conviertan en individuos pensantes y hábiles para expresarse oralmente en ciencias, estudios sociales, matemáticas, bellas artes, artes del lenguaje y lectura, así como en los programas técnicos y de estudios profesionales, tienen que tener múltiples oportunidades para practicar y aplicar el leguaje académico de cada disciplina (Fisher, Frey & Rothenberg, 2008)."}
        },
        {
            "competencyText": {"en-us": "Los enunciados que tienen la palabra “incluyendo” se refieren a contenidos que tienen que dominarse muy bien; aquéllos que tienen la expresión “tales como” tienen la intención de ser posibles ejemplos ilustrativos."}
        },
        {
            "competencyText": {"en-us": "Conocimientos y destrezas."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, discutir y pensar—lenguaje oral—. El estudiante desarrolla el lenguaje oral por medio de la actividad de escuchar, hablar y discutir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "escuche activamente, haga preguntas relevantes para clarificar información y conteste preguntas usando respuestas de múltiples palabras;"}
        },
        {
            "competencyText": {"en-us": "siga, replantee y dé instrucciones orales que impliquen acciones cortas relacionadas en una secuencia;"}
        },
        {
            "competencyText": {"en-us": "comparta información e ideas que se enfoquen en el tópico que está en discusión, hablando claramente a una velocidad apropiada y usando las convenciones del lenguaje;"}
        },
        {
            "competencyText": {"en-us": "trabaje en colaboración con otros siguiendo reglas acordadas para la discusión, incluyendo escuchar a los demás, hablar cuando se le solicite y contribuir en forma apropiada; y"}
        },
        {
            "competencyText": {"en-us": "desarrolle la comunicación social, tal como presentarse a sí mismo y a otros, compartir experiencias con un compañero de clase y expresar necesidades y sentimientos."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —inicio de la lectura y la escritura—. El estudiante desarrolla conocimiento de la estructura de las palabras a través de la conciencia fonológica, los conceptos impresos, la fonética y la morfología para comunicar, decodificar y escribir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre conciencia fonológica al:"}
        },
        {
            "competencyText": {"en-us": "producir una serie de palabras que rimen;"}
        },
        {
            "competencyText": {"en-us": "reconocer la aliteración hablada o grupos de palabras que comienzan con la misma sílaba simple o sonido inicial;"}
        },
        {
            "competencyText": {"en-us": "reconocer el cambio en la palabra hablada cuando se agrega, se cambia o se quita una sílaba específica;"}
        },
        {
            "competencyText": {"en-us": "segmentar palabras habladas en sílabas individuales;"}
        },
        {
            "competencyText": {"en-us": "mezclar sílabas habladas complejas, incluyendo sílabas trabadas, para formar palabras multisilábicas;"}
        },
        {
            "competencyText": {"en-us": "segmentar palabras habladas en sílabas, incluyendo palabras con sílabas trabadas; y"}
        },
        {
            "competencyText": {"en-us": "manipular sílabas en las palabras;"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique conocimiento fonético al:"}
        },
        {
            "competencyText": {"en-us": "identificar y asociar sonidos con letras individuales;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con sílabas trabadas, tales como “bla”, “bra” y “gla”; dígrafos; y palabras con múltiples patrones de ortografía de sonido, tales como la “c”, “k” y la “q”, y la “s”, “z”, la “c” suave y la “x”;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con la letra “h” que es silenciosa y palabras que usan las sílabas “que”, “qui”, “gue”, “gui”, “güe” y “güi”;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con diptongos, tales como “ai”, “au” y “ei”;"}
        },
        {
            "competencyText": {"en-us": "decodificar contracciones, tales como “al” y “del”;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras que tengan de tres a cuatro sílabas;"}
        },
        {
            "competencyText": {"en-us": "usar el conocimiento de palabras base para decodificar palabras compuestas comunes; y"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con prefijos y sufijos comunes;"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique el conocimiento ortográfico al:"}
        },
        {
            "competencyText": {"en-us": "escribir letras comunes según su sonido correspondiente;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con patrones comunes, tales como CV, VC, CCV, CVC, VCV, CVCV, CCVCV y CVCCV;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con “h” silenciosa; dígrafos consonánticos, tales como “ch”, “rr” y “ll”, y sílabas trabadas, tales como “bla”, “bra”, “gla” y “gra”;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras multisilábicas, incluyendo palabras con “que”, “qui”, “gue”, “gui”, “güe” y “güi”;"}
        },
        {
            "competencyText": {"en-us": "escribir contracciones, tales como “al” y “del”;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con diptongos, tales como “ai”, “au” y “ie” en quie-ro, na-die y ra-dio, y con hiatos, tal como le-er y rí-o; y"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con prefijos y sufijos comunes;"}
        },
        {
            "competencyText": {"en-us": "demuestre conciencia del texto impreso identificando la información que proporcionan las diferentes partes de un libro;"}
        },
        {
            "competencyText": {"en-us": "ordene alfabéticamente una serie de palabras siguiendo la primera o la segunda letra y use un diccionario para buscar palabras; y"}
        },
        {
            "competencyText": {"en-us": "desarrolle la escritura escribiendo palabras, oraciones y respuestas legibles dejando espacios apropiados entre palabras."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —vocabulario—. El estudiante usa el vocabulario recién adquirido de forma expresiva. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "use un recurso, tal como un diccionario pictográfico o un recurso digital, para encontrar palabras;"}
        },
        {
            "competencyText": {"en-us": "use ilustraciones y textos que el estudiante pueda leer o escuchar para aprender o clarificar el significado de las palabras;"}
        },
        {
            "competencyText": {"en-us": "identifique el significado de las palabras con afijos, incluyendo -s, -es y -or; e"}
        },
        {
            "competencyText": {"en-us": "identifique y use palabras que nombren acciones, direcciones, posiciones, secuencias, categorías y ubicaciones."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —fluidez—. El estudiante lee textos al nivel del grado escolar con fluidez y los comprende. Se espera que el estudiante use la fluidez apropiada (velocidad, precisión y prosodia) cuando lee un texto al nivel de su grado escolar."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —lectura autodirigida—. El estudiante lee textos apropiados para su nivel escolar de forma independiente. Se espera que el estudiante autoseleccione el texto e interactúe independientemente con el texto por períodos de tiempo cada vez mayores."}
        },
        {
            "competencyText": {"en-us": "Habilidades de comprensión: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante usa habilidades metacognitivas para desarrollar y profundizar la comprensión de textos cada vez más complejos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "establezca un propósito para la lectura de textos asignados y autoseleccionados con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "formule preguntas sobre el texto antes, durante y después de la lectura para profundizar la comprensión y obtener información con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "haga y corrija o confirme predicciones utilizando los rasgos del texto, las características del género y las estructuras con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "cree imágenes mentales para profundizar la comprensión con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "haga conexiones relacionadas con experiencias personales, ideas de otros textos y la sociedad con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "haga inferencias y use evidencia para apoyar la comprensión con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "evalúe los detalles para determinar qué es lo más importante con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "sintetice información para crear un nuevo entendimiento con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "revise la comprensión y haga ajustes, tales como releer, usar conocimiento previo, observar pistas visuales y formular preguntas cuando la comprensión se pierde."}
        },
        {
            "competencyText": {"en-us": "Habilidades para responder: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante responde a una variedad cada vez más desafiante de fuentes de información que lee, escucha o ve. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "describa conexiones personales respecto a una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "escriba comentarios breves sobre textos literarios o informativos;"}
        },
        {
            "competencyText": {"en-us": "use evidencia textual para apoyar una respuesta apropiada;"}
        },
        {
            "competencyText": {"en-us": "vuelva a contar textos de manera que mantengan su significado;"}
        },
        {
            "competencyText": {"en-us": "interactúe con las fuentes de información de manera significativa, tal como al hacer ilustraciones o al escribir; y"}
        },
        {
            "competencyText": {"en-us": "responda usando el vocabulario recién adquirido según sea apropiado."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —elementos literarios—. El estudiante reconoce y analiza elementos literarios dentro y a través del contenido cada vez más complejo de textos literarios tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "discuta tópicos y determine el tema usando evidencia textual con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "describa al personaje principal (personajes principales) y el motivo (motivos) de sus acciones;"}
        },
        {
            "competencyText": {"en-us": "describa los elementos de la trama, incluyendo los eventos principales, el problema y la resolución, de textos leídos en voz alta y de forma independiente; y"}
        },
        {
            "competencyText": {"en-us": "describa el escenario."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante reconoce y analiza las características, estructuras y propósitos específicos del género dentro y a través del contenido cada vez más complejo de textos tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre conocimiento de las características distintivas de la literatura infantil más conocida, tal como cuentos populares, fábulas, cuentos de hadas y rimas infantiles;"}
        },
        {
            "competencyText": {"en-us": "discuta la rima, el ritmo, la repetición y la aliteración en una variedad de poemas;"}
        },
        {
            "competencyText": {"en-us": "discuta los elementos del drama, tales como los personajes y el escenario;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características y estructuras del texto informativo, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "la idea central y la evidencia que la apoya con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "rasgos y gráficas simples para localizar u obtener información; y"}
        },
        {
            "competencyText": {"en-us": "patrones organizacionales, tales como el orden cronológico y la descripción con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características del texto persuasivo con la asistencia de un adulto y exprese lo que el autor está tratando de persuadir al lector a pensar o hacer; y"}
        },
        {
            "competencyText": {"en-us": "reconozca las características de los textos multimodales y digitales."}
        },
        {
            "competencyText": {"en-us": "Propósito y arte del escritor: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante hace indagaciones críticas para analizar las decisiones de los autores y cómo éstas influyen y comunican significado dentro de una variedad de textos. El estudiante analiza y aplica el arte del escritor con el propósito de desarrollar sus propios productos y presentaciones. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "discuta el propósito del autor al escribir un texto;"}
        },
        {
            "competencyText": {"en-us": "discuta cómo el uso de la estructura del texto contribuye al propósito del autor;"}
        },
        {
            "competencyText": {"en-us": "discuta con la asistencia de un adulto el uso que hace el autor de los aspectos impresos y gráficos para lograr propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "discuta cómo el autor usa palabras que ayudan al lector a crear imágenes; y"}
        },
        {
            "competencyText": {"en-us": "escuche y experimente textos en primera y tercera persona."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —proceso de escritura—. El estudiante utiliza el proceso de escritura en forma recurrente para redactar múltiples textos que sean legibles y usa las convenciones apropiadas. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "planifique un primer borrador generando ideas para escribir, tales como dibujar y hacer una lluvia de ideas;"}
        },
        {
            "competencyText": {"en-us": "desarrolle borradores en forma oral, pictórica o escrita al:"}
        },
        {
            "competencyText": {"en-us": "organizar un texto siguiendo una estructura; y"}
        },
        {
            "competencyText": {"en-us": "desarrollar una idea con detalles específicos y relevantes;"}
        },
        {
            "competencyText": {"en-us": "revise borradores agregando detalles en imágenes o palabras;"}
        },
        {
            "competencyText": {"en-us": "edite borradores usando las convenciones comunes de la lengua española, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "oraciones completas en donde haya concordancia entre sujeto y verbo;"}
        },
        {
            "competencyText": {"en-us": "conjugaciones de los verbos en los tiempos pasado y presente, incluyendo la diferencia entre ser y estar;"}
        },
        {
            "competencyText": {"en-us": "sustantivos singulares, plurales, comunes y propios, incluyendo los artículos específicos de acuerdo al género;"}
        },
        {
            "competencyText": {"en-us": "adjetivos, incluyendo artículos;"}
        },
        {
            "competencyText": {"en-us": "adverbios que trasmiten tiempo;"}
        },
        {
            "competencyText": {"en-us": "preposiciones;"}
        },
        {
            "competencyText": {"en-us": "pronombres, incluyendo el uso de pronombres personales y posesivos, y la diferencia en el uso del pronombre formal usted y el pronombre informal tú;"}
        },
        {
            "competencyText": {"en-us": "letra mayúscula al comienzo de las oraciones;"}
        },
        {
            "competencyText": {"en-us": "signos de puntuación al final de las oraciones declarativas, y al comienzo y al final de las oraciones exclamativas e interrogativas; y"}
        },
        {
            "competencyText": {"en-us": "escritura correcta de las palabras con patrones ortográficos y reglas ortográficas apropiados para el nivel del grado escolar con la asistencia de un adulto; y"}
        },
        {
            "competencyText": {"en-us": "publique y comparta la escritura."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante usa el arte del escritor y las características del género para redactar múltiples textos que sean significativos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "dicte o redacte textos literarios, incluyendo narraciones personales y poesía;"}
        },
        {
            "competencyText": {"en-us": "dicte o redacte textos informativos, incluyendo textos de procedimientos; y"}
        },
        {
            "competencyText": {"en-us": "dicte o redacte correspondencia, tal como notas de agradecimiento o cartas."}
        },
        {
            "competencyText": {"en-us": "Indagación e investigación: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante se involucra en procesos de indagación a corto plazo y de forma recurrente y continua para una variedad de propósitos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "formule preguntas para la indagación formal e informal con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "elabore y siga un plan de investigación con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "identifique y recopile fuentes de información y datos relevantes para responder preguntas con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "demuestre comprensión de la información recopilada con la asistencia de un adulto; y"}
        },
        {
            "competencyText": {"en-us": "utilice un modo apropiado de entrega, ya sea escrito, oral o multimodal, para presentar los resultados."}
        },
        {
            "competencyText": {"en-us": "Artes del Lenguaje y Lectura en español, 2o grado, adoptado en 2017."}
        },
        {
            "competencyText": {"en-us": "Introducción."}
        },
        {
            "competencyText": {"en-us": "El currículo Conocimientos y Destrezas Esenciales de Texas (TEKS, por sus siglas en inglés) en español para artes del lenguaje y lectura refleja los estándares de artes del lenguaje que son auténticos al idioma español, así como a la lectura y escritura en español; éste no es una traducción ni una modificación del currículo TEKS de artes del lenguaje en inglés. El currículo TEKS de artes del lenguaje y lectura en español incluye la interrelación natural de escuchar, hablar, leer, escribir y pensar a partir de siete áreas integradas: desarrollo y apoyo de las destrezas fundamentales del lenguaje, comprensión, habilidades para responder, múltiples géneros, propósito y arte del escritor, composición, e indagación e investigación. Las áreas se enfocan en la capacidad oral académica (dominio en la expresión y comprensión oral), en la lectura auténtica y en la escritura reflexiva para asegurar un estado de Texas alfabetizado. Las áreas están integradas y son progresivas para que los estudiantes continúen desarrollando conocimientos y destrezas con un grado de complejidad y de variantes cada vez mayor que les permita pensar críticamente y adaptarse a la naturaleza siempre evolutiva del lenguaje, así como de la lectura y escritura."}
        },
        {
            "competencyText": {"en-us": "Las siete áreas sobre los conocimientos y las destrezas esenciales para artes del lenguaje y lectura en español están pensadas para ser integradas con propósitos de instrucción y son recurrentes por naturaleza. Las áreas incluyen los cuatro componentes del lenguaje (escuchar, hablar, leer y escribir) y su aplicación para acelerar la adquisición de las destrezas de lenguaje, de tal manera que los estudiantes desarrollen niveles óptimos de desempeño lingüístico en los ámbitos social y académico. Aunque algunas áreas pudieran necesitar mayor tiempo de instrucción, cada área es de igual valor, pueden presentarse sin seguir un orden determinado y deben ser incorporadas a lo largo del año. Es importante señalar que codificar (escribir) y decodificar (leer) son destrezas recíprocas. La decodificación se internaliza cuando se ofrecen actividades táctiles y cinestésicas (codificación). Además, los estudiantes deben participar en conversaciones académicas, escribir, leer y se les debe leer diariamente en situaciones en las que puedan interactuar con contenidos intercurriculares y en donde ellos puedan elegir."}
        },
        {
            "competencyText": {"en-us": "El español, a diferencia del inglés, tiene una relación letra-sonido más cercana y claramente define los límites de las sílabas. La sílaba en español es una unidad más crítica de conciencia fonológica que en inglés debido a la consistente correspondencia fonema-grafema. Las sílabas son unidades importantes en el español debido a su fuerte efecto en el reconocimiento visual de las palabras (Carreiras et al., 1993) y a su esencial papel para predecir una lectura en español exitosa. Además, el español presenta un nivel mucho mayor de transparencia ortográfica que el inglés y no se apoya en palabras reconocibles visualmente para la decodificación. Esta transparencia ortográfica acelera el proceso de decodificación y el enfoque se dirige rápidamente a la fluidez y a la comprensión. Sin embargo, en inglés, las palabras reconocibles visualmente son utilizadas debido a la existencia de ciertas palabras que no son decodificables, como are y one. En español, los problemas de decodificación no predominan tanto como los problemas de comprensión. Estos aspectos específicos de la lengua española van a influir tanto en la metodología como en el desarrollo de la lectura."}
        },
        {
            "competencyText": {"en-us": "La complejidad del texto aumenta con un vocabulario más desafiante, con estructuras sofisticadas de las oraciones, con rasgos del texto sutiles, con un contenido cognitivo elevado y con relaciones sutiles entre las ideas (Agencia de Educación de Texas, descripciones de los niveles de desempeño de STAAR 2013). En la medida que se logre la adquisición de destrezas y conocimientos en cada una de las siete áreas, los estudiantes continuarán aplicando estándares previos con mayor profundidad en textos cada vez más complejos de múltiples géneros; a la vez, podrán convertirse en estudiantes independientes y críticos que trabajan de forma colaborativa, al mismo tiempo que utilizan continuamente sus destrezas metacognitivas."}
        },
        {
            "competencyText": {"en-us": "La investigación muestra de manera consistente que el desarrollo del lenguaje, y de la lectura y la escritura en la lengua materna de los estudiantes no sólo facilita el aprendizaje del idioma inglés, así como leerlo y escribirlo, sino que también es la base para el desarrollo cognitivo y el aprendizaje (Cummins, 2001; Thomas & Collier, 2002; Coelho, 2001). Los estudiantes bilingües emergentes (Sparrow et al., 2014; Slavin & Cheving. 2013) son aquéllos que están en el proceso de adquirir dos o más códigos lingüísticos para convertirse en personas bilingües, biletradas y biculturales. Los estudiantes bilingües emergentes son a menudo definidos por sus deficiencias aparentes (limitados en el manejo del lenguaje) (Escamilla, 2012). Sin embargo, la investigación ha mostrado que los bilingües desarrollan un sistema interdependiente único (Escamilla et al., 2007; Grosjean, 1989; Valdes and Figueroa, 1994), en el cual los idiomas se interconectan para incrementar la funcionalidad lingüística. Esta interdependencia lingüística en la adquisición del lenguaje facilita una transferencia de las habilidades de lectura y escritura del lenguaje primario (L1) al segundo lenguaje (L2) (August & Shanahan, 2006; Bialystok, 2007; Miramontes, et al., 1997). La solidez del aprendizaje a través de la instrucción formal en español determina el alcance de la transferencia al inglés (August, Calderon & Carlo, 2002; Slavin & Calderon, 2001; Garcia, 2001). Para que esta transferencia alcance su nivel máximo, se deben enseñar de forma explícita las conexiones interlingüísticas entre las dos lenguas mientras los estudiantes participan en el análisis del español y el inglés para ver sus similitudes y diferencias (Cummins, 2007). Un desarrollo sólido y continuo en la lectura y escritura en español aporta las bases y la estructura para el desarrollo de la lectura y escritura dado que existe entre los dos idiomas lo que se conoce como Dominio Común Subyacente (CUP, por sus siglas en inglés) (Cummins, 1991). En consecuencia, instrucción directa y sistemática (Genesee et al., 2005) en la secuencia apropiada de las destrezas en español, junto con instrucción temprana de lectura y escritura basada en el inglés como segundo idioma, es crucial para el éxito del estudiante. Como resultado de estar trabajando bajo dos sistemas lingüísticos, las destrezas metalingüísticas y metacognitivas de los estudiantes se fortalecen al aprender acerca de las similitudes y diferencias entre los idiomas (Escamilla et al., 2014). Hasta qué punto el inglés y el español son utilizados depende del tipo de modelo de programa bilingüe empleado (ver Código de Educación de Texas, §29.066)."}
        },
        {
            "competencyText": {"en-us": "Para los estudiantes que están aprendiendo inglés (estudiantes ELL, por sus siglas en inglés), se espera que cumplan ciertos estándares en un segundo idioma y que su desempeño en inglés impacte directamente su habilidad para cumplir estos estándares. La comprensión de un texto a través de las etapas en el aprendizaje del idioma inglés requiere de una estructura didáctica, como modificaciones textuales, traducciones, apoyo en el idioma materno, uso de cognados, resúmenes, fotografías, objetos comunes, glosarios, diccionarios bilingües y/o de sinónimos, y otras formas de apoyo comprensibles. El uso estratégico del lenguaje primario del estudiante es importante para asegurar el desarrollo lingüístico, afectivo, cognitivo y académico en inglés. Los estudiantes ELL pueden y deben ser motivados a usar lo que saben de su primer idioma para mejorar el desarrollo de su vocabulario; éste necesita estar en el contexto del discurso oral y escrito interconectado para que sea significativo."}
        },
        {
            "competencyText": {"en-us": "La investigación actual enfatiza la importancia de integrar eficazmente el aprendizaje del segundo idioma con una educación de calidad en el área de contenido para asegurar que los estudiantes ELL adquieran un dominio del lenguaje social y académico en inglés, aprendan conocimientos y destrezas, y alcancen su mayor potencial académico. La instrucción tiene que incluir los ajustes lingüísticos que corresponden con los Estándares de Desempeño del Idioma Inglés (ELPS, por sus siglas en inglés) y con los niveles de dominio del inglés del estudiante para asegurar que el dominio absoluto de los conocimientos y las destrezas en el currículum requerido sea accesible. Para una mayor comprensión de las necesidades del aprendizaje de un segundo idioma, favor de referirse a los ELPS y a las descripciones de los niveles de dominio adoptados en el Capítulo 74, subcapítulo A, de este apartado (relacionado con el currículo requerido)."}
        },
        {
            "competencyText": {"en-us": "El dominio del lenguaje oral por parte de los estudiantes juega un papel primordial para lograr el éxito escolar; su participación en actividades verbales tiene que alcanzar su nivel máximo a lo largo de los grados escolares (Kinsella, 2010). Para que ellos se conviertan en individuos pensantes y hábiles para expresarse oralmente en ciencias, estudios sociales, matemáticas, bellas artes, artes del lenguaje y lectura, así como en los programas técnicos y de estudios profesionales, tienen que tener múltiples oportunidades para practicar y aplicar el leguaje académico de cada disciplina (Fisher, Frey & Rothenberg, 2008)."}
        },
        {
            "competencyText": {"en-us": "Los enunciados que tienen la palabra “incluyendo” se refieren a contenidos que tienen que dominarse muy bien; aquéllos que tienen la expresión “tales como” tienen la intención de ser posibles ejemplos ilustrativos."}
        },
        {
            "competencyText": {"en-us": "Conocimientos y destrezas."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, discutir y pensar —lenguaje oral—. El estudiante desarrolla el lenguaje oral por medio de la actividad de escuchar, hablar y discutir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "escuche activamente, haga preguntas relevantes para clarificar información y conteste preguntas usando respuestas de múltiples palabras;"}
        },
        {
            "competencyText": {"en-us": "siga, replantee y dé instrucciones orales que impliquen acciones cortas relacionadas en una secuencia;"}
        },
        {
            "competencyText": {"en-us": "comparta información e ideas que se enfoquen en el tópico que está en discusión, hablando claramente a una velocidad apropiada y usando las convenciones del lenguaje;"}
        },
        {
            "competencyText": {"en-us": "trabaje en colaboración con otros siguiendo reglas acordadas para la discusión, incluyendo escuchar a los demás, hablar cuando se le solicite, contribuir en forma apropiada y desarrollar sus ideas con base en las de los demás; y"}
        },
        {
            "competencyText": {"en-us": "desarrolle la comunicación social, tal como diferenciar entre preguntar y decir."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —inicio de la lectura y la escritura—. El estudiante desarrolla conocimiento de la estructura de las palabras a través de la conciencia fonológica, los conceptos impresos, la fonética y la morfología para comunicar, decodificar y escribir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique conocimiento fonético al:"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras multisilábicas;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con múltiples patrones audibles de ortografía, tales como la “c”, “k” y la “q”; la “s”, “z” y la “c” suave, y la “x”;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con la letra “h” que es silenciosa y palabras que usan las sílabas “que”, “qui”, “gue”, “gui”, “güe” y “güi”;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con diptongos e hiatos;"}
        },
        {
            "competencyText": {"en-us": "decodificar abreviaturas comunes; y"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con prefijos y sufijos;"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique el conocimiento ortográfico al:"}
        },
        {
            "competencyText": {"en-us": "escribir palabras multisilábicas;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con diptongos e hiatos;"}
        },
        {
            "competencyText": {"en-us": "escribir abreviaturas comunes;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con prefijos y sufijos; y"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con la letra “h” que es silenciosa y palabras que usan las sílabas “que”, “qui”, “gue”, “gui”, “güe” y “güi”;"}
        },
        {
            "competencyText": {"en-us": "ordene alfabéticamente una serie de palabras y use un diccionario o glosario para buscar palabras; y"}
        },
        {
            "competencyText": {"en-us": "desarrolle la caligrafía formando con precisión todas las letras cursivas usando los trazos apropiados al conectar las letras."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —vocabulario—. El estudiante usa el vocabulario recién adquirido de forma expresiva. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "utilice recursos impresos o digitales para determinar el significado y la pronunciación de palabras desconocidas;"}
        },
        {
            "competencyText": {"en-us": "utilice el contexto dentro y fuera de la oración para determinar el significado de palabras desconocidas;"}
        },
        {
            "competencyText": {"en-us": "utilice afijos, incluyendo re-, pre-, -ción e ísimo/ísima para determinar el significado de las palabras y posteriormente utilice las palabras recién aprendidas;"}
        },
        {
            "competencyText": {"en-us": "identifique, use y explique el significado de antónimos, sinónimos, modismos y homógrafos en contexto; y"}
        },
        {
            "competencyText": {"en-us": "diferencie y use homógrafos, homófonos y términos que comúnmente se confunden, tales como porque/porqué/por qué/por que, sino/si no y también/tan bien."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —fluidez—. El estudiante lee textos al nivel del grado escolar con fluidez y los comprende. Se espera que el estudiante use la fluidez apropiada (velocidad, precisión y prosodia) cuando lee un texto al nivel de su grado escolar."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —lectura autodirigida—. El estudiante lee textos apropiados para su nivel escolar de forma independiente. Se espera que el estudiante autoseleccione el texto y lea independientemente por un período de tiempo prolongado."}
        },
        {
            "competencyText": {"en-us": "Habilidades de comprensión: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante usa habilidades metacognitivas para desarrollar y profundizar la comprensión de textos cada vez más complejos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "establezca un propósito para la lectura de textos asignados y autoseleccionados;"}
        },
        {
            "competencyText": {"en-us": "formule preguntas sobre el texto antes, durante y después de la lectura para profundizar la comprensión y obtener información;"}
        },
        {
            "competencyText": {"en-us": "haga y corrija o confirme predicciones utilizando los rasgos del texto, las características del género y las estructuras;"}
        },
        {
            "competencyText": {"en-us": "cree imágenes mentales para profundizar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "haga conexiones relacionadas con experiencias personales, ideas de otros textos y la sociedad;"}
        },
        {
            "competencyText": {"en-us": "haga inferencias y use evidencia para apoyar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "evalúe los detalles leídos para determinar las ideas claves;"}
        },
        {
            "competencyText": {"en-us": "sintetice información para crear un nuevo entendimiento; y"}
        },
        {
            "competencyText": {"en-us": "revise la comprensión y haga ajustes, tales como releer, usar conocimiento previo, observar pistas visuales y formular preguntas cuando la comprensión se pierde."}
        },
        {
            "competencyText": {"en-us": "Habilidades para responder: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante responde a una variedad cada vez más desafiante de fuentes de información que lee, escucha o ve. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "describa conexiones personales respecto a una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "escriba comentarios breves sobre textos literarios o informativos que demuestren la comprensión del texto;"}
        },
        {
            "competencyText": {"en-us": "use evidencia textual para apoyar una respuesta apropiada;"}
        },
        {
            "competencyText": {"en-us": "vuelva a contar y parafrasee textos de manera que mantengan su significado y orden lógico;"}
        },
        {
            "competencyText": {"en-us": "interactúe con las fuentes de información de manera significativa, tal como al hacer ilustraciones o al escribir; y"}
        },
        {
            "competencyText": {"en-us": "responda usando el vocabulario recién adquirido según sea apropiado."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —elementos literarios—. El estudiante reconoce y analiza elementos literarios dentro y a través del contenido cada vez más complejo de textos literarios tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "discuta tópicos y determine el tema usando evidencia textual con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "describa los atributos internos y externos del personaje principal (personajes principales);"}
        },
        {
            "competencyText": {"en-us": "describa y entienda los elementos de la trama, incluyendo los eventos principales, el conflicto y la resolución, de textos leídos en voz alta y de forma independiente; y"}
        },
        {
            "competencyText": {"en-us": "describa la importancia del escenario."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante reconoce y analiza las características, estructuras y propósitos específicos del género dentro y a través del contenido cada vez más complejo de textos tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre conocimiento de las características distintivas de la literatura infantil más conocida, tal como cuentos populares, fábulas y cuentos de hadas;"}
        },
        {
            "competencyText": {"en-us": "explique patrones visuales y estructuras en una variedad de poemas;"}
        },
        {
            "competencyText": {"en-us": "discuta los elementos del drama, tales como los personajes, el diálogo y el escenario;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características y estructuras del texto informativo, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "la idea central y la evidencia que la apoya con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "rasgos y gráficas para localizar y obtener información; y"}
        },
        {
            "competencyText": {"en-us": "patrones organizacionales, tales como el orden cronológico, y causa y efecto, expresados explícitamente;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características del texto persuasivo, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "expresar lo que el autor está tratando de persuadir al lector a pensar o hacer; y"}
        },
        {
            "competencyText": {"en-us": "distinguir entre hechos y opiniones; y"}
        },
        {
            "competencyText": {"en-us": "reconozca las características de los textos multimodales y digitales."}
        },
        {
            "competencyText": {"en-us": "Propósito y arte del escritor: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante hace indagaciones críticas para analizar las decisiones de los autores y cómo éstas influyen y comunican significado dentro de una variedad de textos. El estudiante analiza y aplica el arte del escritor con el propósito de desarrollar sus propios productos y presentaciones. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "discuta el propósito del autor al escribir un texto;"}
        },
        {
            "competencyText": {"en-us": "discuta cómo el uso de la estructura del texto contribuye al propósito del autor;"}
        },
        {
            "competencyText": {"en-us": "discuta cómo usa el autor los aspectos impresos y gráficos para lograr propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "discuta el uso del lenguaje descriptivo, literal y figurado;"}
        },
        {
            "competencyText": {"en-us": "identifique el uso de la primera o tercera persona en un texto; e"}
        },
        {
            "competencyText": {"en-us": "identifique y explique el uso de la repetición."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —proceso de escritura—. El estudiante utiliza el proceso de escritura en forma recurrente para redactar múltiples textos que sean legibles y usa las convenciones apropiadas. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "planifique un primer borrador generando ideas para escribir, tales como dibujar y hacer una lluvia de ideas;"}
        },
        {
            "competencyText": {"en-us": "desarrolle borradores para convertirlos en un texto enfocado al:"}
        },
        {
            "competencyText": {"en-us": "organizar un texto siguiendo una estructura; y"}
        },
        {
            "competencyText": {"en-us": "desarrollar una idea con detalles específicos y relevantes;"}
        },
        {
            "competencyText": {"en-us": "revise borradores agregando, borrando o reacomodando palabras, frases u oraciones;"}
        },
        {
            "competencyText": {"en-us": "edite borradores usando las convenciones comunes de la lengua española, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "oraciones completas en donde haya concordancia entre sujeto y verbo;"}
        },
        {
            "competencyText": {"en-us": "conjugaciones de los verbos en los tiempos pasado, presente y futuro, incluyendo la diferencia entre ser y estar;"}
        },
        {
            "competencyText": {"en-us": "sustantivos singulares, plurales, comunes y propios, incluyendo los artículos específicos de acuerdo al género;"}
        },
        {
            "competencyText": {"en-us": "adjetivos, incluyendo artículos;"}
        },
        {
            "competencyText": {"en-us": "adverbios que transmiten tiempo y adverbios que transmiten lugar;"}
        },
        {
            "competencyText": {"en-us": "preposiciones y frases preposicionales;"}
        },
        {
            "competencyText": {"en-us": "pronombres, incluyendo personales, posesivos y de objeto, y la diferencia en el uso del pronombre formal usted y el pronombre informal tú;"}
        },
        {
            "competencyText": {"en-us": "conjunciones coordinantes para formar sujetos y predicados compuestos;"}
        },
        {
            "competencyText": {"en-us": "letra mayúscula en nombres propios, y en el saludo y la despedida de una carta;"}
        },
        {
            "competencyText": {"en-us": "signos de puntuación al final de las oraciones declarativas, y al comienzo y al final de las oraciones exclamativas e interrogativas; y"}
        },
        {
            "competencyText": {"en-us": "escritura correcta de las palabras con patrones ortográficos y reglas ortográficas apropiados para el nivel del grado escolar; y"}
        },
        {
            "competencyText": {"en-us": "publique y comparta la escritura."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante usa el arte del escritor y las características del género para redactar múltiples textos que sean significativos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "redacte textos literarios, incluyendo narraciones personales y poesía;"}
        },
        {
            "competencyText": {"en-us": "redacte textos informativos, incluyendo textos de procedimientos y reportes; y"}
        },
        {
            "competencyText": {"en-us": "redacte correspondencia, tal como notas de agradecimiento o cartas."}
        },
        {
            "competencyText": {"en-us": "Indagación e investigación: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante se involucra en procesos de indagación a corto plazo y de forma recurrente y continua para una variedad de propósitos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "formule preguntas para la indagación formal e informal con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "elabore y siga un plan de investigación con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "identifique y recopile fuentes de información y datos relevantes para responder preguntas;"}
        },
        {
            "competencyText": {"en-us": "identifique fuentes de información primarias y secundarias;"}
        },
        {
            "competencyText": {"en-us": "demuestre comprensión de la información recopilada;"}
        },
        {
            "competencyText": {"en-us": "cite fuentes de información apropiadamente; y"}
        },
        {
            "competencyText": {"en-us": "utilice un modo apropiado de entrega, ya sea escrito, oral o multimodal, para presentar los resultados."}
        },
        {
            "competencyText": {"en-us": "Artes del Lenguaje y Lectura en español, 3er grado, adoptado en 2017."}
        },
        {
            "competencyText": {"en-us": "Introducción."}
        },
        {
            "competencyText": {"en-us": "El currículo Conocimientos y Destrezas Esenciales de Texas (TEKS por sus siglas en inglés) en español para artes del lenguaje y lectura refleja los estándares de artes del lenguaje que son auténticos al idioma español, así como a la lectura y escritura en español; éste no es una traducción ni una modificación del currículo TEKS de artes del lenguaje en inglés. El currículo TEKS de artes del lenguaje y lectura en español incluye la interrelación natural de escuchar, hablar, leer, escribir y pensar a partir de siete áreas integradas: desarrollo y apoyo de las destrezas fundamentales del lenguaje, comprensión, habilidades para responder, múltiples géneros, propósito y arte del escritor, composición, e indagación e investigación. Las áreas se enfocan en la capacidad oral académica (dominio en la expresión y comprensión oral), en la lectura auténtica y en la escritura reflexiva para asegurar un estado de Texas alfabetizado. Las áreas están integradas y son progresivas para que los estudiantes continúen desarrollando conocimientos y destrezas con un grado de complejidad y de variantes cada vez mayor que les permita pensar críticamente y adaptarse a la naturaleza siempre evolutiva del lenguaje, así como de la lectura y escritura."}
        },
        {
            "competencyText": {"en-us": "Las siete áreas sobre los conocimientos y las destrezas esenciales para artes del lenguaje y lectura en español están pensadas para ser integradas con propósitos de instrucción y son recurrentes por naturaleza. Las áreas incluyen los cuatro componentes del lenguaje (escuchar, hablar, leer y escribir) y su aplicación para acelerar la adquisición de las destrezas de lenguaje, de tal manera que los estudiantes desarrollen niveles óptimos de desempeño lingüístico en los ámbitos social y académico. Aunque algunas áreas pudieran necesitar mayor tiempo de instrucción, cada área es de igual valor, pueden presentarse sin seguir un orden determinado y deben ser incorporadas a lo largo del año. Es importante señalar que codificar (escribir) y decodificar (leer) son destrezas recíprocas. La decodificación se internaliza cuando se ofrecen actividades táctiles y cinestésicas (codificación). Además, los estudiantes deben participar en conversaciones académicas, escribir, leer y se les debe leer diariamente en situaciones en las que puedan interactuar con contenidos intercurriculares y en donde ellos puedan elegir."}
        },
        {
            "competencyText": {"en-us": "El español, a diferencia del inglés, tiene una relación letra-sonido más cercana y claramente define los límites de las sílabas. La sílaba en español es una unidad más crítica de conciencia fonológica que en inglés debido a la consistente correspondencia fonema-grafema. Las sílabas son unidades importantes en el español debido a su fuerte efecto en el reconocimiento visual de las palabras (Carreiras et al., 1993) y a su esencial papel para predecir una lectura en español exitosa. Además, el español presenta un nivel mucho mayor de transparencia ortográfica que el inglés y no se apoya en palabras reconocibles visualmente para la decodificación. Esta transparencia ortográfica acelera el proceso de decodificación y el enfoque se dirige rápidamente a la fluidez y a la comprensión. Sin embargo, en inglés, las palabras reconocibles visualmente son utilizadas debido a la existencia de ciertas palabras que no son decodificables, como are y one. En español, los problemas de decodificación no predominan tanto como los problemas de comprensión. Estos aspectos específicos de la lengua española van a influir tanto en la metodología como en el desarrollo de la lectura."}
        },
        {
            "competencyText": {"en-us": "La complejidad del texto aumenta con un vocabulario más desafiante, con estructuras sofisticadas de las oraciones, con rasgos del texto sutiles, con un contenido cognitivo elevado y con relaciones sutiles entre las ideas (Agencia de Educación de Texas, descripciones de los niveles de desempeño de STAAR 2013). En la medida que se logre la adquisición de destrezas y conocimientos en cada una de las siete áreas, los estudiantes continuarán aplicando estándares previos con mayor profundidad en textos cada vez más complejos de múltiples géneros; a la vez, podrán convertirse en estudiantes independientes y críticos que trabajan de forma colaborativa, al mismo tiempo que utilizan continuamente sus destrezas metacognitivas."}
        },
        {
            "competencyText": {"en-us": "La investigación muestra de manera consistente que el desarrollo del lenguaje, y de la lectura y la escritura en la lengua materna de los estudiantes no sólo facilita el aprendizaje del idioma inglés, así como leerlo y escribirlo, sino que también es la base para el desarrollo cognitivo y el aprendizaje (Cummins, 2001; Thomas & Collier, 2002; Coelho, 2001). Los estudiantes bilingües emergentes (Sparrow et al., 2014; Slavin & Cheving. 2013) son aquéllos que están en el proceso de adquirir dos o más códigos lingüísticos para convertirse en personas bilingües, biletradas y biculturales. Los estudiantes bilingües emergentes son a menudo definidos por sus deficiencias aparentes (limitados en el manejo del lenguaje) (Escamilla, 2012). Sin embargo, la investigación ha mostrado que los bilingües desarrollan un sistema interdependiente único (Escamilla et al., 2007; Grosjean, 1989; Valdes and Figueroa, 1994), en el cual los idiomas se interconectan para incrementar la funcionalidad lingüística. Esta interdependencia lingüística en la adquisición del lenguaje facilita una transferencia en las habilidades de lectura y escritura del lenguaje primario (L1) al segundo lenguaje (L2) (August & Shanahan, 2006; Bialystok, 2007; Miramontes, et al., 1997). La solidez del aprendizaje a través de la instrucción formal en español determina el alcance de la transferencia al inglés (August, Calderon & Carlo, 2002; Slavin & Calderon, 2001; Garcia, 2001). Para que esta transferencia alcance su nivel máximo, se deben enseñar de forma explícita las conexiones interlingüísticas entre las dos lenguas mientras los estudiantes participan en el análisis del español y el inglés para ver sus similitudes y diferencias (Cummins, 2007). Un desarrollo sólido y continuo en la lectura y escritura en español aporta las bases y la estructura para el desarrollo de la lectura y escritura dado que existe entre los dos idiomas lo que se conoce como Dominio Común Subyacente (CUP, por sus siglas en inglés) (Cummins, 1991). En consecuencia, instrucción directa y sistemática (Genesee et al., 2005) en la secuencia apropiada de las destrezas en español, junto con instrucción temprana de lectura y escritura basada en el inglés como segundo idioma, es crucial para el éxito del estudiante. Como resultado de estar trabajando bajo dos sistemas lingüísticos, las destrezas metalingüísticas y metacognitivas de los estudiantes se fortalecen al aprender acerca de las similitudes y diferencias entre los idiomas (Escamilla et al., 2014). Hasta qué punto el inglés y el español son utilizados depende del tipo de modelo de programa bilingüe empleado (ver Código de Educación de Texas, §29.066)."}
        },
        {
            "competencyText": {"en-us": "Para los estudiantes que están aprendiendo inglés (estudiantes ELL, por sus siglas en inglés), se espera que cumplan ciertos estándares en un segundo idioma y que su desempeño en inglés impacte directamente su habilidad para cumplir estos estándares. La comprensión de un texto a través de las etapas en el aprendizaje del idioma inglés requiere de una estructura didáctica, como modificaciones textuales, traducciones, apoyo en el idioma materno, uso de cognados, resúmenes, fotografías, objetos comunes, glosarios, diccionarios bilingües y/o de sinónimos, y otras formas de apoyo comprensibles. El uso estratégico del lenguaje primario del estudiante es importante para asegurar el desarrollo lingüístico, afectivo, cognitivo y académico en inglés. Los estudiantes ELL pueden y deben ser motivados a usar lo que saben de su primer idioma para mejorar el desarrollo de su vocabulario; éste necesita estar en el contexto del discurso oral y escrito interconectado para que sea significativo."}
        },
        {
            "competencyText": {"en-us": "La investigación actual enfatiza la importancia de integrar eficazmente el aprendizaje del segundo idioma con una educación de calidad en el área de contenido para asegurar que los estudiantes ELL adquieran un dominio del lenguaje social y académico en inglés, aprendan conocimientos y destrezas, y alcancen su mayor potencial académico. La instrucción tiene que incluir los ajustes lingüísticos que corresponden con los Estándares de Desempeño del Idioma Inglés (ELPS, por sus siglas en inglés) y con los niveles de dominio del inglés del estudiante para asegurar que el dominio absoluto de los conocimientos y las destrezas en el currículum requerido sea accesible. Para una mayor comprensión de las necesidades del aprendizaje de un segundo idioma, favor de referirse a los ELPS y a las descripciones de los niveles de dominio adoptados en el Capítulo 74, subcapítulo A, de este apartado (relacionado con el currículo requerido)."}
        },
        {
            "competencyText": {"en-us": "El dominio del lenguaje oral por parte de los estudiantes juega un papel primordial para lograr el éxito escolar; su participación en actividades verbales tiene que alcanzar su nivel máximo a lo largo de los grados escolares (Kinsella, 2010). Para que ellos se conviertan en individuos pensantes y hábiles para expresarse oralmente en ciencias, estudios sociales, matemáticas, bellas artes, artes del lenguaje y lectura, así como en los programas técnicos y de estudios profesionales, tienen que tener múltiples oportunidades para practicar y aplicar el leguaje académico de cada disciplina (Fisher, Frey & Rothenberg, 2008)."}
        },
        {
            "competencyText": {"en-us": "Los enunciados que tienen la palabra “incluyendo” se refieren a contenidos que tienen que dominarse muy bien; aquéllos que tienen la expresión “tales como” tienen la intención de ser posibles ejemplos ilustrativos."}
        },
        {
            "competencyText": {"en-us": "Conocimientos y destrezas."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, discutir y pensar —lenguaje oral—. El estudiante desarrolla el lenguaje oral por medio de la actividad de escuchar, hablar y discutir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "escuche activamente, haga preguntas relevantes para clarificar información y elabore comentarios pertinentes;"}
        },
        {
            "competencyText": {"en-us": "siga, replantee y dé instrucciones orales que impliquen una serie de acciones relacionadas que siguen una secuencia;"}
        },
        {
            "competencyText": {"en-us": "hable coherentemente sobre el tópico que está en discusión, empleando contacto visual, velocidad al hablar, volumen, enunciación y las convenciones del lenguaje para comunicar las ideas efectivamente;"}
        },
        {
            "competencyText": {"en-us": "trabaje en colaboración con otros siguiendo reglas, normas y protocolos acordados; y"}
        },
        {
            "competencyText": {"en-us": "desarrolle la comunicación social, tal como al conversar cortésmente en cualquier situación."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —inicio de la lectura y la escritura—. El estudiante desarrolla conocimiento de la estructura de las palabras a través de la conciencia fonológica, los conceptos impresos, la fonética y la morfología para comunicar, decodificar y escribir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique conocimiento fonético al:"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con acento prosódico u ortográfico;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con múltiples patrones de ortografía y de sonidos, como la “c”, “k”, “q”; la “s”, “z” y la “c” suave, y la “x”;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con la letra “h” que es silenciosa y palabras que usan las sílabas “que”, “qui”, “gue”, “gui”, “güe” y “güi”;"}
        },
        {
            "competencyText": {"en-us": "familiarizarse con el concepto de hiatos y diptongos, y las implicaciones de los acentos ortográficos;"}
        },
        {
            "competencyText": {"en-us": "decodificar y diferenciar el significado de una palabra basándose en el acento diacrítico; y"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con prefijos y sufijos;"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique el conocimiento ortográfico al:"}
        },
        {
            "competencyText": {"en-us": "escribir palabras agudas y graves (palabras con acento en la última y la penúltima sílaba);"}
        },
        {
            "competencyText": {"en-us": "escribir palabras esdrújulas (palabras con énfasis en la antepenúltima sílaba) que tienen un acento ortográfico;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con el concepto de diptongos e hiatos, y sus implicaciones al usar acentos ortográficos;"}
        },
        {
            "competencyText": {"en-us": "utilizar acentos en palabras comúnmente usadas en preguntas y exclamaciones;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras basadas en el acento diacrítico, tales como se/sé, el/él, y mas/más;"}
        },
        {
            "competencyText": {"en-us": "marcar los acentos apropiadamente al conjugar verbos, tales como en los tiempos pasado simple y pasado imperfecto, pasado participio, perfecto, condicional y futuro;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con la letra “h” que es silenciosa y palabras que usan las sílabas “que”, “qui”, “gue”, “gui”, “güe” y “güi”;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras que tienen el mismo sonido, pero se escriben con letras diferentes, incluyendo la ll/y; la c/k/q; la “c” suave; la “x”, la “s” y la “z” suaves; y la g/j/x suaves;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con el sonido fuerte y suave de la letra “r”;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras usando la letra “n” antes de la “v”; la “m” antes de la “b”; y la “m” antes de la “p”;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con sílabas trabadas; y"}
        },
        {
            "competencyText": {"en-us": "escribir el plural de las palabras que terminan en la letra “z” reemplazando la “z” por la “c” antes de agregarle “es”;"}
        },
        {
            "competencyText": {"en-us": "ordene alfabéticamente una serie de palabras a la tercera letra; y"}
        },
        {
            "competencyText": {"en-us": "escriba legiblemente palabras, respuestas y pensamientos completos en letra cursiva dejando espacios apropiados entre palabras."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —vocabulario—. El estudiante usa el vocabulario recién adquirido de forma expresiva. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "utilice recursos impresos o digitales para determinar el significado, la división en sílabas y la pronunciación;"}
        },
        {
            "competencyText": {"en-us": "use el contexto dentro y fuera de la oración para determinar el significado de palabras desconocidas y palabras de significado múltiple;"}
        },
        {
            "competencyText": {"en-us": "identifique el significado y use palabras con afijos, tales como “in-”, “des-”, “ex-”, “-mente”, “-dad”, “-oso”, “-eza” y “-ura”, y sepa cómo el afijo cambia el significado de la palabra;"}
        },
        {
            "competencyText": {"en-us": "identifique, use y explique el significado de antónimos, sinónimos, modismos, homófonos y homógrafos en un texto; y"}
        },
        {
            "competencyText": {"en-us": "diferencie y use homógrafos, homófonos y términos que comúnmente se confunden, tales como porque/porqué/por qué/por que, sino/si no y también/tan bien."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —fluidez—. El estudiante lee textos al nivel del grado escolar con fluidez y los comprende. Se espera que el estudiante use la fluidez apropiada (velocidad, precisión y prosodia) cuando lee un texto al nivel de su grado escolar."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —lectura autodirigida—. El estudiante lee textos apropiados para su nivel escolar de forma independiente. Se espera que el estudiante autoseleccione el texto y lea independientemente por un período de tiempo prolongado."}
        },
        {
            "competencyText": {"en-us": "Habilidades de comprensión: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante usa habilidades metacognitivas para desarrollar y profundizar la comprensión de textos cada vez más complejos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "establezca un propósito para la lectura de textos asignados y autoseleccionados;"}
        },
        {
            "competencyText": {"en-us": "formule preguntas sobre el texto antes, durante y después de la lectura para profundizar la comprensión y obtener información;"}
        },
        {
            "competencyText": {"en-us": "haga y corrija o confirme predicciones utilizando los rasgos del texto, las características del género y las estructuras;"}
        },
        {
            "competencyText": {"en-us": "cree imágenes mentales para profundizar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "haga conexiones relacionadas con experiencias personales, ideas de otros textos y la sociedad;"}
        },
        {
            "competencyText": {"en-us": "haga inferencias y use evidencia para apoyar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "evalúe los detalles leídos para determinar las ideas claves;"}
        },
        {
            "competencyText": {"en-us": "sintetice información para crear un nuevo entendimiento; y"}
        },
        {
            "competencyText": {"en-us": "revise la comprensión y haga ajustes, tales como releer, usar conocimiento previo, formular preguntas y hacer anotaciones cuando la comprensión se pierde."}
        },
        {
            "competencyText": {"en-us": "Habilidades para responder: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante responde a una variedad cada vez más desafiante de fuentes de información que lee, escucha o ve. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "describa conexiones personales respecto a una variedad de fuentes de información, incluyendo los textos autoseleccionados;"}
        },
        {
            "competencyText": {"en-us": "escriba una respuesta a un texto literario o informativo que demuestre la comprensión del texto;"}
        },
        {
            "competencyText": {"en-us": "use evidencia textual para apoyar una respuesta apropiada;"}
        },
        {
            "competencyText": {"en-us": "vuelva a contar y parafrasee textos de manera que mantengan su significado y orden lógico;"}
        },
        {
            "competencyText": {"en-us": "interactúe con las fuentes de información de manera significativa, tal como al tomar apuntes, al hacer anotaciones, al escribir sobre un tema libre o al hacer ilustraciones;"}
        },
        {
            "competencyText": {"en-us": "responda usando el vocabulario recién adquirido según sea apropiado; y"}
        },
        {
            "competencyText": {"en-us": "discuta ideas específicas del texto que son importantes al significado."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —elementos literarios—. El estudiante reconoce y analiza elementos literarios dentro y a través del contenido cada vez más complejo de textos literarios tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "infiera el tema de una obra distinguiendo tema de tópico;"}
        },
        {
            "competencyText": {"en-us": "explique las relaciones entre los personajes principales y los secundarios;"}
        },
        {
            "competencyText": {"en-us": "analice los elementos de la trama, incluyendo la secuencia de eventos, el conflicto y la resolución; y"}
        },
        {
            "competencyText": {"en-us": "explique la influencia del escenario en la trama."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante reconoce y analiza las características, estructuras y propósitos específicos del género dentro y a través del contenido cada vez más complejo de textos tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre conocimiento de las características distintivas de la literatura infantil más conocida, tal como cuentos populares, fábulas, cuentos de hadas, leyendas y mitos;"}
        },
        {
            "competencyText": {"en-us": "explique el esquema de rimas, los recursos sonoros y los estructurales, tales como las estrofas, en una variedad de poemas;"}
        },
        {
            "competencyText": {"en-us": "discuta los elementos del drama, tales como los personajes, el diálogo, el escenario y los actos;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características y estructuras del texto informativo, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "la idea central y la evidencia que la apoya;"}
        },
        {
            "competencyText": {"en-us": "rasgos, tales como secciones, tablas, gráficas, líneas cronológicas, texto con viñetas, números, letra negrita e itálica, para apoyar la comprensión; y"}
        },
        {
            "competencyText": {"en-us": "patrones organizacionales, tales como causa-efecto y problema-solución;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características y estructuras del texto argumentativo al:"}
        },
        {
            "competencyText": {"en-us": "identificar la postura;"}
        },
        {
            "competencyText": {"en-us": "diferenciar hechos de opiniones; e"}
        },
        {
            "competencyText": {"en-us": "identificar al público o al lector al que va dirigido; y"}
        },
        {
            "competencyText": {"en-us": "reconozca las características de los textos multimodales y digitales."}
        },
        {
            "competencyText": {"en-us": "Propósito y arte del escritor: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante hace indagaciones críticas para analizar las decisiones de los autores y cómo éstas influyen y comunican significado dentro de una variedad de textos. El estudiante analiza y aplica el arte del escritor con el propósito de desarrollar sus propios productos y presentaciones. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "explique el propósito y mensaje del autor dentro de un texto;"}
        },
        {
            "competencyText": {"en-us": "explique cómo el uso de la estructura del texto contribuye al propósito del autor;"}
        },
        {
            "competencyText": {"en-us": "explique cómo usa el autor los aspectos impresos y gráficos para lograr propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "describa cómo el uso que hace el autor de las imágenes, del lenguaje literal y figurado, tales como los símiles, y de los recursos sonoros, tales como la onomatopeya, logran propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "identifique el uso de recursos literarios, incluyendo el punto de vista de la primera o la tercera persona;"}
        },
        {
            "competencyText": {"en-us": "discuta cómo el uso del lenguaje del autor contribuye a la voz que tiene el texto; e"}
        },
        {
            "competencyText": {"en-us": "identifique y explique el uso de la hipérbole."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —proceso de escritura—. El estudiante utiliza el proceso de escritura en forma recurrente para redactar múltiples textos que sean legibles y usa las convenciones apropiadas. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "planifique un primer borrador seleccionando el género para un tópico, propósito y público específicos utilizando una variedad de estrategias, tales como la lluvia de ideas, la escritura libre y la elaboración de esquemas."}
        },
        {
            "competencyText": {"en-us": "desarrolle borradores para convertirlos en un texto enfocado, estructurado y coherente al:"}
        },
        {
            "competencyText": {"en-us": "organizar un texto con una estructura intencionada, incluyendo una introducción y una conclusión; y"}
        },
        {
            "competencyText": {"en-us": "desarrollar una idea interesante con detalles relevantes;"}
        },
        {
            "competencyText": {"en-us": "revise borradores para mejorar la estructura de las oraciones y la elección de las palabras agregando, borrando, combinando y reorganizando las ideas para lograr coherencia y claridad;"}
        },
        {
            "competencyText": {"en-us": "edite borradores usando las convenciones comunes de la lengua española, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "oraciones completas simples y compuestas en donde haya concordancia entre sujeto y verbo;"}
        },
        {
            "competencyText": {"en-us": "conjugaciones de los verbos, tales como en los tiempos pasado simple, presente y futuro, pasado imperfecto, pasado participio, perfecto y condicional, incluyendo la diferencia entre ser y estar;"}
        },
        {
            "competencyText": {"en-us": "sustantivos singulares, plurales, comunes y propios, incluyendo los artículos específicos de acuerdo al género;"}
        },
        {
            "competencyText": {"en-us": "adjetivos, incluyendo sus formas comparativa y superlativa;"}
        },
        {
            "competencyText": {"en-us": "adverbios que transmiten tiempo y adverbios que transmiten modo;"}
        },
        {
            "competencyText": {"en-us": "preposiciones y frases preposicionales;"}
        },
        {
            "competencyText": {"en-us": "pronombres, incluyendo personales, posesivos, de objeto y reflexivos;"}
        },
        {
            "competencyText": {"en-us": "conjunciones coordinantes para formar oraciones, sujetos y predicados compuestos;"}
        },
        {
            "competencyText": {"en-us": "letra mayúscula en nombres propios, nombres geográficos y nombres de lugares geográficos, períodos históricos y títulos oficiales de personas;"}
        },
        {
            "competencyText": {"en-us": "signos de puntuación, incluyendo el uso de la coma en una serie y en fechas que incluyen el día de la semana, y aspectos de formato apropiados, incluyendo la sangría; y"}
        },
        {
            "competencyText": {"en-us": "escritura correcta de las palabras con patrones ortográficos y reglas ortográficas apropiados para el nivel del grado escolar; y"}
        },
        {
            "competencyText": {"en-us": "publique la obra escrita para el público apropiado."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante usa el arte del escritor y las características del género para redactar múltiples textos que sean significativos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "redacte textos literarios, incluyendo narraciones personales y poesía, utilizando el arte del escritor y las características del género para escribir;"}
        },
        {
            "competencyText": {"en-us": "redacte textos informativos, incluyendo composiciones breves que transmitan información sobre un tópico, utilizando una idea central clara, el arte del escritor y las características del género para escribir;"}
        },
        {
            "competencyText": {"en-us": "redacte textos argumentativos, incluyendo ensayos de opinión, utilizando el arte del escritor y las características del género para escribir; y"}
        },
        {
            "competencyText": {"en-us": "redacte correspondencia, tal como notas de agradecimiento o cartas."}
        },
        {
            "competencyText": {"en-us": "Indagación e investigación: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante se involucra en procesos de indagación a corto plazo y de forma recurrente y continua para una variedad de propósitos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "formule preguntas sobre un tópico para la indagación formal e informal;"}
        },
        {
            "competencyText": {"en-us": "elabore y siga un plan de investigación con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "identifique y recopile información relevante de una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "identifique fuentes de información primarias y secundarias;"}
        },
        {
            "competencyText": {"en-us": "demuestre comprensión de la información recopilada;"}
        },
        {
            "competencyText": {"en-us": "reconozca la diferencia entre parafrasear y plagiar cuando se usan materiales de información;"}
        },
        {
            "competencyText": {"en-us": "elabore una página de obras citadas; y"}
        },
        {
            "competencyText": {"en-us": "utilice un modo apropiado de entrega, ya sea escrito, oral o multimodal, para presentar los resultados."}
        },
        {
            "competencyText": {"en-us": "Artes del Lenguaje y Lectura en español, 4o Grado, adoptado en 2017."}
        },
        {
            "competencyText": {"en-us": "Introducción."}
        },
        {
            "competencyText": {"en-us": "El currículo Conocimientos y Destrezas Esenciales de Texas (TEKS por sus siglas en inglés) en español para artes del lenguaje y lectura refleja los estándares de artes del lenguaje que son auténticos al idioma español, así como a la lectura y escritura en español; éste no es una traducción ni una modificación del currículo TEKS de artes del lenguaje en inglés. El currículo TEKS de artes del lenguaje y lectura en español incluye la interrelación natural de escuchar, hablar, leer, escribir y pensar a partir de siete áreas integradas: desarrollo y apoyo de las destrezas fundamentales del lenguaje, comprensión, habilidades para responder, múltiples géneros, propósito y arte del escritor, composición, e indagación e investigación. Las áreas se enfocan en la capacidad oral académica (dominio en la expresión y comprensión oral), en la lectura auténtica y en la escritura reflexiva para asegurar un estado de Texas alfabetizado. Las áreas están integradas y son progresivas para que los estudiantes continúen desarrollando conocimientos y destrezas con un grado de complejidad y de variantes cada vez mayor que les permita pensar críticamente y adaptarse a la naturaleza siempre evolutiva del lenguaje, así como de la lectura y escritura."}
        },
        {
            "competencyText": {"en-us": "Las siete áreas sobre los conocimientos y las destrezas esenciales para artes del lenguaje y lectura en español están pensadas para ser integradas con propósitos de instrucción y son recurrentes por naturaleza. Las áreas incluyen los cuatro componentes del lenguaje (escuchar, hablar, leer y escribir) y su aplicación para acelerar la adquisición de las destrezas de lenguaje, de tal manera que los estudiantes desarrollen niveles óptimos de desempeño lingüístico en los ámbitos social y académico. Aunque algunas áreas pudieran necesitar mayor tiempo de instrucción, cada área es de igual valor, pueden presentarse sin seguir un orden determinado y deben ser incorporadas a lo largo del año. Es importante señalar que codificar (escribir) y decodificar (leer) son destrezas recíprocas. La decodificación se internaliza cuando se ofrecen actividades táctiles y cinestésicas (codificación). Además, los estudiantes deben participar en conversaciones académicas, escribir, leer y se les debe leer diariamente en situaciones en las que puedan interactuar con contenidos intercurriculares y en donde ellos puedan elegir."}
        },
        {
            "competencyText": {"en-us": "El español, a diferencia del inglés, tiene una relación letra-sonido más cercana y claramente define los límites de las sílabas. La sílaba en español es una unidad más crítica de conciencia fonológica que en inglés debido a la consistente correspondencia fonema-grafema. Las sílabas son unidades importantes en el español debido a su fuerte efecto en el reconocimiento visual de las palabras (Carreiras et al., 1993) y a su esencial papel para predecir una lectura en español exitosa. Además, el español presenta un nivel mucho mayor de transparencia ortográfica que el inglés y no se apoya en palabras reconocibles visualmente para la decodificación. Esta transparencia ortográfica acelera el proceso de decodificación y el enfoque se dirige rápidamente a la fluidez y a la comprensión. Sin embargo, en inglés, las palabras reconocibles visualmente son utilizadas debido a la existencia de ciertas palabras que no son decodificables, como are y one. En español, los problemas de decodificación no predominan tanto como los problemas de comprensión. Estos aspectos específicos de la lengua española van a influir tanto en la metodología como en el desarrollo de la lectura."}
        },
        {
            "competencyText": {"en-us": "La complejidad del texto aumenta con un vocabulario más desafiante, con estructuras sofisticadas de las oraciones, con rasgos del texto sutiles, con un contenido cognitivo elevado y con relaciones sutiles entre las ideas (Agencia de Educación de Texas, descripciones de los niveles de desempeño de STAAR 2013). En la medida que se logre la adquisición de destrezas y conocimientos en cada una de las siete áreas, los estudiantes continuarán aplicando estándares previos con mayor profundidad en textos cada vez más complejos de múltiples géneros; a la vez, podrán convertirse en estudiantes independientes y críticos que trabajan de forma colaborativa, al mismo tiempo que utilizan continuamente sus destrezas metacognitivas."}
        },
        {
            "competencyText": {"en-us": "La investigación muestra de manera consistente que el desarrollo del lenguaje, y de la lectura y la escritura en la lengua materna de los estudiantes no sólo facilita el aprendizaje del idioma inglés, así como leerlo y escribirlo, sino que también es la base para el desarrollo cognitivo y el aprendizaje (Cummins, 2001; Thomas & Collier, 2002; Coelho, 2001). Los estudiantes bilingües emergentes (Sparrow et al., 2014; Slavin & Cheving. 2013) son aquéllos que están en el proceso de adquirir dos o más códigos lingüísticos para convertirse en personas bilingües, biletradas y biculturales. Los estudiantes bilingües emergentes son a menudo definidos por sus deficiencias aparentes (limitados en el manejo del lenguaje) (Escamilla, 2012). Sin embargo, la investigación ha mostrado que los bilingües desarrollan un sistema interdependiente único (Escamilla et al., 2007; Grosjean, 1989; Valdes and Figueroa, 1994), en el cual los idiomas se interconectan para incrementar la funcionalidad lingüística. Esta interdependencia lingüística en la adquisición del lenguaje facilita una transferencia en las habilidades de lectura y escritura del lenguaje primario (L1) al segundo lenguaje (L2) (August & Shanahan, 2006; Bialystok, 2007; Miramontes, et al., 1997). La solidez del aprendizaje a través de la instrucción formal en español determina el alcance de la transferencia al inglés (August, Calderon & Carlo, 2002; Slavin & Calderon, 2001; Garcia, 2001). Para que esta transferencia alcance su nivel máximo, se deben enseñar de forma explícita las conexiones interlingüísticas entre las dos lenguas mientras los estudiantes participan en el análisis del español y el inglés para ver sus similitudes y diferencias (Cummins, 2007). Un desarrollo sólido y continuo en la lectura y escritura en español aporta las bases y la estructura para el desarrollo de la lectura y escritura dado que existe entre los dos idiomas lo que se conoce como Dominio Común Subyacente (CUP, por sus siglas en inglés) (Cummins, 1991). En consecuencia, instrucción directa y sistemática (Genesee et al., 2005) en la secuencia apropiada de las destrezas en español, junto con instrucción temprana de lectura y escritura basada en el inglés como segundo idioma, es crucial para el éxito del estudiante. Como resultado de estar trabajando bajo dos sistemas lingüísticos, las destrezas metalingüísticas y metacognitivas de los estudiantes se fortalecen al aprender acerca de las similitudes y diferencias entre los idiomas (Escamilla et al., 2014). Hasta qué punto el inglés y el español son utilizados depende del tipo de modelo de programa bilingüe empleado (ver Código de Educación de Texas, §29.066)."}
        },
        {
            "competencyText": {"en-us": "Para los estudiantes que están aprendiendo inglés (estudiantes ELL, por sus siglas en inglés), se espera que cumplan ciertos estándares en un segundo idioma y que su desempeño en inglés impacte directamente su habilidad para cumplir estos estándares. La comprensión de un texto a través de las etapas en el aprendizaje del idioma inglés requiere de una estructura didáctica, como modificaciones textuales, traducciones, apoyo en el idioma materno, uso de cognados, resúmenes, fotografías, objetos comunes, glosarios, diccionarios bilingües y/o de sinónimos, y otras formas de apoyo comprensibles. El uso estratégico del lenguaje primario del estudiante es importante para asegurar el desarrollo lingüístico, afectivo, cognitivo y académico en inglés. Los estudiantes ELL pueden y deben ser motivados a usar lo que saben de su primer idioma para mejorar el desarrollo de su vocabulario; éste necesita estar en el contexto del discurso oral y escrito interconectado para que sea significativo."}
        },
        {
            "competencyText": {"en-us": "La investigación actual enfatiza la importancia de integrar eficazmente el aprendizaje del segundo idioma con una educación de calidad en el área de contenido para asegurar que los estudiantes ELL adquieran un dominio del lenguaje social y académico en inglés, aprendan conocimientos y destrezas, y alcancen su mayor potencial académico. La instrucción tiene que incluir los ajustes lingüísticos que corresponden con los Estándares de Desempeño del Idioma Inglés (ELPS, por sus siglas en inglés) y con los niveles de dominio del inglés del estudiante para asegurar que el dominio absoluto de los conocimientos y las destrezas en el currículum requerido sea accesible. Para una mayor comprensión de las necesidades del aprendizaje de un segundo idioma, favor de referirse a los ELPS y a las descripciones de los niveles de dominio adoptados en el Capítulo 74, subcapítulo A, de este apartado (relacionado con el currículo requerido)."}
        },
        {
            "competencyText": {"en-us": "El dominio del lenguaje oral por parte de los estudiantes juega un papel primordial para lograr el éxito escolar; su participación en actividades verbales tiene que alcanzar su nivel máximo a lo largo de los grados escolares (Kinsella, 2010). Para que ellos se conviertan en individuos pensantes y hábiles para expresarse oralmente en ciencias, estudios sociales, matemáticas, bellas artes, artes del lenguaje y lectura, así como en los programas técnicos y de estudios profesionales, tienen que tener múltiples oportunidades para practicar y aplicar el leguaje académico de cada disciplina (Fisher, Frey & Rothenberg, 2008)."}
        },
        {
            "competencyText": {"en-us": "Los enunciados que tienen la palabra “incluyendo” se refieren a contenidos que tienen que dominarse muy bien; aquéllos que tienen la expresión “tales como” tienen la intención de ser posibles ejemplos ilustrativos."}
        },
        {
            "competencyText": {"en-us": "Conocimientos y destrezas."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, discutir y pensar —lenguaje oral—. El estudiante desarrolla el lenguaje oral por medio de la actividad de escuchar, hablar y discutir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "escuche activamente, haga preguntas relevantes para clarificar información y elabore comentarios pertinentes;"}
        },
        {
            "competencyText": {"en-us": "siga, replantee y dé instrucciones orales que impliquen una serie de acciones relacionadas que siguen una secuencia;"}
        },
        {
            "competencyText": {"en-us": "exprese su opinión apoyada con información precisa, empleando contacto visual, velocidad al hablar, volumen, enunciación y las convenciones del lenguaje para comunicar las ideas efectivamente; y"}
        },
        {
            "competencyText": {"en-us": "trabaje en colaboración con otros para desarrollar un plan de actividades compartidas."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —inicio de la lectura y la escritura—. El estudiante desarrolla conocimiento de la estructura de las palabras a través de la conciencia fonológica, los conceptos impresos, la fonética y la morfología para comunicar, decodificar y escribir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique conocimiento fonético al:"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras agudas, graves, esdrújulas y sobresdrújulas (palabras con énfasis en la última, penúltima y antepenúltima sílaba y palabras con énfasis en la sílaba antes de la antepenúltima);"}
        },
        {
            "competencyText": {"en-us": "utilizar reglas ortográficas para dividir y combinar sílabas, incluyendo diptongos e hiatos formales y acentuados;"}
        },
        {
            "competencyText": {"en-us": "decodificar y diferenciar el significado de una palabra basándose en el acento diacrítico; y"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con prefijos y sufijos;"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique el conocimiento ortográfico al:"}
        },
        {
            "competencyText": {"en-us": "escribir palabras agudas y graves (palabras con énfasis en la última y la penúltima sílaba) con acento ortográfico;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras esdrújulas (palabras con énfasis en la antepenúltima sílaba) que tienen un acento ortográfico;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con diptongos e hiatos; y"}
        },
        {
            "competencyText": {"en-us": "marcar los acentos apropiadamente al conjugar verbos, tales como en los tiempos pasado simple y pasado imperfecto, pasado participio, perfecto, condicional y futuro; y"}
        },
        {
            "competencyText": {"en-us": "escriba legiblemente en letra cursiva para completar las asignaciones."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —vocabulario—. El estudiante usa el vocabulario recién adquirido de forma expresiva. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "utilice recursos impresos o digitales para determinar el significado, la división en sílabas y la pronunciación;"}
        },
        {
            "competencyText": {"en-us": "use el contexto dentro y fuera de la oración para determinar el significado relevante de palabras desconocidas o de palabras de significado múltiple;"}
        },
        {
            "competencyText": {"en-us": "identifique el significado y use palabras con afijos, tales como “mono-”, “sobre-”, “sub-”, “inter-”, “poli-”, “-able”, “-ante”, “-eza”, “-ancia”, “-ura” y raíces, incluyendo “auto”, “bio”, “grafía”, “metro”, “fono” y “tele”;"}
        },
        {
            "competencyText": {"en-us": "identifique, use y explique el significado de modismos, homógrafos y homófonos, tales como abrasar/abrazar; y"}
        },
        {
            "competencyText": {"en-us": "diferencie y use homógrafos, homófonos y términos que comúnmente se confunden, tales como porque/porqué/por qué/por que, sino/si no y también/tan bien."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —fluidez—. El estudiante lee textos al nivel del grado escolar con fluidez y los comprende. Se espera que el estudiante use la fluidez apropiada (velocidad, precisión y prosodia) cuando lee un texto al nivel de su grado escolar."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —lectura autodirigida—. El estudiante lee textos apropiados para su nivel escolar de forma independiente. Se espera que el estudiante autoseleccione el texto y lea independientemente por un período de tiempo prolongado."}
        },
        {
            "competencyText": {"en-us": "Habilidades de comprensión: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante usa habilidades metacognitivas para desarrollar y profundizar la comprensión de textos cada vez más complejos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "establezca un propósito para la lectura de textos asignados y autoseleccionados;"}
        },
        {
            "competencyText": {"en-us": "formule preguntas sobre el texto antes, durante y después de la lectura para profundizar la comprensión y obtener información;"}
        },
        {
            "competencyText": {"en-us": "haga y corrija o confirme predicciones utilizando los rasgos del texto, las características del género y las estructuras;"}
        },
        {
            "competencyText": {"en-us": "cree imágenes mentales para profundizar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "haga conexiones relacionadas con experiencias personales, ideas de otros textos y la sociedad;"}
        },
        {
            "competencyText": {"en-us": "haga inferencias y use evidencia para apoyar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "evalúe los detalles leídos para determinar las ideas claves;"}
        },
        {
            "competencyText": {"en-us": "sintetice información para crear un nuevo entendimiento; y"}
        },
        {
            "competencyText": {"en-us": "revise la comprensión y haga ajustes, tales como releer, usar conocimiento previo, formular preguntas y hacer anotaciones cuando la comprensión se pierde."}
        },
        {
            "competencyText": {"en-us": "Habilidades para responder: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante responde a una variedad cada vez más desafiante de fuentes de información que lee, escucha o ve. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "describa conexiones personales respecto a una variedad de fuentes de información, incluyendo los textos autoseleccionados;"}
        },
        {
            "competencyText": {"en-us": "escriba respuestas que demuestren la comprensión de los textos, incluyendo la comparación y el contraste de ideas a través de una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "use evidencia textual para apoyar una respuesta apropiada;"}
        },
        {
            "competencyText": {"en-us": "vuelva a contar, parafrasee o resuma textos de manera que mantengan su significado y orden lógico;"}
        },
        {
            "competencyText": {"en-us": "interactúe con las fuentes de información de manera significativa, tal como al tomar apuntes, al hacer anotaciones, al escribir sobre un tema libre o al hacer ilustraciones;"}
        },
        {
            "competencyText": {"en-us": "responda usando el vocabulario recién adquirido según sea apropiado; y"}
        },
        {
            "competencyText": {"en-us": "discuta ideas específicas del texto que son importantes al significado."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —elementos literarios—. El estudiante reconoce y analiza elementos literarios dentro y a través del contenido cada vez más complejo de textos literarios tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "infiera temas básicos apoyándose en evidencia textual;"}
        },
        {
            "competencyText": {"en-us": "explique las relaciones entre los personajes y los cambios que experimentan;"}
        },
        {
            "competencyText": {"en-us": "analice los elementos de la trama, incluyendo la acción ascendente, el punto culminante, la acción descendente y la resolución; y"}
        },
        {
            "competencyText": {"en-us": "explique la influencia del escenario, incluyendo escenarios históricos y culturales, en la trama."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante reconoce y analiza las características, estructuras y propósitos específicos del género dentro y a través del contenido cada vez más complejo de textos tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre conocimiento de las características distintivas de la literatura infantil más conocida, tal como cuentos populares, fábulas, leyendas, mitos y cuentos exagerados;"}
        },
        {
            "competencyText": {"en-us": "explique el lenguaje figurado, tal como el símil, la metáfora y la personificación que el poeta utiliza para crear imágenes;"}
        },
        {
            "competencyText": {"en-us": "explique la estructura del drama, tal como las singularidades de los personajes, los actos, las escenas y las direcciones escénicas;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características y estructuras del texto informativo, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "la idea central y la evidencia que la apoya;"}
        },
        {
            "competencyText": {"en-us": "rasgos, tales como guías de pronunciación y diagramas, para apoyar la comprensión; y"}
        },
        {
            "competencyText": {"en-us": "patrones organizacionales, tales como comparar y contrastar;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características y estructuras del texto argumentativo al:"}
        },
        {
            "competencyText": {"en-us": "identificar la postura;"}
        },
        {
            "competencyText": {"en-us": "explicar cómo el autor ha utilizado los hechos para un argumento; e"}
        },
        {
            "competencyText": {"en-us": "identificar al público o al lector al que va dirigido; y"}
        },
        {
            "competencyText": {"en-us": "reconozca las características de los textos multimodales y digitales."}
        },
        {
            "competencyText": {"en-us": "Propósito y arte del escritor: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante hace indagaciones críticas para analizar las decisiones de los autores y cómo éstas influyen y comunican significado dentro de una variedad de textos. El estudiante analiza y aplica el arte del escritor con el propósito de desarrollar sus propios productos y presentaciones. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "explique el propósito y mensaje del autor dentro de un texto;"}
        },
        {
            "competencyText": {"en-us": "explique cómo el uso de la estructura del texto contribuye al propósito del autor;"}
        },
        {
            "competencyText": {"en-us": "analice cómo usa el autor los aspectos impresos y gráficos para lograr propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "describa cómo el uso que hace el autor de las imágenes, del lenguaje literal y figurado, tales como los símiles y las metáforas, y de los recursos sonoros, tales como la aliteración y la asonancia, logran propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "identifique y comprenda el uso de recursos literarios, incluyendo el punto de vista de la primera o la tercera persona;"}
        },
        {
            "competencyText": {"en-us": "discuta cómo el uso del lenguaje del autor contribuye a la voz que tiene el texto; e"}
        },
        {
            "competencyText": {"en-us": "identifique y explique el uso de la anécdota."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —proceso de escritura—. El estudiante utiliza el proceso de escritura en forma recurrente para redactar múltiples textos que sean legibles y usa las convenciones apropiadas. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "planifique un primer borrador seleccionando el género para un tópico, propósito y público específicos utilizando una variedad de estrategias, tales como la lluvia de ideas, la escritura libre y la elaboración de esquemas;"}
        },
        {
            "competencyText": {"en-us": "desarrolle borradores para convertirlos en un texto enfocado, estructurado y coherente al:"}
        },
        {
            "competencyText": {"en-us": "organizar un texto con una estructura intencionada, incluyendo una introducción, transiciones y una conclusión; y"}
        },
        {
            "competencyText": {"en-us": "desarrollar una idea interesante con detalles relevantes;"}
        },
        {
            "competencyText": {"en-us": "revise borradores para mejorar la estructura de las oraciones y la elección de las palabras agregando, borrando, combinando y reorganizando las ideas para lograr coherencia y claridad;"}
        },
        {
            "competencyText": {"en-us": "edite borradores usando las convenciones comunes de la lengua española incluyendo:"}
        },
        {
            "competencyText": {"en-us": "oraciones completas simples y compuestas en donde haya concordancia entre sujeto y verbo evitando oraciones con puntuación incorrecta, oraciones unidas sin puntuación y fragmentos;"}
        },
        {
            "competencyText": {"en-us": "conjugaciones de los verbos, tales como en los tiempos pasado simple, presente y futuro, pasado imperfecto, pasado participio y condicional;"}
        },
        {
            "competencyText": {"en-us": "sustantivos singulares y plurales, comunes y propios, incluyendo los artículos específicos de acuerdo al género;"}
        },
        {
            "competencyText": {"en-us": "adjetivos, incluyendo sus formas comparativa y superlativa;"}
        },
        {
            "competencyText": {"en-us": "adverbios que transmiten frecuencia y adverbios que transmiten intensidad;"}
        },
        {
            "competencyText": {"en-us": "preposiciones y frases preposicionales;"}
        },
        {
            "competencyText": {"en-us": "pronombres, incluyendo personales, posesivos, de objeto, reflexivos y preposicionales;"}
        },
        {
            "competencyText": {"en-us": "conjunciones coordinantes para formar oraciones, sujetos y predicados compuestos;"}
        },
        {
            "competencyText": {"en-us": "letra mayúscula en eventos y documentos históricos, títulos de libros, cuentos y ensayos;"}
        },
        {
            "competencyText": {"en-us": "signos de puntuación, incluyendo el uso de la coma en oraciones compuestas y complejas, y el uso del guion largo en el diálogo; y"}
        },
        {
            "competencyText": {"en-us": "escritura correcta de las palabras con patrones ortográficos y reglas ortográficas apropiados para el nivel del grado escolar; y"}
        },
        {
            "competencyText": {"en-us": "publique la obra escrita para el público apropiado."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante usa el arte del escritor y las características del género para redactar múltiples textos que sean significativos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "redacte textos literarios, tales como narraciones personales y poesía, utilizando el arte del escritor y las características del género para escribir;"}
        },
        {
            "competencyText": {"en-us": "redacte textos informativos, incluyendo composiciones breves que transmitan información de un tópico, utilizando una idea central clara, el arte del escritor y las características del género para escribir;"}
        },
        {
            "competencyText": {"en-us": "redacte textos argumentativos, incluyendo ensayos de opinión, utilizando el arte del escritor y las características del género para escribir; y"}
        },
        {
            "competencyText": {"en-us": "redacte correspondencia para requerir información."}
        },
        {
            "competencyText": {"en-us": "Indagación e investigación: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante se involucra en procesos de indagación a corto plazo y de forma recurrente y continua para una variedad de propósitos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "formule y aclare preguntas sobre un tópico para la indagación formal e informal;"}
        },
        {
            "competencyText": {"en-us": "elabore y siga un plan de investigación con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "identifique y recopile información relevante de una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "identifique fuentes de información primarias y secundarias;"}
        },
        {
            "competencyText": {"en-us": "demuestre comprensión de la información recopilada;"}
        },
        {
            "competencyText": {"en-us": "reconozca la diferencia entre parafrasear y plagiar cuando se usan materiales de información;"}
        },
        {
            "competencyText": {"en-us": "elabore una bibliografía; y"}
        },
        {
            "competencyText": {"en-us": "utilice un modo apropiado de entrega, ya sea escrito, oral o multimodal, para presentar los resultados."}
        },
        {
            "competencyText": {"en-us": "Artes del Lenguaje y Lectura en español, 5o Grado, adoptado en 2017."}
        },
        {
            "competencyText": {"en-us": "Introducción."}
        },
        {
            "competencyText": {"en-us": "El currículo Conocimientos y Destrezas Esenciales de Texas (TEKS, por sus siglas en inglés) en español para artes del lenguaje y lectura refleja los estándares de artes del lenguaje que son auténticos al idioma español, así como a la lectura y escritura en español; éste no es una traducción ni una modificación del currículo TEKS de artes del lenguaje en inglés. El currículo TEKS de artes del lenguaje y lectura en español incluye la interrelación natural de escuchar, hablar, leer, escribir y pensar a partir de siete áreas integradas: desarrollo y apoyo de las destrezas fundamentales del lenguaje, comprensión, habilidades para responder, múltiples géneros, propósito y arte del escritor, composición, e indagación e investigación. Las áreas se enfocan en la capacidad oral académica (dominio en la expresión y comprensión oral), en la lectura auténtica y en la escritura reflexiva para asegurar un estado de Texas alfabetizado. Las áreas están integradas y son progresivas para que los estudiantes continúen desarrollando conocimientos y destrezas con un grado de complejidad y de variantes cada vez mayor que les permita pensar críticamente y adaptarse a la naturaleza siempre evolutiva del lenguaje, así como de la lectura y escritura."}
        },
        {
            "competencyText": {"en-us": "Las siete áreas sobre los conocimientos y las destrezas esenciales para artes del lenguaje y lectura en español están pensadas para ser integradas con propósitos de instrucción y son recurrentes por naturaleza. Las áreas incluyen los cuatro componentes del lenguaje (escuchar, hablar, leer y escribir) y su aplicación para acelerar la adquisición de las destrezas de lenguaje, de tal manera que los estudiantes desarrollen niveles óptimos de desempeño lingüístico en los ámbitos social y académico. Aunque algunas áreas pudieran necesitar mayor tiempo de instrucción, cada área es de igual valor, pueden presentarse sin seguir un orden determinado y deben ser incorporadas a lo largo del año. Es importante señalar que codificar (escribir) y decodificar (leer) son destrezas recíprocas. La decodificación se internaliza cuando se ofrecen actividades táctiles y cinestésicas (codificación). Además, los estudiantes deben participar en conversaciones académicas, escribir, leer y se les debe leer diariamente en situaciones en las que puedan interactuar con contenidos intercurriculares y en donde ellos puedan elegir."}
        },
        {
            "competencyText": {"en-us": "El español, a diferencia del inglés, tiene una relación letra-sonido más cercana y claramente define los límites de las sílabas. La sílaba en español es una unidad más crítica de conciencia fonológica que en inglés debido a la consistente correspondencia fonema-grafema. Las sílabas son unidades importantes en el español debido a su fuerte efecto en el reconocimiento visual de las palabras (Carreiras et al., 1993) y a su esencial papel para predecir una lectura en español exitosa. Además, el español presenta un nivel mucho mayor de transparencia ortográfica que el inglés y no se apoya en palabras reconocibles visualmente para la decodificación. Esta transparencia ortográfica acelera el proceso de decodificación y el enfoque se dirige rápidamente a la fluidez y a la comprensión. Sin embargo, en inglés, las palabras reconocibles visualmente son utilizadas debido a la existencia de ciertas palabras que no son decodificables, como are y one. En español, los problemas de decodificación no predominan tanto como los problemas de comprensión. Estos aspectos específicos de la lengua española van a influir tanto en la metodología como en el desarrollo de la lectura."}
        },
        {
            "competencyText": {"en-us": "La complejidad del texto aumenta con un vocabulario más desafiante, con estructuras sofisticadas de las oraciones, con rasgos del texto sutiles, con un contenido cognitivo elevado y con relaciones sutiles entre las ideas (Agencia de Educación de Texas, descripciones de los niveles de desempeño de STAAR 2013). En la medida que se logre la adquisición de destrezas y conocimientos en cada una de las siete áreas, los estudiantes continuarán aplicando estándares previos con mayor profundidad en textos cada vez más complejos de múltiples géneros; a la vez, podrán convertirse en estudiantes independientes y críticos que trabajan de forma colaborativa, al mismo tiempo que utilizan continuamente sus destrezas metacognitivas."}
        },
        {
            "competencyText": {"en-us": "La investigación muestra de manera consistente que el desarrollo del lenguaje, y de la lectura y la escritura en la lengua materna de los estudiantes no sólo facilita el aprendizaje del idioma inglés, así como leerlo y escribirlo, sino que también es la base para el desarrollo cognitivo y el aprendizaje (Cummins, 2001; Thomas & Collier, 2002; Coelho, 2001). Los estudiantes bilingües emergentes (Sparrow et al., 2014; Slavin & Cheving. 2013) son aquéllos que están en el proceso de adquirir dos o más códigos lingüísticos para convertirse en personas bilingües, biletradas y biculturales. Los estudiantes bilingües emergentes son a menudo definidos por sus deficiencias aparentes (limitados en el manejo del lenguaje) (Escamilla, 2012). Sin embargo, la investigación ha mostrado que los bilingües desarrollan un sistema interdependiente único (Escamilla et al., 2007; Grosjean, 1989; Valdes and Figueroa, 1994), en el cual los idiomas se interconectan para incrementar la funcionalidad lingüística. Esta interdependencia lingüística en la adquisición del lenguaje facilita una transferencia de las habilidades de lectura y escritura del lenguaje primario (L1) al segundo lenguaje (L2) (August & Shanahan, 2006; Bialystok, 2007; Miramontes, et al., 1997). La solidez del aprendizaje a través de la instrucción formal en español determina el alcance de la transferencia al inglés (August, Calderon & Carlo, 2002; Slavin & Calderon, 2001; Garcia, 2001). Para que esta transferencia alcance su nivel máximo, se deben enseñar de forma explícita las conexiones interlingüísticas entre las dos lenguas mientras los estudiantes participan en el análisis del español y el inglés para ver sus similitudes y diferencias (Cummins, 2007). Un desarrollo sólido y continuo en la lectura y escritura en español aporta las bases y la estructura para el desarrollo de la lectura y escritura dado que existe entre los dos idiomas lo que se conoce como Dominio Común Subyacente (CUP, por sus siglas en inglés) (Cummins, 1991). En consecuencia, instrucción directa y sistemática (Genesee et al., 2005) en la secuencia apropiada de las destrezas en español, junto con instrucción temprana de lectura y escritura basada en el inglés como segundo idioma, es crucial para el éxito del estudiante. Como resultado de estar trabajando bajo dos sistemas lingüísticos, las destrezas metalingüísticas y metacognitivas de los estudiantes se fortalecen al aprender acerca de las similitudes y diferencias entre los idiomas (Escamilla et al., 2014). Hasta qué punto el inglés y el español son utilizados depende del tipo de modelo de programa bilingüe empleado (ver Código de Educación de Texas, §29.066)."}
        },
        {
            "competencyText": {"en-us": "Para los estudiantes que están aprendiendo inglés (estudiantes ELL, por sus siglas en inglés), se espera que cumplan ciertos estándares en un segundo idioma y que su desempeño en inglés impacte directamente su habilidad para cumplir estos estándares. La comprensión de un texto a través de las etapas en el aprendizaje del idioma inglés requiere de una estructura didáctica, como modificaciones textuales, traducciones, apoyo en el idioma materno, uso de cognados, resúmenes, fotografías, objetos comunes, glosarios, diccionarios bilingües y/o de sinónimos, y otras formas de apoyo comprensibles. El uso estratégico del lenguaje primario del estudiante es importante para asegurar el desarrollo lingüístico, afectivo, cognitivo y académico en inglés. Los estudiantes ELL pueden y deben ser motivados a usar lo que saben de su primer idioma para mejorar el desarrollo de su vocabulario; éste necesita estar en el contexto del discurso oral y escrito interconectado para que sea significativo."}
        },
        {
            "competencyText": {"en-us": "La investigación actual enfatiza la importancia de integrar eficazmente el aprendizaje del segundo idioma con una educación de calidad en el área de contenido para asegurar que los estudiantes ELL adquieran un dominio del lenguaje social y académico en inglés, aprendan conocimientos y destrezas, y alcancen su mayor potencial académico. La instrucción tiene que incluir los ajustes lingüísticos que corresponden con los Estándares de Desempeño del Idioma Inglés (ELPS, por sus siglas en inglés) y con los niveles de dominio del inglés del estudiante para asegurar que el dominio absoluto de los conocimientos y las destrezas en el currículum requerido sea accesible. Para una mayor comprensión de las necesidades del aprendizaje de un segundo idioma, favor de referirse a los ELPS y a las descripciones de los niveles de dominio adoptados en el Capítulo 74, subcapítulo A, de este apartado (relacionado con el currículo requerido)."}
        },
        {
            "competencyText": {"en-us": "El dominio del lenguaje oral por parte de los estudiantes juega un papel primordial para lograr el éxito escolar; su participación en actividades verbales tiene que alcanzar su nivel máximo a lo largo de los grados escolares (Kinsella, 2010). Para que ellos se conviertan en individuos pensantes y hábiles para expresarse oralmente en ciencias, estudios sociales, matemáticas, bellas artes, artes del lenguaje y lectura, así como en los programas técnicos y de estudios profesionales, tienen que tener múltiples oportunidades para practicar y aplicar el leguaje académico de cada disciplina (Fisher, Frey & Rothenberg, 2008)."}
        },
        {
            "competencyText": {"en-us": "Los enunciados que tienen la palabra “incluyendo” se refieren a contenidos que tienen que dominarse muy bien; aquéllos que tienen la expresión “tales como” tienen la intención de ser posibles ejemplos ilustrativos."}
        },
        {
            "competencyText": {"en-us": "Conocimientos y destrezas."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, discutir y pensar —lenguaje oral—. El estudiante desarrolla el lenguaje oral por medio de la actividad de escuchar, hablar y discutir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "escuche activamente para interpretar mensajes verbales y no verbales, haga preguntas relevantes y elabore comentarios pertinentes;"}
        },
        {
            "competencyText": {"en-us": "siga, replantee y dé instrucciones orales que incluyen acciones de varios pasos;"}
        },
        {
            "competencyText": {"en-us": "haga una presentación organizada empleando contacto visual, velocidad al hablar, volumen, enunciación, gestos naturales y las convenciones del lenguaje para comunicar las ideas efectivamente; y"}
        },
        {
            "competencyText": {"en-us": "trabaje en colaboración con otros para desarrollar un plan de actividades compartidas."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —inicio de la lectura y la escritura—. El estudiante desarrolla conocimiento de la estructura de las palabras a través de la conciencia fonológica, los conceptos impresos, la fonética y la morfología para comunicar, decodificar y escribir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique conocimiento fonético al:"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras agudas, graves, esdrújulas y sobresdrújulas (palabras con énfasis en la última, penúltima y antepenúltima sílaba, y palabras con énfasis en la sílaba antes de la antepenúltima);"}
        },
        {
            "competencyText": {"en-us": "utilizar reglas ortográficas para dividir y combinar sílabas, incluyendo diptongos e hiatos formales y acentuados;"}
        },
        {
            "competencyText": {"en-us": "decodificar y diferenciar el significado de una palabra basándose en el acento diacrítico; y"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con prefijos y sufijos;"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique el conocimiento ortográfico al:"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con reglas y patrones ortográficos más avanzados;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras agudas, graves y esdrújulas (palabras con énfasis en la última, penúltima y antepenúltima sílaba); con acento prosódico u ortográfico;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras sobresdrújulas (palabras con énfasis en la sílaba antes de la antepenúltima sílaba) con acento prosódico u ortográfico;"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con diptongos e hiatos; y"}
        },
        {
            "competencyText": {"en-us": "marcar los acentos apropiadamente al conjugar verbos, tales como en los tiempos pasado simple y pasado imperfecto, pasado participio, perfecto, condicional y futuro; y"}
        },
        {
            "competencyText": {"en-us": "escriba legiblemente en letra cursiva."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —vocabulario—. El estudiante usa el vocabulario recién adquirido de forma expresiva. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "utilice recursos impresos o digitales para determinar el significado, la división en sílabas, la pronunciación y el origen de las palabras;"}
        },
        {
            "competencyText": {"en-us": "use el contexto dentro y fuera de la oración para determinar el significado relevante de palabras desconocidas o de palabras de significado múltiple;"}
        },
        {
            "competencyText": {"en-us": "identifique el significado y use palabras con afijos, tales como “trans-”, “super-”, “anti-”, “semi-”, “-logía”, “-ificar”, “-ismo” e “-ista” y raíces, incluyendo “audi”, “crono”, “foto”, “geo” y “terr”;"}
        },
        {
            "competencyText": {"en-us": "identifique, use y explique el significado de modismos, refranes y juegos de palabras; y"}
        },
        {
            "competencyText": {"en-us": "diferencie y use homógrafos, homófonos y términos que comúnmente se confunden, tales como porque/porqué/por qué/por que, sino/si no y también/tan bien."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —fluidez—. El estudiante lee textos al nivel del grado escolar con fluidez y los comprende. Se espera que el estudiante use la fluidez apropiada (velocidad, precisión y prosodia) cuando lee un texto al nivel de su grado escolar."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —lectura autodirigida—. El estudiante lee textos apropiados para su nivel escolar de forma independiente. Se espera que el estudiante autoseleccione el texto y lea independientemente por un período de tiempo prolongado."}
        },
        {
            "competencyText": {"en-us": "Habilidades de comprensión: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante usa habilidades metacognitivas para desarrollar y profundizar la comprensión de textos cada vez más complejos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "establezca un propósito para la lectura de textos asignados y autoseleccionados;"}
        },
        {
            "competencyText": {"en-us": "formule preguntas sobre el texto antes, durante y después de la lectura para profundizar la comprensión y obtener información;"}
        },
        {
            "competencyText": {"en-us": "haga y corrija o confirme predicciones utilizando los rasgos del texto, las características del género y las estructuras;"}
        },
        {
            "competencyText": {"en-us": "cree imágenes mentales para profundizar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "haga conexiones relacionadas con experiencias personales, ideas de otros textos y la sociedad;"}
        },
        {
            "competencyText": {"en-us": "haga inferencias y use evidencia para apoyar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "evalúe los detalles leídos para determinar las ideas claves;"}
        },
        {
            "competencyText": {"en-us": "sintetice información para crear un nuevo entendimiento; y"}
        },
        {
            "competencyText": {"en-us": "revise la comprensión y haga ajustes, tales como releer, usar conocimiento previo, formular preguntas y hacer anotaciones cuando la comprensión se pierde."}
        },
        {
            "competencyText": {"en-us": "Habilidades para responder: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante responde a una variedad cada vez más desafiante de fuentes de información que lee, escucha o ve. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "describa conexiones personales respecto a una variedad de fuentes de información, incluyendo los textos autoseleccionados;"}
        },
        {
            "competencyText": {"en-us": "escriba respuestas que demuestren la comprensión de los textos, incluyendo la comparación y el contraste de ideas a través de una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "use evidencia textual para apoyar una respuesta apropiada;"}
        },
        {
            "competencyText": {"en-us": "vuelva a contar, parafrasee o resuma textos de manera que mantengan su significado y orden lógico;"}
        },
        {
            "competencyText": {"en-us": "interactúe con las fuentes de información de manera significativa, tal como al tomar apuntes, al hacer anotaciones, al escribir sobre un tema libre o al hacer ilustraciones;"}
        },
        {
            "competencyText": {"en-us": "responda usando el vocabulario recién adquirido según sea apropiado; y"}
        },
        {
            "competencyText": {"en-us": "discuta ideas específicas del texto que son importantes al significado."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —elementos literarios—. El estudiante reconoce y analiza elementos literarios dentro y a través del contenido cada vez más complejo de textos literarios tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "infiera múltiples temas dentro de un texto usando evidencia textual;"}
        },
        {
            "competencyText": {"en-us": "analice las relaciones y los conflictos entre los personajes;"}
        },
        {
            "competencyText": {"en-us": "analice los elementos de la trama, incluyendo la acción ascendente, el punto culminante, la acción descendente y la resolución; y"}
        },
        {
            "competencyText": {"en-us": "analice la influencia del escenario, incluyendo escenarios históricos y culturales, en la trama."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante reconoce y analiza las características, estructuras y propósitos específicos del género dentro y a través del contenido cada vez más complejo de textos tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre conocimiento de las características distintivas de la literatura infantil más conocida, tal como cuentos populares, fábulas, leyendas, mitos y cuentos exagerados;"}
        },
        {
            "competencyText": {"en-us": "explique el uso de los recursos sonoros y el lenguaje figurado, y distinga entre el poeta y el narrador en poemas a través de una variedad de formas poéticas;"}
        },
        {
            "competencyText": {"en-us": "explique la estructura del drama, tal como las singularidades de los personajes, los actos, las escenas y las direcciones escénicas;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características y estructuras del texto informativo incluyendo:"}
        },
        {
            "competencyText": {"en-us": "la idea central y la evidencia que la apoyan;"}
        },
        {
            "competencyText": {"en-us": "rasgos, tales como inserciones informativas, líneas cronológicas y recuadros complementarios, para apoyar la comprensión; y"}
        },
        {
            "competencyText": {"en-us": "patrones organizacionales, tales como el orden lógico y el orden de importancia;"}
        },
        {
            "competencyText": {"en-us": "reconozca las características y estructuras del texto argumentativo al:"}
        },
        {
            "competencyText": {"en-us": "identificar la postura;"}
        },
        {
            "competencyText": {"en-us": "explicar cómo el autor ha utilizado los hechos en favor o en contra de un argumento; e"}
        },
        {
            "competencyText": {"en-us": "identificar al público o al lector al que va dirigido; y"}
        },
        {
            "competencyText": {"en-us": "reconozca las características de los textos multimodales y digitales."}
        },
        {
            "competencyText": {"en-us": "Propósito y arte del escritor: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante hace indagaciones críticas para analizar las decisiones de los autores y cómo éstas influyen y comunican significado dentro de una variedad de textos. El estudiante analiza y aplica el arte del escritor con el propósito de desarrollar sus propios productos y presentaciones. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "explique el propósito y mensaje del autor dentro de un texto;"}
        },
        {
            "competencyText": {"en-us": "analice cómo el uso de la estructura del texto contribuye al propósito del autor;"}
        },
        {
            "competencyText": {"en-us": "analice cómo usa el autor los aspectos impresos y gráficos para lograr propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "describa cómo el uso que hace el autor de las imágenes, del lenguaje literal y figurado, tales como los símiles y las metáforas, y de los recursos sonoros logran propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "identifique y comprenda el uso de recursos literarios, incluyendo el punto de vista de la primera o la tercera persona;"}
        },
        {
            "competencyText": {"en-us": "examine cómo el uso del lenguaje del autor contribuye a la voz que tiene el texto; y"}
        },
        {
            "competencyText": {"en-us": "explique el propósito de la hipérbole, el estereotipo y la anécdota."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —proceso de escritura—. El estudiante utiliza el proceso de escritura en forma recurrente para redactar múltiples textos que sean legibles y usa las convenciones apropiadas. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "planifique un primer borrador seleccionando el género para un tópico, propósito y público específicos utilizando una variedad de estrategias, tales como la lluvia de ideas, la escritura libre y la elaboración de esquemas;"}
        },
        {
            "competencyText": {"en-us": "desarrolle borradores para convertirlos en un texto enfocado, estructurado y coherente al:"}
        },
        {
            "competencyText": {"en-us": "organizar un texto con una estructura intencionada, incluyendo una introducción, transiciones y una conclusión; y"}
        },
        {
            "competencyText": {"en-us": "desarrollar una idea interesante que refleje la profundidad del pensamiento con hechos y detalles específicos;"}
        },
        {
            "competencyText": {"en-us": "revise borradores para mejorar la estructura de las oraciones y la elección de las palabras agregando, borrando, combinando y reorganizando las ideas para lograr coherencia y claridad;"}
        },
        {
            "competencyText": {"en-us": "edite borradores usando las convenciones comunes de la lengua española incluyendo:"}
        },
        {
            "competencyText": {"en-us": "oraciones completas simples y compuestas en donde haya concordancia entre sujeto y verbo evitando oraciones con puntuación incorrecta, oraciones unidas sin puntuación y fragmentos;"}
        },
        {
            "competencyText": {"en-us": "verbos irregulares;"}
        },
        {
            "competencyText": {"en-us": "sustantivos colectivos;"}
        },
        {
            "competencyText": {"en-us": "adjetivos, incluyendo los que indican el origen, y sus formas comparativa y superlativa;"}
        },
        {
            "competencyText": {"en-us": "adverbios conjuntivos;"}
        },
        {
            "competencyText": {"en-us": "preposiciones y frases preposicionales y su influencia en la concordancia entre el sujeto y el verbo;"}
        },
        {
            "competencyText": {"en-us": "pronombres, incluyendo personales, posesivos, de objeto, reflexivos, preposicionales e indefinidos;"}
        },
        {
            "competencyText": {"en-us": "conjunciones subordinantes para formar oraciones complejas;"}
        },
        {
            "competencyText": {"en-us": "letra mayúscula en iniciales, acrónimos y organizaciones;"}
        },
        {
            "competencyText": {"en-us": "letra itálica y subrayado en títulos y para dar énfasis, y signos de puntuación, incluyendo el uso de la coma en oraciones compuestas y complejas, el guion largo en el diálogo y el uso de comillas en títulos; y"}
        },
        {
            "competencyText": {"en-us": "escritura correcta de las palabras con patrones ortográficos y reglas ortográficas apropiados para el nivel del grado escolar; y"}
        },
        {
            "competencyText": {"en-us": "publique la obra escrita para el público apropiado."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante usa el arte del escritor y las características del género para redactar múltiples textos que sean significativos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "redacte textos literarios, tales como narraciones personales, ficción y poesía, utilizando el arte del escritor y las características del género para escribir;"}
        },
        {
            "competencyText": {"en-us": "redacte textos informativos, incluyendo composiciones breves que transmitan información de un tópico, utilizando una idea central clara, el arte del escritor y las características del género para escribir;"}
        },
        {
            "competencyText": {"en-us": "redacte textos argumentativos, incluyendo ensayos de opinión, utilizando el arte del escritor y las características del género para escribir; y"}
        },
        {
            "competencyText": {"en-us": "redacte correspondencia para requerir información."}
        },
        {
            "competencyText": {"en-us": "Indagación e investigación: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante se involucra en procesos de indagación a corto plazo y de forma recurrente y continua para una variedad de propósitos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "formule y aclare preguntas sobre un tópico para la indagación formal e informal;"}
        },
        {
            "competencyText": {"en-us": "elabore y siga un plan de investigación con la asistencia de un adulto;"}
        },
        {
            "competencyText": {"en-us": "identifique y recopile información relevante de una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "comprenda la credibilidad de fuentes de información primarias y secundarias;"}
        },
        {
            "competencyText": {"en-us": "demuestre comprensión de la información recopilada;"}
        },
        {
            "competencyText": {"en-us": "reconozca la diferencia entre parafrasear y plagiar cuando se usan materiales de información;"}
        },
        {
            "competencyText": {"en-us": "elabore una bibliografía; y"}
        },
        {
            "competencyText": {"en-us": "utilice un modo apropiado de entrega, ya sea escrito, oral o multimodal, para presentar los resultados."}
        },
        {
            "competencyText": {"en-us": "Subcapítulo B. Educación Intermedia"}
        },
        {
            "competencyText": {"en-us": "Implementación de los conocimientos y destrezas esenciales para artes del lenguaje y lectura en español de nivel intermedio, adoptado en 2017."}
        },
        {
            "competencyText": {"en-us": "Las estipulaciones de este subcapítulo y de las secciones §§128.21-128.23 serán implementadas por los distritos escolares."}
        },
        {
            "competencyText": {"en-us": "Con fecha máxima del 31 de agosto del 2018, el comisionado de educación determinará si hay financiamiento disponible para materiales de instrucción para las escuelas públicas de Texas que cubren los conocimientos y destrezas esenciales de artes del lenguaje y lectura en español y de inglés como segundo idioma según lo adoptado en la sección §§128.21-128.23 de este apartado."}
        },
        {
            "competencyText": {"en-us": "Si el comisionado toma la determinación de que hay financiamiento disponible para materiales de instrucción bajo el inciso (b) de esta sección, la sección §§128.21-128.23 de este apartado deberá implementarse empezando el año escolar 2019-2020 y aplicarse a partir del año escolar 2019-2020 y años escolares posteriores."}
        },
        {
            "competencyText": {"en-us": "Si el comisionado no toma la determinación de que hay financiamiento disponible para materiales de instrucción bajo el inciso (b) de esta sección, el comisionado determinará con fecha máxima del 31 de agosto de cada año escolar posterior si hay o no financiamiento disponible para materiales de instrucción. Si el comisionado determina que hay financiamiento disponible para materiales de instrucción, el comisionado notificará al Consejo de Educación Estatal y a los distritos escolares que la sección §§128.21-128.23 de este apartado será implementada para el siguiente año escolar."}
        },
        {
            "competencyText": {"en-us": "La sección 128.18 de este apartado deberá ser sustituida por la implementación de esta sección y por las secciones §§128.21-128.23 de este apartado."}
        },
        {
            "competencyText": {"en-us": "Artes del Lenguaje y Lectura en español, 6o Grado, adoptado en 2017."}
        },
        {
            "competencyText": {"en-us": "Introducción."}
        },
        {
            "competencyText": {"en-us": "El currículo Conocimientos y Destrezas Esenciales de Texas (TEKS, por sus siglas en inglés) en español para artes del lenguaje y lectura refleja los estándares de artes del lenguaje que son auténticos al idioma español, así como a la lectura y escritura en español; éste no es una traducción ni una modificación del currículo TEKS de artes del lenguaje en inglés. El currículo TEKS de artes del lenguaje y lectura en español incluye la interrelación natural de escuchar, hablar, leer, escribir y pensar a partir de siete áreas integradas: desarrollo y apoyo de las destrezas fundamentales del lenguaje, comprensión, habilidades para responder, múltiples géneros, propósito y arte del escritor, composición, e indagación e investigación. Las áreas se enfocan en la capacidad oral académica (dominio en la expresión y comprensión oral), en la lectura auténtica y en la escritura reflexiva para asegurar un estado de Texas alfabetizado. Las áreas están integradas y son progresivas para que los estudiantes continúen desarrollando conocimientos y destrezas con un grado de complejidad y de variantes cada vez mayor que les permita pensar críticamente y adaptarse a la naturaleza siempre evolutiva del lenguaje, así como de la lectura y escritura."}
        },
        {
            "competencyText": {"en-us": "Las siete áreas sobre los conocimientos y las destrezas esenciales para artes del lenguaje y lectura en español están pensadas para ser integradas con propósitos de instrucción y son recurrentes por naturaleza. Las áreas incluyen los cuatro componentes del lenguaje (escuchar, hablar, leer y escribir) y su aplicación para acelerar la adquisición de las destrezas de lenguaje, de tal manera que los estudiantes desarrollen niveles óptimos de desempeño lingüístico en los ámbitos social y académico. Aunque algunas áreas pudieran necesitar mayor tiempo de instrucción, cada área es de igual valor, pueden presentarse sin seguir un orden determinado y deben ser incorporadas a lo largo del año. Es importante señalar que codificar (escribir) y decodificar (leer) son destrezas recíprocas. La decodificación se internaliza cuando se ofrecen actividades táctiles y cinestésicas (codificación). Además, los estudiantes deben participar en conversaciones académicas, escribir, leer y se les debe leer diariamente en situaciones en las que puedan interactuar con contenidos intercurriculares y en donde ellos puedan elegir."}
        },
        {
            "competencyText": {"en-us": "El español, a diferencia del inglés, tiene una relación letra-sonido más cercana y claramente define los límites de las sílabas. La sílaba en español es una unidad más crítica de conciencia fonológica que en inglés debido a la consistente correspondencia fonema-grafema. Las sílabas son unidades importantes en el español debido a su fuerte efecto en el reconocimiento visual de las palabras (Carreiras et al., 1993) y a su esencial papel para predecir una lectura en español exitosa. Además, el español presenta un nivel mucho mayor de transparencia ortográfica que el inglés y no se apoya en palabras reconocibles visualmente para la decodificación. Esta transparencia ortográfica acelera el proceso de decodificación y el enfoque se dirige rápidamente a la fluidez y a la comprensión. Sin embargo, en inglés, las palabras reconocibles visualmente son utilizadas debido a la existencia de ciertas palabras que no son decodificables, como are y one. En español, los problemas de decodificación no predominan tanto como los problemas de comprensión. Estos aspectos específicos de la lengua española van a influir tanto en la metodología como en el desarrollo de la lectura."}
        },
        {
            "competencyText": {"en-us": "La complejidad del texto aumenta con un vocabulario más desafiante, con estructuras sofisticadas de las oraciones, con rasgos del texto sutiles, con un contenido cognitivo elevado y con relaciones sutiles entre las ideas (Agencia de Educación de Texas, descripciones de los niveles de desempeño de STAAR 2013). En la medida que se logre la adquisición de destrezas y conocimientos en cada una de las siete áreas, los estudiantes continuarán aplicando estándares previos con mayor profundidad en textos cada vez más complejos de múltiples géneros; a la vez, podrán convertirse en estudiantes independientes y críticos que trabajan de forma colaborativa, al mismo tiempo que utilizan continuamente sus destrezas metacognitivas."}
        },
        {
            "competencyText": {"en-us": "La investigación muestra de manera consistente que el desarrollo del lenguaje, y de la lectura y la escritura en la lengua materna de los estudiantes no sólo facilita el aprendizaje del idioma inglés, así como leerlo y escribirlo, sino que también es la base para el desarrollo cognitivo y el aprendizaje (Cummins, 2001; Thomas & Collier, 2002; Coelho, 2001). Los estudiantes bilingües emergentes (Sparrow et al., 2014; Slavin & Cheving. 2013) son aquéllos que están en el proceso de adquirir dos o más códigos lingüísticos para convertirse en personas bilingües, biletradas y biculturales. Los estudiantes bilingües emergentes son a menudo definidos por sus deficiencias aparentes (limitados en el manejo del lenguaje) (Escamilla, 2012). Sin embargo, la investigación ha mostrado que los bilingües desarrollan un sistema interdependiente único (Escamilla et al., 2007; Grosjean, 1989; Valdes and Figueroa, 1994), en el cual los idiomas se interconectan para incrementar la funcionalidad lingüística. Esta interdependencia lingüística en la adquisición del lenguaje facilita una transferencia de las habilidades de lectura y escritura del lenguaje primario (L1) al segundo lenguaje (L2) (August & Shanahan, 2006; Bialystok, 2007; Miramontes, et al., 1997). La solidez del aprendizaje a través de la instrucción formal en español determina el alcance de la transferencia al inglés (August, Calderon & Carlo, 2002; Slavin & Calderon, 2001; Garcia, 2001). Para que esta transferencia alcance su nivel máximo, se deben enseñar de forma explícita las conexiones interlingüísticas entre las dos lenguas mientras los estudiantes participan en el análisis del español y el inglés para ver sus similitudes y diferencias (Cummins, 2007). Un desarrollo sólido y continuo en la lectura y escritura en español aporta las bases y la estructura para el desarrollo de la lectura y escritura dado que existe entre los dos idiomas lo que se conoce como Dominio Común Subyacente (CUP, por sus siglas en inglés) (Cummins, 1991). En consecuencia, instrucción directa y sistemática (Genesee et al., 2005) en la secuencia apropiada de las destrezas en español, junto con instrucción temprana de lectura y escritura basada en el inglés como segundo idioma, es crucial para el éxito del estudiante. Como resultado de estar trabajando bajo dos sistemas lingüísticos, las destrezas metalingüísticas y metacognitivas de los estudiantes se fortalecen al aprender acerca de las similitudes y diferencias entre los idiomas (Escamilla et al., 2014). Hasta qué punto el inglés y el español son utilizados depende del tipo de modelo de programa bilingüe empleado (ver Código de Educación de Texas, §29.066)."}
        },
        {
            "competencyText": {"en-us": "Para los estudiantes que están aprendiendo inglés (estudiantes ELL, por sus siglas en inglés), se espera que cumplan ciertos estándares en un segundo idioma y que su desempeño en inglés impacte directamente su habilidad para cumplir estos estándares. La comprensión de un texto a través de las etapas en el aprendizaje del idioma inglés requiere de una estructura didáctica, como modificaciones textuales, traducciones, apoyo en el idioma materno, uso de cognados, resúmenes, fotografías, objetos comunes, glosarios, diccionarios bilingües y/o de sinónimos, y otras formas de apoyo comprensibles. El uso estratégico del lenguaje primario del estudiante es importante para asegurar el desarrollo lingüístico, afectivo, cognitivo y académico en inglés. Los estudiantes ELL pueden y deben ser motivados a usar lo que saben de su primer idioma para mejorar el desarrollo de su vocabulario; éste necesita estar en el contexto del discurso oral y escrito interconectado para que sea significativo."}
        },
        {
            "competencyText": {"en-us": "La investigación actual enfatiza la importancia de integrar eficazmente el aprendizaje del segundo idioma con una educación de calidad en el área de contenido para asegurar que los estudiantes ELL adquieran un dominio del lenguaje social y académico en inglés, aprendan conocimientos y destrezas, y alcancen su mayor potencial académico. La instrucción tiene que incluir los ajustes lingüísticos que corresponden con los Estándares de Desempeño del Idioma Inglés (ELPS, por sus siglas en inglés) y con los niveles de dominio del inglés del estudiante para asegurar que el dominio absoluto de los conocimientos y las destrezas en el currículum requerido sea accesible. Para una mayor comprensión de las necesidades del aprendizaje de un segundo idioma, favor de referirse a los ELPS y a las descripciones de los niveles de dominio adoptados en el Capítulo 74, subcapítulo A, de este apartado (relacionado con el currículo requerido)."}
        },
        {
            "competencyText": {"en-us": "El dominio del lenguaje oral por parte de los estudiantes juega un papel primordial para lograr el éxito escolar; su participación en actividades verbales tiene que alcanzar su nivel máximo a lo largo de los grados escolares (Kinsella, 2010). Para que ellos se conviertan en individuos pensantes y hábiles para expresarse oralmente en ciencias, estudios sociales, matemáticas, bellas artes, artes del lenguaje y lectura, así como en los programas técnicos y de estudios profesionales, tienen que tener múltiples oportunidades para practicar y aplicar el leguaje académico de cada disciplina (Fisher, Frey & Rothenberg, 2008)."}
        },
        {
            "competencyText": {"en-us": "Los enunciados que tienen la palabra “incluyendo” se refieren a contenidos que tienen que dominarse muy bien; aquéllos que tienen la expresión “tales como” tienen la intención de ser posibles ejemplos ilustrativos."}
        },
        {
            "competencyText": {"en-us": "Conocimientos y destrezas."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, discutir y pensar —lenguaje oral—. El estudiante desarrolla el lenguaje oral por medio de la actividad de escuchar, hablar y discutir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "escuche activamente para interpretar un mensaje, haga preguntas que aclaren y responda de manera apropiada;"}
        },
        {
            "competencyText": {"en-us": "siga y dé instrucciones orales que incluyen acciones de varios pasos;"}
        },
        {
            "competencyText": {"en-us": "haga una presentación organizada con una posición y postura específica empleando contacto visual, velocidad al hablar, volumen, enunciación, gestos naturales y las convenciones del lenguaje para comunicar las ideas efectivamente; y"}
        },
        {
            "competencyText": {"en-us": "participe en discusiones dirigidas por estudiantes induciendo y considerando las sugerencias de otros miembros del grupo, tomando apuntes e identificando puntos de acuerdo y de desacuerdo."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —inicio de la lectura y la escritura—. El estudiante desarrolla conocimiento de la estructura de las palabras a través de la conciencia fonológica, los conceptos impresos, la fonética y la morfología para comunicar, decodificar y escribir. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique conocimiento fonético al:"}
        },
        {
            "competencyText": {"en-us": "diferenciar entre términos que comúnmente se confunden, tales como porque/porqué/por qué/por que, asimismo (adverbio)/así mismo (de la misma manera), sino/si no y también/tan bien;"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras agudas, graves, esdrújulas y sobresdrújulas (palabras con énfasis en la última, penúltima y antepenúltima sílaba, y palabras con énfasis en la sílaba antes de la antepenúltima);"}
        },
        {
            "competencyText": {"en-us": "decodificar palabras con hiatos e diptongos; y"}
        },
        {
            "competencyText": {"en-us": "usar el conocimiento de los patrones de la división en sílabas y morfemas para decodificar palabras multisilábicas."}
        },
        {
            "competencyText": {"en-us": "demuestre y aplique el conocimiento ortográfico al:"}
        },
        {
            "competencyText": {"en-us": "escribir palabras agudas, graves, esdrújulas y sobresdrújulas (palabras con énfasis en la última, penúltima y antepenúltima sílaba, y palabras con énfasis en la sílaba antes de la antepenúltima);"}
        },
        {
            "competencyText": {"en-us": "marcar los acentos apropiadamente al conjugar verbos en los tiempos pasado simple y pasado imperfecto, condicional perfecto y futuro; y"}
        },
        {
            "competencyText": {"en-us": "escribir palabras con diptongos e hiatos; y"}
        },
        {
            "competencyText": {"en-us": "escriba legiblemente en letra cursiva."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —vocabulario—. El estudiante usa el vocabulario recién adquirido de forma expresiva. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "utilice recursos impresos o digitales para determinar el significado, la división en sílabas, la pronunciación, el origen de las palabras y las partes de la oración;"}
        },
        {
            "competencyText": {"en-us": "use el contexto, tal como definición, analogía y ejemplos, para clarificar el significado de las palabras;"}
        },
        {
            "competencyText": {"en-us": "determine el significado y uso de palabras en español al nivel de su grado académico que se derivan de las raíces griegas y latinas, incluyendo, metro-, grafo-, scrib- y port-; y"}
        },
        {
            "competencyText": {"en-us": "diferencie y use homógrafos, homófonos y términos que comúnmente se confunden, tales como porque/porqué/por qué/por que, sino/si no y también/tan bien."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —fluidez—. El estudiante lee textos al nivel del grado escolar con fluidez y los comprende. Se espera que el estudiante ajuste la fluidez cuando lee un texto al nivel de su grado escolar con base en el propósito de la lectura."}
        },
        {
            "competencyText": {"en-us": "Desarrollar y apoyar las destrezas fundamentales del lenguaje: escuchar, hablar, leer, escribir y pensar —lectura autodirigida—. El estudiante lee textos apropiados para su nivel escolar de forma independiente. Se espera que el estudiante autoseleccione el texto y lea independientemente por un período de tiempo prolongado."}
        },
        {
            "competencyText": {"en-us": "Habilidades de comprensión: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante usa habilidades metacognitivas para desarrollar y profundizar la comprensión de textos cada vez más complejos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "establezca un propósito para la lectura de textos asignados y autoseleccionados;"}
        },
        {
            "competencyText": {"en-us": "formule preguntas sobre el texto antes, durante y después de la lectura para profundizar la comprensión y obtener información;"}
        },
        {
            "competencyText": {"en-us": "haga y corrija o confirme predicciones utilizando los rasgos del texto, las características del género y las estructuras;"}
        },
        {
            "competencyText": {"en-us": "cree imágenes mentales para profundizar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "haga conexiones relacionadas con experiencias personales, ideas de otros textos y la sociedad;"}
        },
        {
            "competencyText": {"en-us": "haga inferencias y use evidencia para apoyar la comprensión;"}
        },
        {
            "competencyText": {"en-us": "evalúe los detalles leídos para determinar las ideas claves;"}
        },
        {
            "competencyText": {"en-us": "sintetice información para crear un nuevo entendimiento; y"}
        },
        {
            "competencyText": {"en-us": "revise la comprensión y haga ajustes, tales como releer, usar conocimiento previo, formular preguntas y hacer anotaciones cuando la comprensión se pierde."}
        },
        {
            "competencyText": {"en-us": "Habilidades para responder: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante responde a una variedad cada vez más desafiante de fuentes de información que lee, escucha o ve. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "describa conexiones personales respecto a una variedad de fuentes de información, incluyendo los textos autoseleccionados;"}
        },
        {
            "competencyText": {"en-us": "escriba respuestas que demuestren la comprensión de los textos, incluyendo la comparación de fuentes de información en y a través de varios géneros;"}
        },
        {
            "competencyText": {"en-us": "use evidencia textual para apoyar una respuesta apropiada;"}
        },
        {
            "competencyText": {"en-us": "parafrasee y resuma textos de manera que mantengan su significado y orden lógico;"}
        },
        {
            "competencyText": {"en-us": "interactúe con las fuentes de información de manera significativa, tal como al tomar apuntes, al hacer anotaciones, al escribir sobre un tema libre o al hacer ilustraciones;"}
        },
        {
            "competencyText": {"en-us": "responda usando el vocabulario recién adquirido según sea apropiado;"}
        },
        {
            "competencyText": {"en-us": "discuta y escriba sobre los significados explícitos e implícitos del texto;"}
        },
        {
            "competencyText": {"en-us": "responda oralmente o por escrito con un registro, vocabulario, tono y voz apropiados; y"}
        },
        {
            "competencyText": {"en-us": "reflexione y ajuste respuestas a medida que se presenta nueva evidencia."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —elementos literarios—. El estudiante reconoce y analiza elementos literarios dentro y a través del contenido cada vez más complejo de textos literarios tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "infiera múltiples temas dentro y a través de varios textos usando evidencia textual;"}
        },
        {
            "competencyText": {"en-us": "analice cómo las respuestas internas y externas de los personajes desarrollan la trama;"}
        },
        {
            "competencyText": {"en-us": "analice los elementos de la trama, incluyendo la acción ascendente, el punto culminante, la acción descendente, la resolución y elementos no lineales, tales como la escena retrospectiva; y"}
        },
        {
            "competencyText": {"en-us": "analice cómo el escenario, incluyendo escenarios históricos y culturales, influye en el desarrollo de los personajes y la trama."}
        },
        {
            "competencyText": {"en-us": "Múltiples géneros: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante reconoce y analiza las características, estructuras y propósitos específicos del género dentro y a través del contenido cada vez más complejo de textos tradicionales, contemporáneos, clásicos y diversos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "demuestre conocimiento de los géneros literarios, tales como ficción realista, historias de aventuras, ficción histórica, misterio, humor y mitos;"}
        },
        {
            "competencyText": {"en-us": "analice el efecto de la métrica y los elementos estructurales, tales como los cortes de línea en poemas, a través de una variedad de formas poéticas;"}
        },
        {
            "competencyText": {"en-us": "analice cómo los dramaturgos desarrollan personajes mediante el diálogo y la escenografía;"}
        },
        {
            "competencyText": {"en-us": "analice las características y los elementos estructurales del texto informativo, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "la idea central o tesis con la evidencia que la apoyan;"}
        },
        {
            "competencyText": {"en-us": "rasgos, tales como introducción, prólogo, prefacio, referencias o reconocimientos, para obtener información preliminar; y"}
        },
        {
            "competencyText": {"en-us": "patrones organizacionales, tales como definición, clasificación, ventaja y desventaja;"}
        },
        {
            "competencyText": {"en-us": "analice las características y estructuras del texto argumentativo al:"}
        },
        {
            "competencyText": {"en-us": "identificar la postura;"}
        },
        {
            "competencyText": {"en-us": "explicar cómo el autor utiliza varios tipos de evidencia para apoyar el argumento;"}
        },
        {
            "competencyText": {"en-us": "identificar al público o al lector al que va dirigido; y"}
        },
        {
            "competencyText": {"en-us": "analice las características de los textos multimodales y digitales."}
        },
        {
            "competencyText": {"en-us": "Propósito y arte del escritor: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante hace indagaciones críticas para analizar las decisiones de los autores y cómo éstas influyen y comunican significado dentro de una variedad de textos. El estudiante analiza y aplica el arte del escritor con el propósito de desarrollar sus propios productos y presentaciones. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "explique el propósito y mensaje del autor dentro de un texto;"}
        },
        {
            "competencyText": {"en-us": "analice cómo el uso de la estructura del texto contribuye al propósito del autor;"}
        },
        {
            "competencyText": {"en-us": "analice cómo usa el autor los aspectos impresos y gráficos para lograr propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "describa cómo el uso que hace el autor del lenguaje figurado, tal como las metáforas y la personificación, logran propósitos específicos;"}
        },
        {
            "competencyText": {"en-us": "identifique el uso de recursos literarios, incluyendo el punto de vista omnisciente y limitado, para lograr un propósito específico;"}
        },
        {
            "competencyText": {"en-us": "analice cómo el uso del lenguaje del autor contribuye al ambiente emocional del texto y a la voz que tiene; y"}
        },
        {
            "competencyText": {"en-us": "explique las diferencias entre recursos retóricos y falacias lógicas."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —proceso de escritura—. El estudiante utiliza el proceso de escritura en forma recurrente para redactar múltiples textos que sean legibles y usa las convenciones apropiadas. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "planifique un primer borrador seleccionando el género apropiado para un tópico, propósito y público específicos utilizando una variedad de estrategias, tales como la discusión, la lectura preliminar y los intereses personales;"}
        },
        {
            "competencyText": {"en-us": "desarrolle borradores para convertirlos en un texto enfocado, estructurado y coherente al:"}
        },
        {
            "competencyText": {"en-us": "organizar un texto con una estructura intencionada, incluyendo una introducción, transiciones, coherencia en y entre párrafos, y una conclusión; y"}
        },
        {
            "competencyText": {"en-us": "desarrollar una idea interesante que refleje la profundidad del pensamiento con hechos y detalles específicos;"}
        },
        {
            "competencyText": {"en-us": "revise borradores por claridad, desarrollo, estilo, selección de palabras y variedad de oraciones;"}
        },
        {
            "competencyText": {"en-us": "edite borradores usando las convenciones comunes de la lengua española, incluyendo:"}
        },
        {
            "competencyText": {"en-us": "oraciones completas complejas en donde haya concordancia entre sujeto y verbo y evitando oraciones con puntuación incorrecta, oraciones unidas sin puntuación y fragmentos;"}
        },
        {
            "competencyText": {"en-us": "uso consistente y apropiado de los tiempos verbales;"}
        },
        {
            "competencyText": {"en-us": "adverbios conjuntivos;"}
        },
        {
            "competencyText": {"en-us": "preposiciones y frases preposicionales y su influencia en la concordancia entre el sujeto y el verbo;"}
        },
        {
            "competencyText": {"en-us": "pronombres, incluyendo personales, posesivos, de objeto, reflexivos, preposicionales, indefinidos y relativos;"}
        },
        {
            "competencyText": {"en-us": "conjunciones subordinantes para formar oraciones complejas y conjunciones correlativas;"}
        },
        {
            "competencyText": {"en-us": "letra mayúscula en nombres propios, incluyendo abreviaturas, iniciales, acrónimos y organizaciones;"}
        },
        {
            "competencyText": {"en-us": "signos de puntuación, incluyendo el uso de la coma en oraciones complejas, en transiciones y en elementos introductorios; y"}
        },
        {
            "competencyText": {"en-us": "escritura correcta, incluyendo términos que comúnmente se confunden; y"}
        },
        {
            "competencyText": {"en-us": "publique la obra escrita para el público apropiado."}
        },
        {
            "competencyText": {"en-us": "Composición: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos —géneros—. El estudiante usa el arte del escritor y las características del género para redactar múltiples textos que sean significativos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "redacte textos literarios, tales como narraciones personales, ficción y poesía, utilizando el arte del escritor y las características del género para escribir;"}
        },
        {
            "competencyText": {"en-us": "redacte textos informativos, incluyendo ensayos de varios párrafos que transmiten información sobre un tópico, utilizando una idea central clara o tesis, el arte del escritor y las características del género para escribir;"}
        },
        {
            "competencyText": {"en-us": "redacte textos argumentativos de varios párrafos utilizando el arte del escritor y las características del género para escribir; y"}
        },
        {
            "competencyText": {"en-us": "redacte correspondencia que refleje una opinión, comunique una queja o solicite información siguiendo una estructura formal o amigable."}
        },
        {
            "competencyText": {"en-us": "Indagación e investigación: escuchar, hablar, leer, escribir y pensar utilizando múltiples textos. El estudiante se involucra en procesos de indagación a corto plazo y de forma recurrente y continua para una variedad de propósitos. Se espera que el estudiante:"}
        },
        {
            "competencyText": {"en-us": "formule preguntas seleccionadas por los estudiantes y guiadas por el profesor para la indagación formal e informal;"}
        },
        {
            "competencyText": {"en-us": "desarrolle y revise un plan;"}
        },
        {
            "competencyText": {"en-us": "refine la pregunta de investigación principal, si fuera necesario, guiado por las respuestas a una serie de preguntas secundarias;"}
        },
        {
            "competencyText": {"en-us": "identifique y recopile información relevante de una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "diferencie entre fuentes de información primarias y secundarias;"}
        },
        {
            "competencyText": {"en-us": "sintetice información de una variedad de fuentes de información;"}
        },
        {
            "competencyText": {"en-us": "reconozca la diferencia entre parafrasear y plagiar cuando se usan materiales de información;"}
        },
        {
            "competencyText": {"en-us": "examine fuentes de información por:"}
        },
        {
            "competencyText": {"en-us": "confiabilidad, credibilidad y parcialidad; y"}
        },
        {
            "competencyText": {"en-us": "razonamiento erróneo, tal como la hipérbole, las apelaciones a las emociones y el estereotipo;"}
        },
        {
            "competencyText": {"en-us": "muestre citas académicas y use materiales de información originales éticamente; y"}
        },
        {
            "competencyText": {"en-us": "utilice un modo apropiado de entrega, ya sea escrito, oral o multimodal, para presentar los resultados."}
        }
    ]
}