{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://teks-api.texasgateway.org/ims/case/v1p0/CFDocuments/0b4fa3a5-934a-586a-b300-8a56d0cf0a3d",
        "name": {"en-us": "Chapter 126. Technology Applications"},
        "description": {"en-us": "Chapter 126. Technology Applications"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "Subchapter A. Elementary"}
        },
        {
            "competencyText": {"en-us": "Technology Applications, Kindergarten-Grade 2, Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.6 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of the six strands in technology applications, students use creative thinking and innovative processes to construct knowledge and develop products. Students communicate and collaborate both locally and globally to reinforce and promote learning. Research and information fluency includes the acquisition and evaluation of digital content. Students develop critical-thinking, problem-solving, and decision-making skills by collecting, analyzing, and reporting digital information. Students practice digital citizenship by behaving responsibly while using technology tools and resources. Through the study of technology operations and concepts, students learn technology related terms, concepts, and data input strategies."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student uses creative thinking and innovative processes to construct knowledge and develop digital products. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply prior knowledge to develop new ideas, products, and processes;"}
        },
        {
            "competencyText": {"en-us": "create original products using a variety of resources;"}
        },
        {
            "competencyText": {"en-us": "explore virtual environments, simulations, models, and programming languages to enhance learning;"}
        },
        {
            "competencyText": {"en-us": "create and execute steps to accomplish a task; and"}
        },
        {
            "competencyText": {"en-us": "evaluate and modify steps to accomplish a task."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student collaborates and communicates both locally and globally using digital tools and resources to reinforce and promote learning. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use communication tools that allow for anytime, anywhere access to interact, collaborate, or publish with peers locally and globally;"}
        },
        {
            "competencyText": {"en-us": "participate in digital environments to develop cultural understanding by interacting with learners of multiple cultures;"}
        },
        {
            "competencyText": {"en-us": "format digital information, including font attributes, color, white space, graphics, and animation, for a defined audience and communication medium; and"}
        },
        {
            "competencyText": {"en-us": "select, store, and deliver products using a variety of media, formats, devices, and virtual environments."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student acquires and evaluates digital content. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use search strategies to access information to guide inquiry;"}
        },
        {
            "competencyText": {"en-us": "use research skills to build a knowledge base regarding a topic, task, or assignment; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the usefulness of acquired digital content."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student applies critical-thinking skills to solve problems, guide research, and evaluate projects using digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify what is known and unknown and what needs to be known regarding a problem and explain the steps to solve the problem;"}
        },
        {
            "competencyText": {"en-us": "evaluate the appropriateness of a digital tool to achieve the desired product;"}
        },
        {
            "competencyText": {"en-us": "evaluate products prior to final submission; and"}
        },
        {
            "competencyText": {"en-us": "collect, analyze, and represent data using tools such as word processing, spreadsheets, graphic organizers, charts, multimedia, simulations, models, and programming languages."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student practices safe, responsible, legal, and ethical behavior while using digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "adhere to acceptable use policies reflecting appropriate behavior in a digital environment;"}
        },
        {
            "competencyText": {"en-us": "comply with acceptable digital safety rules, fair use guidelines, and copyright laws; and"}
        },
        {
            "competencyText": {"en-us": "practice the responsible use of digital information regarding intellectual property, including software, text, images, audio, and video."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates knowledge and appropriate use of technology systems, concepts, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use appropriate terminology regarding basic hardware, software applications, programs, networking, virtual environments, and emerging technologies;"}
        },
        {
            "competencyText": {"en-us": "use appropriate digital tools and resources for storage, access, file management, collaboration, and designing solutions to problems;"}
        },
        {
            "competencyText": {"en-us": "perform basic software application functions, including opening an application and creating, modifying, printing, and saving files;"}
        },
        {
            "competencyText": {"en-us": "use a variety of input, output, and storage devices;"}
        },
        {
            "competencyText": {"en-us": "use proper keyboarding techniques such as ergonomically correct hand and body positions appropriate for Kindergarten-Grade 2 learning;"}
        },
        {
            "competencyText": {"en-us": "demonstrate keyboarding techniques for operating the alphabetic, numeric, punctuation, and symbol keys appropriate for Kindergarten-Grade 2 learning; and"}
        },
        {
            "competencyText": {"en-us": "use the help feature online and in applications."}
        },
        {
            "competencyText": {"en-us": "Technology Applications, Grades 3-5, Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.7 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of the six strands in technology applications, students use creative thinking and innovative processes to construct knowledge and develop products. Students communicate and collaborate both locally and globally to reinforce and promote learning. Research and information fluency includes the acquisition and evaluation of digital content. Students develop critical-thinking, problem-solving, and decision-making skills by collecting, analyzing, and reporting digital information. Students practice digital citizenship by behaving responsibly while using technology tools and resources. Through the study of technology operations and concepts, students learn technology related terms, concepts, and data input strategies."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student uses creative thinking and innovative processes to construct knowledge and develop digital products. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create original products using a variety of resources;"}
        },
        {
            "competencyText": {"en-us": "analyze trends and forecast possibilities, developing steps for the creation of an innovative process or product; and"}
        },
        {
            "competencyText": {"en-us": "use virtual environments to explore systems and issues."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student collaborates and communicates both locally and globally using digital tools and resources to reinforce and promote learning. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "draft, edit, and publish products in different media individually and collaboratively;"}
        },
        {
            "competencyText": {"en-us": "use font attributes, color, white space, and graphics to ensure that products are appropriate for multiple communication media, including monitor display, web, and print;"}
        },
        {
            "competencyText": {"en-us": "collaborate effectively through personal learning communities and social environments;"}
        },
        {
            "competencyText": {"en-us": "select and use appropriate collaboration tools;"}
        },
        {
            "competencyText": {"en-us": "evaluate the product for relevance to the assignment or task; and"}
        },
        {
            "competencyText": {"en-us": "perform basic software application functions, including opening applications and creating, modifying, printing, and saving files."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student acquires and evaluates digital content. The student is expected to:"}
        },
        {
            "competencyLabel": {"en-us": "use various search strategies such as keyword(s); the Boolea"},
            "competencyText": {"en-us": "use various search strategies such as keyword(s); the Boolean identifiers <i>and<\/i>, <i>or<\/i>, and <i>not<\/i>; and other strategies appropriate to specific search engines;"}
        },
        {
            "competencyText": {"en-us": "collect and organize information from a variety of formats, including text, audio, video, and graphics;"}
        },
        {
            "competencyText": {"en-us": "validate and evaluate the relevance and appropriateness of information; and"}
        },
        {
            "competencyText": {"en-us": "acquire information appropriate to specific tasks."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student researches and evaluates projects using digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify information regarding a problem and explain the steps toward the solution;"}
        },
        {
            "competencyText": {"en-us": "collect, analyze, and represent data to solve problems using tools such as word processing, databases, spreadsheets, graphic organizers, charts, multimedia, simulations, models, and programming languages;"}
        },
        {
            "competencyText": {"en-us": "evaluate student-created products through self and peer review for relevance to the assignment or task; and"}
        },
        {
            "competencyText": {"en-us": "evaluate technology tools applicable for solving problems."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student practices safe, responsible, legal, and ethical behavior while using digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "adhere to acceptable use policies reflecting positive social behavior in the digital environment;"}
        },
        {
            "competencyText": {"en-us": "respect the intellectual property of others;"}
        },
        {
            "competencyText": {"en-us": "abide by copyright law and the Fair Use Guidelines for Educational Multimedia;"}
        },
        {
            "competencyText": {"en-us": "protect and honor the individual privacy of oneself and others;"}
        },
        {
            "competencyText": {"en-us": "follow the rules of digital etiquette;"}
        },
        {
            "competencyText": {"en-us": "practice safe, legal, and responsible use of information and technology; and"}
        },
        {
            "competencyText": {"en-us": "comply with fair use guidelines and digital safety rules."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates knowledge and appropriate use of technology systems, concepts, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of technology concepts, including terminology for the use of operating systems, network systems, virtual systems, and learning systems appropriate for Grades 3-5 learning;"}
        },
        {
            "competencyText": {"en-us": "manipulate files using appropriate naming conventions; file management, including folder structures and tagging; and file conversions;"}
        },
        {
            "competencyText": {"en-us": "navigate systems and applications accessing peripherals both locally and remotely;"}
        },
        {
            "competencyText": {"en-us": "troubleshoot minor technical problems with hardware and software using available resources such as online help and knowledge bases; and"}
        },
        {
            "competencyText": {"en-us": "use proper touch keyboarding techniques and ergonomic strategies such as correct hand and body positions and smooth and rhythmic keystrokes."}
        },
        {
            "competencyText": {"en-us": "Subchapter B. Middle School"}
        },
        {
            "competencyText": {"en-us": "Technology Applications, Grade 6, Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.14 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Districts have the flexibility of offering technology applications in a variety of settings. Districts are encouraged to offer technology applications in all content areas. This content may also be offered in a specific class while being integrated in all content areas."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of technology applications, students make informed decisions by understanding current and emerging technologies, including technology systems, appropriate digital tools, and personal learning networks. As competent researchers and responsible digital citizens, students use creative and computational thinking to solve problems while developing career and college readiness skills."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student uses creative thinking and innovative processes to construct knowledge, generate new ideas, and create products. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify, create, and use files in various formats such as text, raster and vector graphics, video, and audio files;"}
        },
        {
            "competencyText": {"en-us": "create original works as a means of personal or group expression;"}
        },
        {
            "competencyText": {"en-us": "explore complex systems or issues using models, simulations, and new technologies to make predictions, modify input, and review results; and"}
        },
        {
            "competencyText": {"en-us": "discuss trends and possible outcomes."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student collaborates and communicates both locally and globally to reinforce and promote learning. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "participate in personal learning networks to collaborate with peers, experts, or others using digital tools such as blogs, wikis, audio/video communication, or other emerging technologies;"}
        },
        {
            "competencyText": {"en-us": "communicate effectively with multiple audiences using a variety of media and formats; and"}
        },
        {
            "competencyText": {"en-us": "read and discuss examples of technical writing."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student acquires, analyzes, and manages content from digital resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create a research plan to guide inquiry;"}
        },
        {
            "competencyText": {"en-us": "discuss and use various search strategies, including keyword(s) and Boolean operators;"}
        },
        {
            "competencyText": {"en-us": "select and evaluate various types of digital resources for accuracy and validity; and"}
        },
        {
            "competencyText": {"en-us": "process data and communicate results."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student makes informed decisions by applying critical-thinking and problem-solving skills. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and define relevant problems and significant questions for investigation;"}
        },
        {
            "competencyText": {"en-us": "plan and manage activities to develop a solution, design a computer program, or complete a project;"}
        },
        {
            "competencyText": {"en-us": "collect and analyze data to identify solutions and make informed decisions;"}
        },
        {
            "competencyText": {"en-us": "use multiple processes and diverse perspectives to explore alternative solutions;"}
        },
        {
            "competencyText": {"en-us": "make informed decisions and support reasoning; and"}
        },
        {
            "competencyText": {"en-us": "transfer current knowledge to the learning of newly encountered technologies."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student practices safe, responsible, legal, and ethical behavior while using technology tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "understand copyright principles, including current laws, fair use guidelines, creative commons, open source, and public domain;"}
        },
        {
            "competencyText": {"en-us": "practice ethical acquisition of information and standard methods for citing sources;"}
        },
        {
            "competencyText": {"en-us": "practice safe and appropriate online behavior, personal security guidelines, digital identity, digital etiquette, and acceptable use of technology; and"}
        },
        {
            "competencyText": {"en-us": "understand the negative impact of inappropriate technology use, including online bullying and harassment, hacking, intentional virus setting, invasion of privacy, and piracy such as software, music, video, and other media."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a thorough understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define and use current technology terminology appropriately;"}
        },
        {
            "competencyText": {"en-us": "select technology tools based on licensing, application, and support;"}
        },
        {
            "competencyText": {"en-us": "identify, understand, and use operating systems;"}
        },
        {
            "competencyText": {"en-us": "understand and use software applications, including selecting and using software for a defined task;"}
        },
        {
            "competencyText": {"en-us": "identify, understand, and use hardware systems;"}
        },
        {
            "competencyText": {"en-us": "understand troubleshooting techniques such as restarting systems, checking power issues, resolving software compatibility, verifying network connectivity, connecting to remote resources, and modifying display properties;"}
        },
        {
            "competencyText": {"en-us": "demonstrate effective file management strategies such as file naming conventions, location, backup, hierarchy, folder structure, file conversion, tags, labels, and emerging digital organizational strategies;"}
        },
        {
            "competencyText": {"en-us": "discuss how changes in technology throughout history have impacted various areas of study;"}
        },
        {
            "competencyText": {"en-us": "discuss the relevance of technology as it applies to college and career readiness, life-long learning, and daily living;"}
        },
        {
            "competencyText": {"en-us": "use a variety of local and remote input sources;"}
        },
        {
            "competencyText": {"en-us": "use keyboarding techniques and ergonomic strategies while building speed and accuracy;"}
        },
        {
            "competencyText": {"en-us": "create and edit files with productivity tools, including:"}
        },
        {
            "competencyText": {"en-us": "plan and create non-linear media projects using graphic design principles; and"}
        },
        {
            "competencyText": {"en-us": "integrate two or more technology tools to create a new digital product."}
        },
        {
            "competencyText": {"en-us": "Technology Applications, Grade 7, Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.15 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Districts have the flexibility of offering technology applications in a variety of settings. Districts are encouraged to offer technology applications in all content areas. This content may also be offered in a specific class while being integrated in all content areas."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of technology applications, students make informed decisions by understanding current and emerging technologies, including technology systems, appropriate digital tools, and personal learning networks. As competent researchers and responsible digital citizens, students use creative and computational thinking to solve problems while developing career and college readiness skills."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student uses creative thinking and innovative processes to construct knowledge, generate new ideas, and create products. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify, create, and use files in various formats such as text, raster and vector graphics, video, and audio files;"}
        },
        {
            "competencyText": {"en-us": "create and present original works as a means of personal or group expression;"}
        },
        {
            "competencyText": {"en-us": "explore complex systems or issues using models, simulations, and new technologies to make predictions, modify input, and review results; and"}
        },
        {
            "competencyText": {"en-us": "discuss trends and make predictions."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student collaborates and communicates both locally and globally to reinforce and promote learning. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create personal learning networks to collaborate and publish with peers, experts, or others using digital tools such as blogs, wikis, audio/video communication, or other emerging technologies;"}
        },
        {
            "competencyText": {"en-us": "communicate effectively with multiple audiences using a variety of media and formats; and"}
        },
        {
            "competencyText": {"en-us": "create products using technical writing strategies."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student acquires, analyzes, and manages content from digital resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create a research plan to guide inquiry;"}
        },
        {
            "competencyText": {"en-us": "use and evaluate various search strategies, including keyword(s) and Boolean operators;"}
        },
        {
            "competencyText": {"en-us": "select and evaluate various types of digital resources for accuracy and validity; and"}
        },
        {
            "competencyText": {"en-us": "process data and communicate results."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student makes informed decisions by applying critical-thinking and problem-solving skills. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and define relevant problems and significant questions for investigation;"}
        },
        {
            "competencyText": {"en-us": "plan and manage activities to develop a solution, design a computer program, or complete a project;"}
        },
        {
            "competencyText": {"en-us": "collect and analyze data to identify solutions and make informed decisions;"}
        },
        {
            "competencyText": {"en-us": "use multiple processes and diverse perspectives to explore alternative solutions;"}
        },
        {
            "competencyText": {"en-us": "make informed decisions and support reasoning; and"}
        },
        {
            "competencyText": {"en-us": "transfer current knowledge to the learning of newly encountered technologies."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student practices safe, responsible, legal, and ethical behavior while using technology tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "understand and practice copyright principles, including current fair use guidelines, creative commons, open source, and public domain;"}
        },
        {
            "competencyText": {"en-us": "practice ethical acquisition of information and standard methods for citing sources;"}
        },
        {
            "competencyText": {"en-us": "practice and explain safe and appropriate online behavior, personal security guidelines, digital identity, digital etiquette, and acceptable use of technology; and"}
        },
        {
            "competencyText": {"en-us": "understand the negative impact of inappropriate technology use, including online bullying and harassment, hacking, intentional virus setting, invasion of privacy, and piracy such as software, music, video, and other media."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a thorough understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define and use current technology terminology appropriately;"}
        },
        {
            "competencyText": {"en-us": "select and apply technology tools based on licensing, application, and support;"}
        },
        {
            "competencyText": {"en-us": "identify, understand, and use operating systems;"}
        },
        {
            "competencyText": {"en-us": "understand and use software applications, including selecting and using software for a defined task;"}
        },
        {
            "competencyText": {"en-us": "identify, understand, and use hardware systems;"}
        },
        {
            "competencyText": {"en-us": "understand troubleshooting techniques such as restarting systems, checking power issues, resolving software compatibility, verifying network connectivity, connecting to remote resources, and modifying display properties;"}
        },
        {
            "competencyText": {"en-us": "implement effective file management strategies such as file naming conventions, location, backup, hierarchy, folder structure, file conversion, tags, labels, and emerging digital organizational strategies;"}
        },
        {
            "competencyText": {"en-us": "explain how changes in technology throughout history have impacted various areas of study;"}
        },
        {
            "competencyText": {"en-us": "explain the relevance of technology as it applies to college and career readiness, life-long learning, and daily living;"}
        },
        {
            "competencyText": {"en-us": "use a variety of local and remote input sources;"}
        },
        {
            "competencyText": {"en-us": "use keyboarding techniques and ergonomic strategies while building speed and accuracy;"}
        },
        {
            "competencyText": {"en-us": "create and edit files with productivity tools, including:"}
        },
        {
            "competencyText": {"en-us": "plan and create non-linear media projects using graphic design principles; and"}
        },
        {
            "competencyText": {"en-us": "integrate two or more technology tools to create a new digital product."}
        },
        {
            "competencyText": {"en-us": "Technology Applications, Grade 8, Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.16 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Districts have the flexibility of offering technology applications in a variety of settings. Districts are encouraged to offer technology applications in all content areas. This content may also be offered in a specific class while being integrated in all content areas."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of technology applications, students make informed decisions by understanding current and emerging technologies, including technology systems, appropriate digital tools, and personal learning networks. As competent researchers and responsible digital citizens, students use creative and computational thinking to solve problems while developing career and college readiness skills."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student uses creative thinking and innovative processes to construct knowledge, generate new ideas, and create products. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify, create, and use files in various formats, including text, raster and vector graphics, video, and audio files;"}
        },
        {
            "competencyText": {"en-us": "create, present, and publish original works as a means of personal or group expression;"}
        },
        {
            "competencyText": {"en-us": "explore complex systems or issues using models, simulations, and new technologies to develop hypotheses, modify input, and analyze results; and"}
        },
        {
            "competencyText": {"en-us": "analyze trends and forecast possibilities."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student collaborates and communicates both locally and globally to reinforce and promote learning. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create and manage personal learning networks to collaborate and publish with peers, experts, or others using digital tools such as blogs, wikis, audio/video communication, or other emerging technologies;"}
        },
        {
            "competencyText": {"en-us": "communicate effectively with multiple audiences using a variety of media and formats; and"}
        },
        {
            "competencyText": {"en-us": "create and publish products using technical writing strategies."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student acquires, analyzes, and manages content from digital resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create a research plan to guide inquiry;"}
        },
        {
            "competencyText": {"en-us": "plan, use, and evaluate various search strategies, including keyword(s) and Boolean operators;"}
        },
        {
            "competencyText": {"en-us": "select and evaluate various types of digital resources for accuracy and validity; and"}
        },
        {
            "competencyText": {"en-us": "process data and communicate results."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student makes informed decisions by applying critical-thinking and problem-solving skills. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and define relevant problems and significant questions for investigation;"}
        },
        {
            "competencyText": {"en-us": "plan and manage activities to develop a solution, design a computer program, or complete a project;"}
        },
        {
            "competencyText": {"en-us": "collect and analyze data to identify solutions and make informed decisions;"}
        },
        {
            "competencyText": {"en-us": "use multiple processes and diverse perspectives to explore alternative solutions;"}
        },
        {
            "competencyText": {"en-us": "make informed decisions and support reasoning; and"}
        },
        {
            "competencyText": {"en-us": "transfer current knowledge to the learning of newly encountered technologies."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student practices safe, responsible, legal, and ethical behavior while using technology tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "understand, explain, and practice copyright principles, including current laws, fair use guidelines, creative commons, open source, and public domain;"}
        },
        {
            "competencyText": {"en-us": "practice and explain ethical acquisition of information and standard methods for citing sources;"}
        },
        {
            "competencyText": {"en-us": "practice and explain safe and appropriate online behavior, personal security guidelines, digital identity, digital etiquette, and acceptable use of technology; and"}
        },
        {
            "competencyText": {"en-us": "understand and explain the negative impact of inappropriate technology use, including online bullying and harassment, hacking, intentional virus setting, invasion of privacy, and piracy such as software, music, video, and other media."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a thorough understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define and use current technology terminology appropriately;"}
        },
        {
            "competencyText": {"en-us": "evaluate and select technology tools based on licensing, application, and support;"}
        },
        {
            "competencyText": {"en-us": "identify, understand, and use operating systems;"}
        },
        {
            "competencyText": {"en-us": "understand and use software applications, including selecting and using software for a defined task;"}
        },
        {
            "competencyText": {"en-us": "identify, understand, and use hardware systems;"}
        },
        {
            "competencyText": {"en-us": "apply troubleshooting techniques, including restarting systems, checking power issues, resolving software compatibility, verifying network connectivity, connecting to remote resources, and modifying display properties;"}
        },
        {
            "competencyText": {"en-us": "implement effective file management strategies such as file naming conventions, location, backup, hierarchy, folder structure, file conversion, tags, labels, and emerging digital organizational strategies;"}
        },
        {
            "competencyText": {"en-us": "evaluate how changes in technology throughout history have impacted various areas of study;"}
        },
        {
            "competencyText": {"en-us": "evaluate the relevance of technology as it applies to college and career readiness, life-long learning, and daily living;"}
        },
        {
            "competencyText": {"en-us": "use a variety of local and remote input sources;"}
        },
        {
            "competencyText": {"en-us": "use keyboarding techniques and ergonomic strategies while building speed and accuracy;"}
        },
        {
            "competencyText": {"en-us": "create and edit files with productivity tools, including:"}
        },
        {
            "competencyText": {"en-us": "plan and create non-linear media projects using graphic design principles; and"}
        },
        {
            "competencyText": {"en-us": "integrate two or more technology tools to create a new digital product."}
        },
        {
            "competencyText": {"en-us": "Subchapter C. High School"}
        },
        {
            "competencyText": {"en-us": "Fundamentals of Computer Science (One-Half to One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.32 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. The prerequisite for this course is proficiency in the knowledge and skills relating to Technology Applications, Grades 6-8. This course is recommended for students in Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Fundamentals of Computer Science is intended as a first course for those students just beginning the study of computer science. Students will learn about the computing tools that are used every day. Students will foster their creativity and innovation through opportunities to design, implement, and present solutions to real-world problems. Students will collaborate and use computer science concepts to access, analyze, and evaluate information needed to solve problems. Students will learn the problem-solving and reasoning skills that are the foundation of computer science. By using computer science knowledge and skills that support the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results. Students will learn digital citizenship by researching current laws and regulations and by practicing integrity and respect. Students will gain an understanding of the principles of computer science through the study of technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student develops products and generates new understanding by extending existing knowledge. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate and explore various career opportunities within the computer science field and report findings through various media;"}
        },
        {
            "competencyText": {"en-us": "create and publish interactive stories, games, and animations;"}
        },
        {
            "competencyText": {"en-us": "create and publish interactive animations;"}
        },
        {
            "competencyText": {"en-us": "create algorithms for the solution of various problems;"}
        },
        {
            "competencyText": {"en-us": "create web pages using a mark-up language;"}
        },
        {
            "competencyText": {"en-us": "use the Internet to create and publish solutions; and"}
        },
        {
            "competencyText": {"en-us": "design creative and effective user interfaces."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student communicates and collaborates with peers to contribute to his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "seek and respond to advice from peers and professionals in evaluating problem solutions;"}
        },
        {
            "competencyText": {"en-us": "debug and solve problems using reference materials and effective strategies; and"}
        },
        {
            "competencyText": {"en-us": "publish information in a variety of ways such as print, monitor display, web pages, and video."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student locates, analyzes, processes, and organizes data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "construct appropriate electronic search strategies; and"}
        },
        {
            "competencyText": {"en-us": "use a variety of resources, including other subject areas, together with various productivity tools to gather authentic data as a basis for individual and group programming projects."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses appropriate strategies to analyze problems and design algorithms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate the ability to insert applets into web pages;"}
        },
        {
            "competencyText": {"en-us": "find, download, and insert scripting code into web pages to enhance interactivity;"}
        },
        {
            "competencyText": {"en-us": "understand binary representation of data in computer systems, perform conversions between decimal and binary number systems, and count in binary number systems;"}
        },
        {
            "competencyText": {"en-us": "read and define a problem's description, purpose, and goals;"}
        },
        {
            "competencyText": {"en-us": "demonstrate coding proficiency in a contemporary programming language by developing solutions that create stories, games, and animations;"}
        },
        {
            "competencyText": {"en-us": "choose, identify, and use the appropriate data type to properly represent data in a problem solution;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and use variables within a programmed story, game, or animation;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of arithmetic operators to create mathematical expressions, including addition, subtraction, multiplication, real division, integer division, and modulus division;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and use sequence within a programmed story, game, or animation;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and use conditional statements within a programmed story, game, or animation;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and use iteration within a programmed story, game, or animation;"}
        },
        {
            "competencyText": {"en-us": "create an interactive story, game, or animation;"}
        },
        {
            "competencyText": {"en-us": "use random numbers within a programmed story, game, or animation; and"}
        },
        {
            "competencyText": {"en-us": "test program solutions by investigating valid and invalid data."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student explores and understands safety, legal, cultural, and societal issues relating to the use of technology and information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "discuss copyright laws/issues and model ethical acquisition of digital information by citing sources using established methods;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette and knowledge of acceptable use policies when using networks, especially resources on the Internet and on intranets;"}
        },
        {
            "competencyText": {"en-us": "investigate measures such as passwords or virus detection/prevention to protect computer systems and databases from unauthorized use and tampering;"}
        },
        {
            "competencyText": {"en-us": "understand the safety risks associated with the use of social networking sites;"}
        },
        {
            "competencyText": {"en-us": "discuss the impact of computing and computing related advancements on society; and"}
        },
        {
            "competencyText": {"en-us": "determine the reliability of information available through electronic media."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student understands technology concepts, systems, and operations as they apply to computer science. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of the basic computer components, including a central processing unit (CPU), storage, and input/output devices;"}
        },
        {
            "competencyText": {"en-us": "use operating system tools, including appropriate file management;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge and appropriate use of different operating systems;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge and understanding of basic network connectivity;"}
        },
        {
            "competencyText": {"en-us": "describe, compare, and contrast the differences between an application and an operating system; and"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and appropriately use various input, processing, output, and primary/secondary storage devices."}
        },
        {
            "competencyText": {"en-us": "Computer Science I (One-Half to One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.33 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. The required prerequisite for this course is Algebra I. This course is recommended for students in Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Computer Science I will foster students' creativity and innovation by presenting opportunities to design, implement, and present meaningful programs through a variety of media. Students will collaborate with one another, their instructor, and various electronic communities to solve the problems presented throughout the course. Through data analysis, students will identify task requirements, plan search strategies, and use computer science concepts to access, analyze, and evaluate information needed to solve problems. By using computer science knowledge and skills that support the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results. Students will learn digital citizenship by researching current laws and regulations and by practicing integrity and respect. Students will gain an understanding of the principles of computer science through the study of technology operations, systems, and concepts."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student develops products and generates new understandings by extending existing knowledge. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "participate with electronic communities as a learner, initiator, contributor, and teacher/mentor;"}
        },
        {
            "competencyText": {"en-us": "extend the learning environment beyond the school walls with digital products created to increase teaching and learning in the other subject areas; and"}
        },
        {
            "competencyText": {"en-us": "participate in relevant, meaningful activities in the larger community and society to create electronic projects."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student communicates and collaborates with peers to contribute to his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create and properly display meaningful output;"}
        },
        {
            "competencyText": {"en-us": "create interactive console display interfaces, with appropriate user prompts, to acquire data from a user;"}
        },
        {
            "competencyText": {"en-us": "use Graphical User Interfaces (GUIs) to create interactive interfaces to acquire data from a user and display program results;"}
        },
        {
            "competencyText": {"en-us": "write programs with proper programming style to enhance the readability and functionality of the code by using meaningful descriptive identifiers, internal comments, white space, spacing, indentation, and a standardized program style;"}
        },
        {
            "competencyText": {"en-us": "improve numeric display by optimizing data visualization;"}
        },
        {
            "competencyText": {"en-us": "display simple vector graphics using lines, circles, and rectangles;"}
        },
        {
            "competencyText": {"en-us": "display simple bitmap images; and"}
        },
        {
            "competencyText": {"en-us": "seek and respond to advice from peers and professionals in evaluating quality and accuracy."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student locates, analyzes, processes, and organizes data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use a variety of resources, including foundation and enrichment curricula, to gather authentic data as a basis for individual and group programming projects; and"}
        },
        {
            "competencyText": {"en-us": "use various productivity tools to gather authentic data as a basis for individual and group programming projects."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses appropriate strategies to analyze problems and design algorithms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use program design problem-solving strategies to create program solutions;"}
        },
        {
            "competencyText": {"en-us": "define and specify the purpose and goals of solving a problem;"}
        },
        {
            "competencyText": {"en-us": "identify the subtasks needed to solve a problem;"}
        },
        {
            "competencyText": {"en-us": "identify the data types and objects needed to solve a problem;"}
        },
        {
            "competencyText": {"en-us": "identify reusable components from existing code;"}
        },
        {
            "competencyText": {"en-us": "design a solution to a problem;"}
        },
        {
            "competencyText": {"en-us": "code a solution from a program design;"}
        },
        {
            "competencyText": {"en-us": "identify and debug errors;"}
        },
        {
            "competencyText": {"en-us": "test program solutions with appropriate valid and invalid test data for correctness;"}
        },
        {
            "competencyText": {"en-us": "debug and solve problems using error messages, reference materials, language documentation, and effective strategies;"}
        },
        {
            "competencyText": {"en-us": "explore common algorithms, including finding greatest common divisor, finding the biggest number out of three, finding primes, making change, and finding the average;"}
        },
        {
            "competencyText": {"en-us": "analyze and modify existing code to improve the underlying algorithm;"}
        },
        {
            "competencyText": {"en-us": "create program solutions that exhibit robust behavior by understanding, avoiding, and preventing runtime errors, including division by zero and type mismatch;"}
        },
        {
            "competencyText": {"en-us": "select the most appropriate algorithm for a defined problem;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of the arithmetic operators to create mathematical expressions, including addition, subtraction, multiplication, real division, integer division, and modulus division;"}
        },
        {
            "competencyText": {"en-us": "create program solutions to problems using available mathematics libraries, including absolute value, round, power, square, and square root;"}
        },
        {
            "competencyText": {"en-us": "develop program solutions that use assignment;"}
        },
        {
            "competencyText": {"en-us": "develop sequential algorithms to solve non-branching and non-iterative problems;"}
        },
        {
            "competencyText": {"en-us": "develop algorithms to decision-making problems using branching control statements;"}
        },
        {
            "competencyText": {"en-us": "develop iterative algorithms and code programs to solve practical problems;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of the relational operators;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of the logical operators; and"}
        },
        {
            "competencyText": {"en-us": "generate and use random numbers."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student explores and understands safety, legal, cultural, and societal issues relating to the use of technology and information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "discuss intellectual property, privacy, sharing of information, copyright laws, and software licensing agreements;"}
        },
        {
            "competencyText": {"en-us": "model ethical acquisition and use of digital information;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette, responsible use of software, and knowledge of acceptable use policies;"}
        },
        {
            "competencyText": {"en-us": "investigate measures, including passwords and virus detection/prevention, to protect computer systems and databases from unauthorized use and tampering; and"}
        },
        {
            "competencyText": {"en-us": "investigate how technology has changed and the social and ethical ramifications of computer usage."}
        },
        {
            "competencyText": {"en-us": "Technology operations, systems, and concepts. The student understands technology concepts, systems, and operations as they apply to computer science. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare and contrast types of operating systems, software applications, and programming languages;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of major hardware components, including primary and secondary memory, a central processing unit (CPU), and peripherals;"}
        },
        {
            "competencyText": {"en-us": "differentiate among current programming languages, discuss the use of those languages in other fields of study, and demonstrate knowledge of specific programming terminology and concepts;"}
        },
        {
            "competencyText": {"en-us": "differentiate between a high-level compiled language and an interpreted language;"}
        },
        {
            "competencyText": {"en-us": "understand concepts of object-oriented design;"}
        },
        {
            "competencyText": {"en-us": "use local and global scope access variable declarations;"}
        },
        {
            "competencyText": {"en-us": "encapsulate data and associated subroutines into an abstract data type;"}
        },
        {
            "competencyText": {"en-us": "create subroutines that do not return values with and without the use of arguments and parameters;"}
        },
        {
            "competencyText": {"en-us": "create subroutines that return typed values with and without the use of arguments and parameters;"}
        },
        {
            "competencyText": {"en-us": "understand and identify the data-binding process between arguments and parameters;"}
        },
        {
            "competencyText": {"en-us": "compare objects using reference values and a comparison routine;"}
        },
        {
            "competencyText": {"en-us": "understand the binary representation of numeric and nonnumeric data in computer systems;"}
        },
        {
            "competencyText": {"en-us": "understand the finite limits of numeric data;"}
        },
        {
            "competencyText": {"en-us": "perform numerical conversions between the decimal and binary number systems and count in the binary number system;"}
        },
        {
            "competencyText": {"en-us": "choose, identify, and use the appropriate data types for integer, real, and Boolean data when writing program solutions;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the concept of a variable;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and use reference variables for objects;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of how to represent and manipulate text data, including concatenation and other string functions;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the concept of scope;"}
        },
        {
            "competencyText": {"en-us": "identify and use the structured data type of one-dimensional arrays to traverse, search, and modify data;"}
        },
        {
            "competencyText": {"en-us": "choose, identify, and use the appropriate data type and structure to properly represent the data in a program problem solution; and"}
        },
        {
            "competencyText": {"en-us": "compare and contrast strongly typed and un-typed programming languages."}
        },
        {
            "competencyText": {"en-us": "Computer Science II (One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.34 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. The required prerequisites for this course are Algebra I and either Computer Science I or Fundamentals of Computer Science. This course is recommended for students in Grades 11 and 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Computer Science II will foster students' creativity and innovation by presenting opportunities to design, implement, and present meaningful programs through a variety of media. Students will collaborate with one another, their instructor, and various electronic communities to solve the problems presented throughout the course. Through data analysis, students will identify task requirements, plan search strategies, and use computer science concepts to access, analyze, and evaluate information needed to solve problems. By using computer science knowledge and skills that support the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results. Students will learn digital citizenship by researching current laws and regulations and by practicing integrity and respect. Students will gain an understanding of computer science through the study of technology operations, systems, and concepts."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student develops products and generates new understandings by extending existing knowledge. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use program design problem-solving strategies to create program solutions;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the ability to read and modify large programs, including the design description and process development;"}
        },
        {
            "competencyText": {"en-us": "follow the systematic problem-solving process of identifying the specifications of purpose and goals, the data types and objects needed, and the subtasks to be performed;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast design methodologies and implementation techniques such as top-down, bottom-up, and black box;"}
        },
        {
            "competencyText": {"en-us": "analyze, modify, and evaluate existing code by performing a case study on a large program, including inheritance and black box programming;"}
        },
        {
            "competencyText": {"en-us": "identify the data types and objects needed to solve a problem;"}
        },
        {
            "competencyText": {"en-us": "choose, identify, and use the appropriate abstract data type, advanced data structure, and supporting algorithms to properly represent the data in a program problem solution;"}
        },
        {
            "competencyText": {"en-us": "use object-oriented programming development methodology, data abstraction, encapsulation with information hiding, and procedural abstraction in program development and testing; and"}
        },
        {
            "competencyText": {"en-us": "create, edit, and manipulate bitmap images that are used to enhance user interfaces and program functionality."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student communicates and collaborates with peers to contribute to his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use the principles of software engineering to work in software design teams, break a problem statement into specific solution requirements, create a program development plan, code part of a solution from a program development plan while a partner codes the remaining part, team test the solution for correctness, and develop presentations to report the solution findings;"}
        },
        {
            "competencyText": {"en-us": "create interactive console display interfaces with appropriate user prompts;"}
        },
        {
            "competencyText": {"en-us": "create interactive human interfaces to acquire data from a user and display program results using an advanced Graphical User Interface (GUI);"}
        },
        {
            "competencyText": {"en-us": "write programs and communicate with proper programming style to enhance the readability and functionality of the code by using meaningful descriptive identifiers, internal comments, white space, indentation, and a standardized program style;"}
        },
        {
            "competencyText": {"en-us": "improve data display by optimizing data visualization;"}
        },
        {
            "competencyText": {"en-us": "display simple vector graphics to interpret and display program results; and"}
        },
        {
            "competencyText": {"en-us": "display simple bitmap images."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student locates, analyzes, processes, and organizes data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use local area networks (LANs) and wide area networks (WANs), including the Internet and intranets, in research, file management, and collaboration;"}
        },
        {
            "competencyText": {"en-us": "understand programming file structure and file access for required resources;"}
        },
        {
            "competencyText": {"en-us": "acquire and process information from text files, including files of known and unknown sizes;"}
        },
        {
            "competencyText": {"en-us": "manipulate data structures using string processing;"}
        },
        {
            "competencyText": {"en-us": "manipulate data values by casting between data types;"}
        },
        {
            "competencyText": {"en-us": "identify and use the structured data type of one-dimensional arrays to traverse, search, modify, insert, and delete data;"}
        },
        {
            "competencyText": {"en-us": "identify and use the structured data type of two-dimensional arrays to traverse, search, modify, insert, and delete data; and"}
        },
        {
            "competencyText": {"en-us": "identify and use a list object data structure to traverse, search, insert, and delete data."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses appropriate strategies to analyze problems and design algorithms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "develop sequential algorithms using branching control statements, including nested structures, to create solutions to decision-making problems;"}
        },
        {
            "competencyText": {"en-us": "develop choice algorithms using selection control statements based on ordinal values;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of short-circuit evaluation;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of Boolean algebra, including De Morgan's Law;"}
        },
        {
            "competencyText": {"en-us": "develop iterative algorithms using nested loops;"}
        },
        {
            "competencyText": {"en-us": "identify, trace, and appropriately use recursion in programming solutions, including algebraic computations;"}
        },
        {
            "competencyText": {"en-us": "design, construct, evaluate, and compare search algorithms, including linear searching and binary searching;"}
        },
        {
            "competencyText": {"en-us": "identify, describe, design, create, evaluate, and compare standard sorting algorithms, including selection sort, bubble sort, insertion sort, and merge sort;"}
        },
        {
            "competencyText": {"en-us": "measure time/space efficiency of various sorting algorithms;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast search and sort algorithms, including linear, quadratic, and recursive strategies, for time/space efficiency;"}
        },
        {
            "competencyText": {"en-us": "analyze algorithms using \"big-O\" notation for best, average, and worst-case data patterns;"}
        },
        {
            "competencyText": {"en-us": "develop algorithms to solve various problems, including factoring, summing a series, finding the roots of a quadratic equation, and generating Fibonacci numbers;"}
        },
        {
            "competencyText": {"en-us": "test program solutions by investigating boundary conditions; testing classes, methods, and libraries in isolation; and performing stepwise refinement;"}
        },
        {
            "competencyText": {"en-us": "identify and debug compile, syntax, runtime, and logic errors;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast algorithm efficiency by using informal runtime comparisons, exact calculation of statement execution counts, and theoretical efficiency values using \"big-O\" notation, including worst-case, best-case, and average-case time/space analysis;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the ability to count, convert, and perform mathematical operations in the binary and hexadecimal number systems;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of the maximum integer boundary, minimum integer boundary, imprecision of real number representations, and round-off errors;"}
        },
        {
            "competencyText": {"en-us": "create program solutions to problems using the mathematics library class;"}
        },
        {
            "competencyText": {"en-us": "use random algorithms to create simulations that model the real world;"}
        },
        {
            "competencyText": {"en-us": "identify, understand, and create class specifications and relationships among classes, including composition and inheritance relationships;"}
        },
        {
            "competencyText": {"en-us": "understand and explain object relationships among defined classes, abstract classes, and interfaces;"}
        },
        {
            "competencyText": {"en-us": "create object-oriented definitions using class declarations, variable declarations, constant declarations, method declarations, parameter declarations, and interface declarations;"}
        },
        {
            "competencyText": {"en-us": "create robust classes that encapsulate data and the methods that operate on that data and incorporate overloading to enrich the object's behavior;"}
        },
        {
            "competencyText": {"en-us": "design and implement a set of interactive classes;"}
        },
        {
            "competencyText": {"en-us": "design, create, and evaluate multiclass programs that use abstract classes and interfaces;"}
        },
        {
            "competencyText": {"en-us": "understand and implement a student-created class hierarchy;"}
        },
        {
            "competencyText": {"en-us": "extend, modify, and improve existing code using inheritance;"}
        },
        {
            "competencyText": {"en-us": "create adaptive behaviors, including overloading, using polymorphism;"}
        },
        {
            "competencyText": {"en-us": "understand and use reference variables for object and string data types;"}
        },
        {
            "competencyText": {"en-us": "understand and implement access scope modifiers;"}
        },
        {
            "competencyText": {"en-us": "understand and demonstrate how to compare objects;"}
        },
        {
            "competencyText": {"en-us": "duplicate objects using the appropriate deep and/or shallow copy;"}
        },
        {
            "competencyText": {"en-us": "define and implement abstract classes and interfaces in program problem solutions;"}
        },
        {
            "competencyText": {"en-us": "apply functional decomposition to a program solution;"}
        },
        {
            "competencyText": {"en-us": "create simple and robust objects from class definitions through instantiation;"}
        },
        {
            "competencyText": {"en-us": "apply class membership of variables, constants, and methods;"}
        },
        {
            "competencyText": {"en-us": "examine and mutate the properties of an object using accessors and modifiers;"}
        },
        {
            "competencyText": {"en-us": "understand and implement a composite class; and"}
        },
        {
            "competencyText": {"en-us": "design and implement an interface."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student explores and understands safety, legal, cultural, and societal issues relating to the use of technology and information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "model ethical acquisition and use of digital information;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette, responsible use of software, and knowledge of acceptable use policies; and"}
        },
        {
            "competencyText": {"en-us": "investigate digital rights management."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student understands technology concepts, systems, and operations as they apply to computer science. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare and contrast types of operating systems, software applications, hardware platforms, and programming languages;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of major hardware components, including primary and secondary memory, a central processing unit (CPU), and peripherals;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of major networking components, including hosts, servers, switches, and routers;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of computer communication systems, including single-user, peer-to-peer, workgroup, client-server, and networked;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of computer addressing systems, including Internet Protocol (IP) address and Media Access Control (MAC) address; and"}
        },
        {
            "competencyText": {"en-us": "differentiate among the categories of programming languages, including machine, assembly, high-level compiled, high-level interpreted, and scripted."}
        },
        {
            "competencyText": {"en-us": "Computer Science III (One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.35 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. The required prerequisite for this course is Computer Science II, Advanced Placement (AP) Computer Science A, or International Baccalaureate (IB) Computer Science. This course is recommended for students in Grades 11 and 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Computer Science III will foster students' creativity and innovation by presenting opportunities to design, implement, and present meaningful programs through a variety of media. Students will collaborate with one another, their instructor, and various electronic communities to solve the problems presented throughout the course. Through data analysis, students will identify task requirements, plan search strategies, and use computer science concepts to access, analyze, and evaluate information needed to solve problems. By using computer science knowledge and skills that support the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results. Students will learn digital citizenship by researching current laws and regulations and by practicing integrity and respect. Students will gain an understanding of advanced computer science data structures through the study of technology operations, systems, and concepts."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student develops products and generates new understandings by extending existing knowledge. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply data abstraction and encapsulation to manage complexity;"}
        },
        {
            "competencyText": {"en-us": "implement a student-created class hierarchy;"}
        },
        {
            "competencyText": {"en-us": "read and write class specifications using visual organizers, including Unified Modeling Language;"}
        },
        {
            "competencyText": {"en-us": "use black box programming methodology;"}
        },
        {
            "competencyText": {"en-us": "design, create, and use interfaces to apply protocols;"}
        },
        {
            "competencyText": {"en-us": "identify, describe, design, create, evaluate, and compare standard sorting algorithms that perform sorting operations on data structures, including quick sort and heap sort;"}
        },
        {
            "competencyText": {"en-us": "select, identify, and use the appropriate abstract data type, advanced data structure, and supporting algorithms to properly represent the data in a program problem solution; and"}
        },
        {
            "competencyText": {"en-us": "manage complexity by using a systems approach."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student communicates and collaborates with peers to contribute to his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use local area networks (LANs) and wide area networks (WANs), including the Internet and intranets, in research, file management, and collaboration;"}
        },
        {
            "competencyText": {"en-us": "create interactive human interfaces to acquire data from a user and display program results using an advanced Graphical User Interface (GUI);"}
        },
        {
            "competencyText": {"en-us": "write programs and communicate with proper programming style to enhance the readability and functionality of the code by using meaningful descriptive identifiers, internal comments, white space, indentation, and a standardized program style; and"}
        },
        {
            "competencyText": {"en-us": "work in software design teams."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student locates, analyzes, processes, and organizes data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and use the structured data type of arrays of objects to traverse, search, modify, insert, and delete data;"}
        },
        {
            "competencyText": {"en-us": "identify and use two-dimensional ragged arrays to traverse, search, modify, insert, and delete data;"}
        },
        {
            "competencyText": {"en-us": "identify and use a list object data structure, including vector, to traverse, search, insert, and delete object data;"}
        },
        {
            "competencyText": {"en-us": "understand and trace a linked-list data structure;"}
        },
        {
            "competencyText": {"en-us": "create program solutions using a linked-list data structure, including unordered single, ordered single, double, and circular linked;"}
        },
        {
            "competencyText": {"en-us": "understand composite data structures, including a linked list of linked lists;"}
        },
        {
            "competencyText": {"en-us": "understand and create program solutions using stacks, queues, trees, heaps, priority queues, graph theory, and enumerated data types;"}
        },
        {
            "competencyText": {"en-us": "understand and create program solutions using sets, including HashSet and TreeSet;"}
        },
        {
            "competencyText": {"en-us": "understand and create program solutions using maps, including HashMap and TreeMap; and"}
        },
        {
            "competencyText": {"en-us": "write and modify text file data."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses appropriate strategies to analyze problems and design algorithms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "develop choice algorithms using selection control statements, including break, label, and continue;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of the bitwise operators;"}
        },
        {
            "competencyText": {"en-us": "develop iterative algorithms using do-while loops;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of the ternary operator;"}
        },
        {
            "competencyText": {"en-us": "create program solutions that use iterators;"}
        },
        {
            "competencyText": {"en-us": "identify, trace, and appropriately use recursion;"}
        },
        {
            "competencyText": {"en-us": "understand and create program solutions using hashing;"}
        },
        {
            "competencyText": {"en-us": "perform pattern recognition using regular expressions;"}
        },
        {
            "competencyText": {"en-us": "explore common algorithms, including matrix addition and multiplication, fractals, Towers of Hanoi, and magic square;"}
        },
        {
            "competencyText": {"en-us": "create program solutions that exhibit robust behavior by understanding and avoiding runtime errors and handling anticipated errors;"}
        },
        {
            "competencyText": {"en-us": "understand object-oriented design concepts of inner classes, outer classes, and anonymous classes;"}
        },
        {
            "competencyText": {"en-us": "use object reference scope identifiers, including null, this, and super;"}
        },
        {
            "competencyText": {"en-us": "provide object functionality to primitive data types;"}
        },
        {
            "competencyText": {"en-us": "write program assumptions in the form of assertions;"}
        },
        {
            "competencyText": {"en-us": "write a Boolean expression to test a program assertion; and"}
        },
        {
            "competencyText": {"en-us": "construct assertions to make explicit program invariants."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student explores and understands safety, legal, cultural, and societal issues relating to the use of technology and information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "model ethical acquisition and use of digital information; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette, responsible use of software, and knowledge of acceptable use policies."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student understands technology concepts, systems, and operations as they apply to computer science. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare and contrast high-level programming languages;"}
        },
        {
            "competencyText": {"en-us": "create a small workgroup network;"}
        },
        {
            "competencyText": {"en-us": "create and apply a basic network addressing scheme; and"}
        },
        {
            "competencyText": {"en-us": "create discovery programs in a low-level language, high-level language, and scripting language."}
        },
        {
            "competencyText": {"en-us": "Digital Forensics (One-Half to One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.36 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. The prerequisite for this course is proficiency in the knowledge and skills relating to Technology Applications, Grades 6-8. This course is recommended for students in Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Digital Forensics will foster students' creativity and innovation by presenting opportunities to investigate simulations and case studies of crimes, reconstructing computer security incidents, troubleshooting operational problems, and recovering from accidental system damage. Students will collaborate to develop forensic techniques to assist with computer security incident response. Students will learn methods to identify, collect, examine, and analyze data while preserving the integrity of the information and maintaining a strict chain of custody for data. Students will solve problems as they study the application of science to the law. Students will learn digital citizenship by researching current laws and regulations and by practicing integrity and respect. Students will gain an understanding of computing and networking systems that transmit or store electronic data."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student develops products and generates new understanding by extending existing knowledge. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the need for digital forensics, staffing requirements, and team interactions;"}
        },
        {
            "competencyText": {"en-us": "develop policies to define staff roles and responsibilities;"}
        },
        {
            "competencyText": {"en-us": "develop guidelines, procedures, and recommendations for digital forensics tool use; and"}
        },
        {
            "competencyText": {"en-us": "investigate simulations and case studies of crimes to reconstruct computer security incidents."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student communicates and collaborates with peers to contribute to his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the characteristics and behaviors of a given system;"}
        },
        {
            "competencyText": {"en-us": "justify and describe the impact of selecting a given system;"}
        },
        {
            "competencyText": {"en-us": "apply effective teamwork practices;"}
        },
        {
            "competencyText": {"en-us": "collaborate with multiple participants;"}
        },
        {
            "competencyText": {"en-us": "document use, functionality, and implementation;"}
        },
        {
            "competencyText": {"en-us": "seek and respond to advice from peers and professionals; and"}
        },
        {
            "competencyText": {"en-us": "describe considerations required for incident response."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student locates, analyzes, processes, and organizes data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify possible sources of data;"}
        },
        {
            "competencyText": {"en-us": "acquire data;"}
        },
        {
            "competencyText": {"en-us": "analyze and report data collected;"}
        },
        {
            "competencyText": {"en-us": "collect files by copying files from media while maintaining data file integrity;"}
        },
        {
            "competencyText": {"en-us": "examine data files by locating files, extracting data, and using a digital forensics toolkit;"}
        },
        {
            "competencyText": {"en-us": "examine and analyze operating system data;"}
        },
        {
            "competencyText": {"en-us": "collect volatile and non-volatile operating system data;"}
        },
        {
            "competencyText": {"en-us": "collect, examine, and analyze application data;"}
        },
        {
            "competencyText": {"en-us": "use traffic data sources, including firewalls and routers, packet sniffers and protocol analyzers, intrusion detection systems, remote access, security event management software, and network forensic analysis tools;"}
        },
        {
            "competencyText": {"en-us": "describe how a file scan can be accessed and modified;"}
        },
        {
            "competencyText": {"en-us": "collect, examine, and analyze data from multiple sources; and"}
        },
        {
            "competencyText": {"en-us": "provide examples of how multiple data sources can be used during digital forensics, including investigating worm infections, viruses, and email threats."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses appropriate strategies to analyze problems and design algorithms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "resolve information conflicts and validate information through data acquisition, research, and comparison; and"}
        },
        {
            "competencyText": {"en-us": "examine and analyze network traffic data, including identifying events of interest, examining data sources, and identifying attacks."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student explores and understands safety, legal, cultural, and societal issues relating to the use of technology and information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and use digital information appropriately;"}
        },
        {
            "competencyText": {"en-us": "identify and use appropriate methods for citing sources;"}
        },
        {
            "competencyText": {"en-us": "identify and discuss intellectual property laws, issues, and use;"}
        },
        {
            "competencyText": {"en-us": "identify intellectual property stakeholders and their needs and perspectives;"}
        },
        {
            "competencyText": {"en-us": "identify and describe the kinds of crimes investigated by digital forensics specialists;"}
        },
        {
            "competencyText": {"en-us": "identify legal, illegal, ethical, and unethical aspects of information gathering;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast legal, illegal, ethical, and unethical information gathering methods and identify possible gray areas;"}
        },
        {
            "competencyText": {"en-us": "identify and describe ways in which developing laws and guidelines affect digital forensics practices;"}
        },
        {
            "competencyText": {"en-us": "identify and describe legal considerations and technical issues related to collecting network traffic data;"}
        },
        {
            "competencyText": {"en-us": "identify and describe ways in which technological changes affect applicable laws; and"}
        },
        {
            "competencyText": {"en-us": "identify and describe businesses and government agencies that use digital forensics."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student understands technology concepts, systems, and operations as they apply to computer science. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of and appropriately use operating systems, software applications, and communication and networking components;"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and appropriately use various input, processing, output, and primary and secondary storage devices;"}
        },
        {
            "competencyText": {"en-us": "make decisions regarding the selection, acquisition, and use of software, including its quality, appropriateness, effectiveness, and efficiency;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of data formats;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of networks, including the Internet, intranets, and extranets;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast non-volatile and volatile data;"}
        },
        {
            "competencyText": {"en-us": "describe file basics, including file storage, file systems, and other types of storage media;"}
        },
        {
            "competencyText": {"en-us": "describe file modification, including access and creation times;"}
        },
        {
            "competencyText": {"en-us": "describe operating systems, including terminology and functions;"}
        },
        {
            "competencyText": {"en-us": "describe technical procedures related to collecting operating system data;"}
        },
        {
            "competencyText": {"en-us": "describe the significance to digital forensics of the Transmission Control Protocol/Internet Protocol (TCP/IP) model, including application, transport, IP, and hardware layers;"}
        },
        {
            "competencyText": {"en-us": "describe the function and use of application components, including configurations settings, authentications, logs, application data, supporting files, and application architecture; and"}
        },
        {
            "competencyText": {"en-us": "describe the functions and use of application types, including email, web usage, interactive communications, file sharing, document usage, security applications, and data concealment tools."}
        },
        {
            "competencyText": {"en-us": "Discrete Mathematics for Computer Science (One-Half to One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §126.37 adopted to be effective September 26, 2011, 36 TexReg 6263",
                    " amended to be effective August 25, 2014, 38 TexReg 9564."
                ]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. The required prerequisite for this course is Algebra II. This course is recommended for students in Grades 11 and 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Discrete Mathematics for Computer Science provides the tools used in most areas of computer science. Exposure to the mathematical concepts and discrete structures presented in this course is essential in order to provide an adequate foundation for further study. Discrete Mathematics for Computer Science is generally listed as a core requirement for Computer Science majors. Course topics are divided into six areas: sets, functions, and relations; basic logic; proof techniques; counting basics; graphs and trees; and discrete probability. Mathematical topics are interwoven with computer science applications to enhance the students' understanding of the introduced mathematics. Students will develop the ability to see computational problems from a mathematical perspective. Introduced to a formal system (propositional and predicate logic) upon which mathematical reasoning is based, students will acquire the necessary knowledge to read and construct mathematical arguments (proofs), understand mathematical statements (theorems), and use mathematical problem-solving tools and strategies. Students will be introduced to discrete data structures such as sets, discrete functions, and relations and graphs and trees. Students will also be introduced to discrete probability and expectations."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student develops products and generates new understanding by extending existing knowledge. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "model algorithms and real-world situations using formal tools of symbolic logic;"}
        },
        {
            "competencyText": {"en-us": "model computer science problems by using graphs and trees; and"}
        },
        {
            "competencyText": {"en-us": "calculate the probabilities of events and expectations of random variables for such problems as games of chance."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student communicates and collaborates with peers to contribute to his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "convert spoken language statements to appropriate statements in propositional logic;"}
        },
        {
            "competencyText": {"en-us": "explain basic terminology of sets, functions, and relations;"}
        },
        {
            "competencyText": {"en-us": "state the definition of the Master theorem;"}
        },
        {
            "competencyText": {"en-us": "use the context of a particular application to interpret the meaning derived when computing the permutations and combinations of a set;"}
        },
        {
            "competencyText": {"en-us": "interpret associated operations and terminology in context; and"}
        },
        {
            "competencyText": {"en-us": "define and provide examples of logical equivalence, normal forms, validity, and modus ponens/modus tollens."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student locates, analyzes, processes, and organizes data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "construct truth tables for negation, conjunction, disjunction, implication, biconditional, and bit operators; and"}
        },
        {
            "competencyText": {"en-us": "use truth tables to demonstrate propositional relations."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses appropriate strategies to analyze problems and design algorithms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze practical examples using appropriate models of sets, functions, and relations;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast tautology, contradiction, and contingency as related to propositional equivalences;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast examples and use of counterexamples, contrapositions, and contradictions;"}
        },
        {
            "competencyText": {"en-us": "describe the appropriate use and limitations of predicate logic;"}
        },
        {
            "competencyText": {"en-us": "apply formal methods of symbolic propositional and predicate logic;"}
        },
        {
            "competencyText": {"en-us": "use formal logic proofs and logical reasoning to solve problems;"}
        },
        {
            "competencyText": {"en-us": "outline the basic structure of proofs, including direct, indirect, contradiction, induction, existence, and constructive proofs;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast the types of problems best satisfied by direct, indirect, contradiction, induction, existence, and constructive proofs;"}
        },
        {
            "competencyText": {"en-us": "relate mathematical induction to recursion and recursively defined structures;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast weak, strong, and structural induction, including when each is most appropriately used and examples of each;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast dependent and independent events;"}
        },
        {
            "competencyText": {"en-us": "use recurrence equations to analyze algorithms and other practical problems;"}
        },
        {
            "competencyText": {"en-us": "use counting techniques to analyze algorithms and other practical problems;"}
        },
        {
            "competencyText": {"en-us": "apply probability tools to solve problems; and"}
        },
        {
            "competencyText": {"en-us": "define, compare, and contrast simple graphs, multigraphs, and directed and undirected graphs using definitions, properties, and examples, including special cases."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student explores and understands safety, legal, cultural, and societal issues relating to the use of technology and information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "model ethical acquisition and use of digital information;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette, responsible use of software, and knowledge of acceptable use policies; and"}
        },
        {
            "competencyText": {"en-us": "investigate how the concepts of discrete mathematics are related to relevant problems and significant questions."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student understands technology concepts, systems, and operations as they apply to computer science. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "perform operations associated with sets, functions, and relations;"}
        },
        {
            "competencyText": {"en-us": "apply basic counting principles, including cardinality and the pigeonhole principle;"}
        },
        {
            "competencyText": {"en-us": "apply appropriate precedence when using logical operators;"}
        },
        {
            "competencyText": {"en-us": "use appropriate strategies, including De Morgan's Laws, to identify propositional equivalences;"}
        },
        {
            "competencyText": {"en-us": "identify and appropriately use predicates, existential and universal quantifiers, and valid arguments;"}
        },
        {
            "competencyText": {"en-us": "identify possible applications of proofs, including evaluating algorithmic complexity;"}
        },
        {
            "competencyText": {"en-us": "state and appropriately use the product and sum rules;"}
        },
        {
            "competencyText": {"en-us": "compute permutations and combinations of a set;"}
        },
        {
            "competencyText": {"en-us": "solve a variety of basic recurrence equations;"}
        },
        {
            "competencyText": {"en-us": "apply the binomial theorem to independent events;"}
        },
        {
            "competencyText": {"en-us": "apply Bayes' theorem to dependent events;"}
        },
        {
            "competencyText": {"en-us": "demonstrate transversal methods for trees and graphs; and"}
        },
        {
            "competencyText": {"en-us": "relate graphs and trees to data structures, algorithms, and counting."}
        },
        {
            "competencyText": {"en-us": "Game Programming and Design (One-Half to One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.38 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. The required prerequisite for this course is Algebra I. This course is recommended for students in Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Game Programming and Design will foster student creativity and innovation by presenting students with opportunities to design, implement, and present meaningful programs through a variety of media. Students will collaborate with one another, their instructor, and various electronic communities to solve gaming problems. Through data analysis, students will include the identification of task requirements, plan search strategies, and use programming concepts to access, analyze, and evaluate information needed to design games. By acquiring programming knowledge and skills that support the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results. Students will learn digital citizenship by researching current laws and regulations and by practicing integrity and respect. Students will create a computer game that is presented to an evaluation panel."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student develops products and generates new understanding by extending existing knowledge. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "understand the basic game design elements, including conceptual ideas, storyline, visualization, storyboard, game effects, sound elements, game play, game controls, and player tutorial;"}
        },
        {
            "competencyText": {"en-us": "create a design concept document;"}
        },
        {
            "competencyText": {"en-us": "create a storyboard;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the fundamentals of game art, including the look and feel, graphics coordinate system, basics of color, and color palettes;"}
        },
        {
            "competencyText": {"en-us": "use bitmap graphics images, including designing, creating, reading, and manipulating images;"}
        },
        {
            "competencyText": {"en-us": "create backgrounds, including solid, image, and tiled backgrounds;"}
        },
        {
            "competencyText": {"en-us": "write programs creating images using geometric shapes;"}
        },
        {
            "competencyText": {"en-us": "create games using sprites by evaluating the role of sprites, creating sprites, and managing sprites;"}
        },
        {
            "competencyText": {"en-us": "create programs using sprite sheets;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of image rendering, including transparency, refresh rate, hardware acceleration, and animation;"}
        },
        {
            "competencyText": {"en-us": "find, create, and edit game audio sound effects and music; and"}
        },
        {
            "competencyText": {"en-us": "implement game sound mechanics, including playing, pausing, and looping."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student communicates and collaborates with peers to contribute to his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "design and implement procedures to set timelines for, track the progress of, and evaluate a game product;"}
        },
        {
            "competencyText": {"en-us": "seek and respond to input from peers and professionals in evaluating a game project;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge and appropriate use of operating systems, program development tools, and networking resources;"}
        },
        {
            "competencyText": {"en-us": "use network resources to acquire, organize, maintain, and evaluate information;"}
        },
        {
            "competencyText": {"en-us": "collaborate to research the business of games, including the roles of developer, marketing, publisher, and retail sales; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and evaluate online technology, including online interaction and massive multiplayer games."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student locates, analyzes, processes, and organizes data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "play board games to research and collect game play data;"}
        },
        {
            "competencyText": {"en-us": "evaluate, analyze, and document game styles and playability; and"}
        },
        {
            "competencyText": {"en-us": "research the dramatic elements in games, including kinds of fun, player types, and nonlinear storytelling."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses appropriate strategies to analyze problems and design algorithms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the game design process, including generating ideas, brainstorming, and paper prototyping;"}
        },
        {
            "competencyText": {"en-us": "write programs using variables of different data types;"}
        },
        {
            "competencyText": {"en-us": "evaluate game rules and instructions;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the user experience by comparing rules and game-play patterns;"}
        },
        {
            "competencyText": {"en-us": "write game rules and instructions;"}
        },
        {
            "competencyText": {"en-us": "develop game software;"}
        },
        {
            "competencyText": {"en-us": "write computer game code, resolve game defects, and revise existing game code; and"}
        },
        {
            "competencyText": {"en-us": "test a finished game product by implementing sound testing techniques."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student explores and understands safety, legal, cultural, and societal issues relating to the use of technology and information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explore intellectual property, privacy, sharing of information, copyright laws, and software licensing agreements;"}
        },
        {
            "competencyText": {"en-us": "model ethical acquisition and use of digital information;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette when using networks, responsible use of software, and knowledge of acceptable use policies;"}
        },
        {
            "competencyText": {"en-us": "model respect of intellectual property, including manipulating graphics, morphing graphics, editing graphics, and editing sound;"}
        },
        {
            "competencyText": {"en-us": "discuss and evaluate the social issues surrounding gaming; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the cultural aspects of game design fundamentals, including rationale for games and types of games."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student understands technology concepts, systems, and operations as they apply to game programming. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify basic game components, including the game engine, game play subsystems, data structures, models, and interfaces;"}
        },
        {
            "competencyText": {"en-us": "generate random numbers in a program;"}
        },
        {
            "competencyText": {"en-us": "create a program implementing conditional statements;"}
        },
        {
            "competencyText": {"en-us": "develop an appropriate data model;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and apply object-oriented game programming;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of game programming essentials, including event-driven programming, communicating with messages, and device management;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the role of game events, the animation loop, and game timing;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the role of game engines;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of video display flicker and double buffering;"}
        },
        {
            "competencyText": {"en-us": "apply basic game screen design and layout, including visual controls, user interfaces, menus, and options;"}
        },
        {
            "competencyText": {"en-us": "use game control design to understand, access, and control input devices, including keyboard, mouse, and joystick;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and apply game animation, including the principles of animation and frame-based animation;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of decision making and types of decisions;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of game events, including listeners, triggers, and timed events;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and implement collision detection, including bounding boxes and sprite collisions;"}
        },
        {
            "competencyText": {"en-us": "implement a tile-based game, including loading tile maps, drawing tile maps, rendering a tile map, and layering sprites;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of artificial intelligence and develop and implement artificial intelligence;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of game balance and tuning; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of player progression, including leveling, linear progression, and maintaining high score data."}
        },
        {
            "competencyText": {"en-us": "Mobile Application Development (One-Half to One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.39 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. The required prerequisites for this course are proficiency in the knowledge and skills relating to Technology Applications, Grades 6-8, and Algebra I. This course is recommended for students in Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Mobile Application Development will foster students' creativity and innovation by presenting opportunities to design, implement, and deliver meaningful projects using mobile computing devices. Students will collaborate with one another, their instructor, and various electronic communities to solve problems presented throughout the course. Through data analysis, students will identify task requirements, plan search strategies, and use software development concepts to access, analyze, and evaluate information needed to program mobile devices. By using software design knowledge and skills that support the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results. Students will learn digital citizenship by researching current laws and regulations and by practicing integrity and respect. Students will gain an understanding of the principles of mobile application development through the study of development platforms, programming languages, and software design standards."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student develops products and generates new understanding by extending existing knowledge. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create effective user interfaces appropriate for a specified mobile device that is best suited for an identified purpose;"}
        },
        {
            "competencyText": {"en-us": "create effective user interfaces for browser-based, native, and hybrid mobile applications;"}
        },
        {
            "competencyText": {"en-us": "create mobile application components appropriate for identified needs;"}
        },
        {
            "competencyText": {"en-us": "create browser-based applications for mobile devices;"}
        },
        {
            "competencyText": {"en-us": "create native applications that can reside on specified mobile devices; and"}
        },
        {
            "competencyText": {"en-us": "create mobile applications that combine native and hybrid components."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student communicates and collaborates with peers to contribute to his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and discuss how teams function;"}
        },
        {
            "competencyText": {"en-us": "use teamwork to solve problems;"}
        },
        {
            "competencyText": {"en-us": "describe the development workflow of mobile applications;"}
        },
        {
            "competencyText": {"en-us": "use time-management techniques to develop and maintain work schedules, meet deadlines, and establish mobile application project criteria;"}
        },
        {
            "competencyText": {"en-us": "describe a problem solution; and"}
        },
        {
            "competencyText": {"en-us": "document and share problem solutions through various media."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student locates, analyzes, processes, and organizes data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, identify, and describe mobile application project stakeholders and their perspectives;"}
        },
        {
            "competencyText": {"en-us": "collect and analyze available data to identify mobile application project requirements;"}
        },
        {
            "competencyText": {"en-us": "analyze, identify, and describe input, output, and processing requirements; and"}
        },
        {
            "competencyText": {"en-us": "analyze, identify, and define hardware and software specifications."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses appropriate strategies to analyze problems and design algorithms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare and contrast design decisions based on the hardware considerations of a mobile device;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast available mobile technologies, including platforms and their operating systems;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast available development approaches, including application to specific technologies and platforms;"}
        },
        {
            "competencyText": {"en-us": "determine the most appropriate solution for the development of a given mobile application, including browser-based, native, and hybrid approaches;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast available programming languages and how their use might be applied to specific technologies and platforms;"}
        },
        {
            "competencyText": {"en-us": "identify and justify the selection of an appropriate programming language, including available resources and required interfaces;"}
        },
        {
            "competencyText": {"en-us": "select an appropriate program development environment;"}
        },
        {
            "competencyText": {"en-us": "identify and use available libraries;"}
        },
        {
            "competencyText": {"en-us": "evaluate and justify the selection of appropriate options and components;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast available networks and their implications for mobile application development; and"}
        },
        {
            "competencyText": {"en-us": "compare and contrast design strategies related to mobile network and device security."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student explores and understands safety, legal, cultural, and societal issues relating to the use of technology and information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "discuss copyright laws and issues;"}
        },
        {
            "competencyText": {"en-us": "model ethical acquisition and use of digital information;"}
        },
        {
            "competencyText": {"en-us": "cite sources using established methods;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette and knowledge of acceptable use policies;"}
        },
        {
            "competencyText": {"en-us": "investigate mobile device security measures such as passwords, virus detection, and virus prevention;"}
        },
        {
            "competencyText": {"en-us": "describe potential risks and benefits associated with the use of a mobile application;"}
        },
        {
            "competencyText": {"en-us": "identify current and emerging technologies related to mobile applications; and"}
        },
        {
            "competencyText": {"en-us": "evaluate technologies and assess their applicability to current mobile applications."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student understands technology concepts, systems, and operations as they apply to computer science. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the difference between desktop and mobile applications;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of hardware and software structures and requirements in the design of mobile applications;"}
        },
        {
            "competencyText": {"en-us": "recognize multiple platforms and demonstrate an understanding of their associated requirements;"}
        },
        {
            "competencyText": {"en-us": "recognize various program development environments;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of event‐based programming and its appropriate use;"}
        },
        {
            "competencyText": {"en-us": "describe how memory management affects mobile application design;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of how low bandwidth and the mobility of a device affect the design of mobile applications;"}
        },
        {
            "competencyText": {"en-us": "identify applications that are best suited for mobile devices;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the use of libraries when designing mobile applications;"}
        },
        {
            "competencyText": {"en-us": "use a simulation tool to emulate a mobile device's functionality; and"}
        },
        {
            "competencyText": {"en-us": "use actual mobile devices to test mobile applications."}
        },
        {
            "competencyText": {"en-us": "Robotics Programming and Design (One-Half to One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §126.40 adopted to be effective September 26, 2011, 36 TexReg 6263",
                    " amended to be effective August 25, 2013, 38 TexReg 5484."
                ]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. The prerequisite for this course is proficiency in the knowledge and skills relating to Technology Applications, Grades 6-8. This course is recommended for students in Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "The process standards describe ways in which students are expected to engage in the content. The placement of the process standards at the beginning of the knowledge and skills listed for each grade and course is intentional. The process standards weave the other knowledge and skills together so that students may be successful problem solvers and use mathematics efficiently and effectively in daily life. The process standards are integrated at every grade level and course. When possible, students will apply mathematics to problems arising in everyday life, society, and the workplace. Students will use a problem-solving model that incorporates analyzing given information, formulating a plan or strategy, determining a solution, justifying the solution, and evaluating the problem-solving process and the reasonableness of the solution. Students will select appropriate tools such as real objects, manipulatives, paper and pencil, and technology and techniques such as mental math, estimation, and number sense to solve problems. Students will effectively communicate mathematical ideas, reasoning, and their implications using multiple representations such as symbols, diagrams, graphs, and language. Students will use mathematical relationships to generate solutions and make connections and predictions. Students will analyze mathematical relationships to connect and communicate mathematical ideas. Students will display, explain, or justify mathematical ideas and arguments using precise mathematical language in written or oral communication."}
        },
        {
            "competencyText": {"en-us": "Robotics Programming and Design will foster students' creativity and innovation by presenting opportunities to design, implement, and present meaningful robotic programs through a variety of media. Students will collaborate with one another, their instructor, and various electronic communities to solve problems in designing and programming robots. Through data analysis, students will identify task requirements, plan search strategies, and use robotic concepts to access, analyze, and evaluate information needed to solve problems. By using robotic knowledge and skills that support the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results. Students will learn digital citizenship by researching current laws and regulations and by practicing integrity and respect. Students will gain an understanding of the principles of robotics through the study of physics, robotics, automation, and engineering design concepts."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Mathematical process standards. The student uses mathematical processes to acquire and demonstrate mathematical understanding. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply mathematics to problems arising in everyday life, society, and the workplace;"}
        },
        {
            "competencyText": {"en-us": "use a problem-solving model that incorporates analyzing given information, formulating a plan or strategy, determining a solution, justifying the solution, and evaluating the problem-solving process and the reasonableness of the solution;"}
        },
        {
            "competencyText": {"en-us": "select tools, including real objects, manipulatives, paper and pencil, and technology as appropriate, and techniques, including mental math, estimation, and number sense as appropriate, to solve problems;"}
        },
        {
            "competencyText": {"en-us": "communicate mathematical ideas, reasoning, and their implications using multiple representations, including symbols, diagrams, graphs, and language as appropriate;"}
        },
        {
            "competencyText": {"en-us": "create and use representations to organize, record, and communicate mathematical ideas;"}
        },
        {
            "competencyText": {"en-us": "analyze mathematical relationships to connect and communicate mathematical ideas; and"}
        },
        {
            "competencyText": {"en-us": "display, explain, and justify mathematical ideas and arguments using precise mathematical language in written or oral communication."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student develops products and generates new understanding by extending existing knowledge. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "produce a prototype;"}
        },
        {
            "competencyText": {"en-us": "present a prototype using a variety of media;"}
        },
        {
            "competencyText": {"en-us": "use the design process to construct a robot;"}
        },
        {
            "competencyText": {"en-us": "refine the design of a robot;"}
        },
        {
            "competencyText": {"en-us": "build robots of simple, moderate, and advanced complexity;"}
        },
        {
            "competencyText": {"en-us": "improve a robot design to meet a specified need;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and create artificial intelligence in a robot; and"}
        },
        {
            "competencyText": {"en-us": "create behavior-based control algorithms."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student communicates and collaborates with peers to contribute to his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and implement design teams;"}
        },
        {
            "competencyText": {"en-us": "use design teams to solve problems;"}
        },
        {
            "competencyText": {"en-us": "serve as a team leader and a team member;"}
        },
        {
            "competencyText": {"en-us": "describe a problem and identify design specifications;"}
        },
        {
            "competencyText": {"en-us": "design a solution to a problem and share a solution through various media;"}
        },
        {
            "competencyText": {"en-us": "document prototypes, adjustments, and corrections in the design process;"}
        },
        {
            "competencyText": {"en-us": "document a final design and solution; and"}
        },
        {
            "competencyText": {"en-us": "present a final design, testing results, and solution."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student locates, analyzes, processes, and organizes data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "test and evaluate a robot design;"}
        },
        {
            "competencyText": {"en-us": "implement position tracking to complete assigned robot tasks;"}
        },
        {
            "competencyText": {"en-us": "develop solution systems and implement systems analysis;"}
        },
        {
            "competencyText": {"en-us": "modify a robot to respond to a change in specifications; and"}
        },
        {
            "competencyText": {"en-us": "implement a system to identify and track all components of a robot."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses appropriate strategies to analyze problems and design algorithms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "develop algorithms to control a robot, including applying instructions, collecting sensor data, and performing simple tasks;"}
        },
        {
            "competencyText": {"en-us": "create maneuvering algorithms to physically move the location of a robot;"}
        },
        {
            "competencyText": {"en-us": "create algorithms that provide interaction with a robot;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and use output commands, variables, and sequence programming structure;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and use jumps, loops, and selection programming structures;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of and use subroutines, accessors, and modifiers; and"}
        },
        {
            "competencyText": {"en-us": "apply decision-making strategies when developing solutions."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student explores and understands safety, legal, cultural, and societal issues relating to the use of technology and information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "discuss intellectual property, privacy, sharing of information, copyright laws, and software licensing agreements;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette, responsible use of software, and knowledge of acceptable use policies; and"}
        },
        {
            "competencyText": {"en-us": "explore the effects robots have on changing our culture and society."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student understands technology concepts, systems, and operations as they apply to computer science. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use tools and laboratory equipment safely to construct and repair robots;"}
        },
        {
            "competencyText": {"en-us": "identify and describe the steps needed to produce a prototype;"}
        },
        {
            "competencyText": {"en-us": "use software applications to simulate robotic behavior, present design concepts, and test solution strategies;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the use of computers to manipulate a robot;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of process control design factors;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of different types of sensors used in robotics;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge and use of effectors;"}
        },
        {
            "competencyText": {"en-us": "implement multiple sensors in a robot;"}
        },
        {
            "competencyText": {"en-us": "interpret sensor feedback and calculate threshold values;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of motors, gears, and gear trains used in a robot;"}
        },
        {
            "competencyText": {"en-us": "implement infrared range sensing;"}
        },
        {
            "competencyText": {"en-us": "apply measurement and geometry to calculate robot navigation;"}
        },
        {
            "competencyText": {"en-us": "implement movement control using shaft encoding;"}
        },
        {
            "competencyText": {"en-us": "demonstrate robot navigation;"}
        },
        {
            "competencyText": {"en-us": "implement path planning using geometry and multiple sensor feedback;"}
        },
        {
            "competencyText": {"en-us": "program a robot to perform simple tasks, including following lines, moving objects, and avoiding obstacles;"}
        },
        {
            "competencyText": {"en-us": "demonstrate and implement a robotic task solution using robotic arm construction;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of feedback control loops to provide information;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of torque and power factors used in the operation of a robot servo; and"}
        },
        {
            "competencyText": {"en-us": "troubleshoot and maintain robotic systems and subsystems."}
        },
        {
            "competencyText": {"en-us": "Digital Design and Media Production (One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.41 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. The prerequisite for this course is proficiency in the knowledge and skills relating to Technology Applications, Grades 6-8. This course is recommended for students in Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Digital Design and Media Production will allow students to demonstrate creative thinking, develop innovative strategies, and use communication tools in order to work effectively with others as well as independently. Students will gather information electronically, which will allow for problem solving and making informed decisions regarding media projects. Students will learn digital citizenship by researching current laws and regulations and by practicing integrity and respect. Students will demonstrate a thorough understanding of digital design principles that is transferable to other disciplines."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student employs a creative design process to create original projects as they relate to purposes and audiences. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create designs for defined projects such as graphics, logos, and page layouts;"}
        },
        {
            "competencyText": {"en-us": "apply design elements and typography standards; and"}
        },
        {
            "competencyText": {"en-us": "use visual composition principles."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student understands professional digital media communications strategies. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "adapt the language and design of a project for audience, purpose, situation, and intent;"}
        },
        {
            "competencyText": {"en-us": "organize oral, written, and graphic information into formal and informal publications;"}
        },
        {
            "competencyText": {"en-us": "interpret and communicate information to multiple audiences; and"}
        },
        {
            "competencyText": {"en-us": "collaborate to create original projects, including seeking and responding to advice from others such as peers or experts in the creation and evaluation process."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student uses a variety of strategies to plan, obtain, evaluate, and use valid information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "obtain print and digital information such as graphics, audio, and video from a variety of resources while citing the sources;"}
        },
        {
            "competencyText": {"en-us": "evaluate information for accuracy and validity; and"}
        },
        {
            "competencyText": {"en-us": "present accurate information using techniques appropriate for the intended audience."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student implements problem-solving methods using critical-thinking skills to plan, implement, manage, and evaluate projects; solve problems; and make informed decisions using appropriate digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "employ critical-thinking and interpersonal skills to solve problems and make decisions through planning and gathering, interpreting, and evaluating data;"}
        },
        {
            "competencyText": {"en-us": "identify and organize the tasks for completion of a project using the most appropriate digital tools;"}
        },
        {
            "competencyText": {"en-us": "distinguish design requirements as they relate to the purposes and audiences of a project and apply appropriate design elements;"}
        },
        {
            "competencyText": {"en-us": "seek and respond to input from others, including peers, teachers, and outside collaborators;"}
        },
        {
            "competencyText": {"en-us": "evaluate a process and project both independently and collaboratively and make suggested revisions; and"}
        },
        {
            "competencyText": {"en-us": "transfer critical-thinking, problem-solving, and decision-making processes when using new technologies."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student complies with standard practices and behaviors and upholds legal and ethical responsibilities. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "examine copyright and fair use guidelines with regard to print and digital media;"}
        },
        {
            "competencyText": {"en-us": "model ethical and legal acquisition and use of digital resources such as licensing and established methods of citing sources;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette, personal security guidelines, use of network resources, and application of the district's acceptable use policy for technology; and"}
        },
        {
            "competencyText": {"en-us": "identify and demonstrate positive personal qualities such as flexibility, open-mindedness, initiative, listening attentively to speakers, willingness to learn new knowledge and skills, and pride in quality work."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student uses technology concepts, systems, and operations as appropriate for a project. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define the purpose of a product and identify the specified audience;"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate project management to:"}
        },
        {
            "competencyText": {"en-us": "use hardware, software, and information appropriate to a project and its audience to:"}
        },
        {
            "competencyText": {"en-us": "use digital typography standards such as:"}
        },
        {
            "competencyText": {"en-us": "apply design and layout principles and techniques to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate use of digital photography and editing to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate use of videography equipment and techniques to:"}
        },
        {
            "competencyText": {"en-us": "deploy digital media into print, web, and video products to:"}
        },
        {
            "competencyText": {"en-us": "Digital Art and Animation (One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.42 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. The prerequisite for this course is proficiency in the knowledge and skills relating to Technology Applications, Grades 6-8. The recommended prerequisite is Art, Level I. This course is recommended for students in Grades 9-12. This course satisfies the high school fine arts graduation requirement."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of the six strands in technology applications, students will develop college readiness skills applied to technology, including terminology, concepts, and strategies. Students will communicate information in different formats and to diverse audiences using a variety of technologies. Students will learn the efficient acquisition of information using search strategies and using technology to access, analyze, and evaluate the acquired information. Students will learn to make informed decisions about technologies and their applications. By using technology as a tool that supports the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results."}
        },
        {
            "competencyText": {"en-us": "Digital Art and Animation consists of computer images and animations created with digital imaging software. Digital Art and Animation has applications in many careers, including graphic design, advertising, web design, animation, corporate communications, illustration, character development, script writing, storyboarding, directing, producing, inking, project management, editing, and the magazine, television, film, and game industries. Students in this course will produce various real-world projects and animations."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student demonstrates creative thinking, constructs knowledge, and develops innovative products and processes using technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate, edit, and create scripts for animations;"}
        },
        {
            "competencyText": {"en-us": "identify and apply color theories, including harmony rules, tints, shades, gradients, color mixing, new color creation, and the visual impacts of specific color combinations using a digital format;"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and integrate the basic sound editing principles, including mixing and manipulating wave forms, audio tracks, and effects;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast the rules of composition such as the rule of thirds or the golden section/rectangle with respect to harmony and balance;"}
        },
        {
            "competencyText": {"en-us": "evaluate the fundamental concepts of a digital art and design such as composition, perspective, angles, lighting, repetition, proximity, white space, balance, and contrast;"}
        },
        {
            "competencyText": {"en-us": "analyze digital art designs to interpret the point of interest, the prominence of the subject, and visual parallels between the structures of natural and human-made environments;"}
        },
        {
            "competencyText": {"en-us": "distinguish among typefaces while recognizing and resolving conflicts that occur through the use of typography as a design element;"}
        },
        {
            "competencyText": {"en-us": "use perspective, including backgrounds, light, shades and shadows, hue and saturation, and scale, to capture a focal point and create depth;"}
        },
        {
            "competencyText": {"en-us": "use the basic principles of design such as proportion, balance, variety, emphasis, harmony, symmetry, and unity in type, color, size, line thickness, shape, and space;"}
        },
        {
            "competencyText": {"en-us": "edit files using appropriate digital editing tools and established design principles such as consistency, repetition, alignment, proximity, white space, image file size, color use, and font size, type, and style; and"}
        },
        {
            "competencyText": {"en-us": "identify pictorial qualities in a design such as shape and form, space and depth, or pattern and texture to create visual unity and desired effects in designs."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student uses digital media and environments to communicate and work collaboratively, including at a distance, to support individual learning and contribute to the learning experience of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use vocabulary as it relates to digital art, audio, and animation;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the use of technology to participate in self-directed and collaborative activities within the global community;"}
        },
        {
            "competencyText": {"en-us": "participate in electronic communities;"}
        },
        {
            "competencyText": {"en-us": "create technology specifications for tasks and rubrics for the evaluation of products;"}
        },
        {
            "competencyText": {"en-us": "design and implement procedures to track trends, set timelines, and evaluate products;"}
        },
        {
            "competencyText": {"en-us": "collaborate with peers in delineating technological tasks;"}
        },
        {
            "competencyText": {"en-us": "publish and save information in a variety of ways, including print or digital formats;"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate projects for design, content delivery, purpose, and audience; and"}
        },
        {
            "competencyText": {"en-us": "critique original digital artwork, portfolios, and products with peers."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student applies digital tools to gather, evaluate, and use information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "distinguish between and correctly apply process color (RGB and CYMK), spot color, and black or white;"}
        },
        {
            "competencyText": {"en-us": "research the history of digital art and animation;"}
        },
        {
            "competencyText": {"en-us": "research career choices in digital art and animation;"}
        },
        {
            "competencyText": {"en-us": "use the Internet to retrieve information in an electronic format;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the appropriate use of digital imaging, video integration, and sound retrieved from an electronic format;"}
        },
        {
            "competencyText": {"en-us": "import sounds from a variety of sources; and"}
        },
        {
            "competencyText": {"en-us": "create planning designs such as rough sketches, storyboards, and brainstorming materials."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses critical-thinking skills to plan and conduct research, manage projects, solve problems, and make informed decisions using appropriate digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "distinguish between and use the components of animation software programs such as cast, score, stage, and the animation manipulation interface;"}
        },
        {
            "competencyText": {"en-us": "distinguish between and use different animation techniques such as path and cell animation, onion skinning, and tweening;"}
        },
        {
            "competencyText": {"en-us": "create three-dimensional effects by layering images such as foreground, middle distance, and background images;"}
        },
        {
            "competencyText": {"en-us": "apply a variety of color schemes such as monochromatic, analogous, complementary, primary/secondary triads, cool/warm colors, and split complements to digital designs;"}
        },
        {
            "competencyText": {"en-us": "use the basic concepts of color and design theory such as working in a bitmapped and vector mode to create backgrounds, characters, and other cast members as needed for the animation;"}
        },
        {
            "competencyText": {"en-us": "use the appropriate scripting language or program code to create an animation;"}
        },
        {
            "competencyText": {"en-us": "use a variety of lighting techniques such as shadows and shading to create effects; and"}
        },
        {
            "competencyText": {"en-us": "define the design attributes and requirements of products created for a variety of purposes such as posters, billboards, logos, corporate identity, advertisements, book jackets, brochures, and magazines."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student understands human, cultural, and societal issues related to technology and practices legal and ethical behavior. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "discuss copyright laws/issues and use of digital information such as attributing ideas and citing sources using established methods;"}
        },
        {
            "competencyText": {"en-us": "define plagiarism and model respect of intellectual property;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette and knowledge of acceptable use policies when using technology; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the validity and reliability of sources."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a sound understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge and appropriate use of operating systems, software applications, and communication and networking components;"}
        },
        {
            "competencyText": {"en-us": "make decisions regarding the selection and use of software and Internet resources;"}
        },
        {
            "competencyText": {"en-us": "make necessary adjustments regarding compatibility issues with digital file formats, importing and exporting data, and cross-platform compatibility; and"}
        },
        {
            "competencyText": {"en-us": "read, use, and develop technical documentation."}
        },
        {
            "competencyText": {"en-us": "3-D Modeling and Animation (One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.43 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. The prerequisite for this course is proficiency in the knowledge and skills relating to Technology Applications, Grades 6-8. The recommended prerequisite is Art, Level I. This course is recommended for students in Grades 9-12. This course satisfies the high school fine arts graduation requirement."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of the six strands in technology applications, students will develop college readiness skills applied to technology, including terminology, concepts, and strategies. Students will learn to make informed decisions about technologies and their applications. Students will learn the efficient acquisition of information using search strategies and the use of technology to access, analyze, and evaluate acquired information. By using technology as a tool that supports the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate results. Students will communicate information in different formats and to diverse audiences using a variety of technologies. Students will analyze and evaluate the results."}
        },
        {
            "competencyText": {"en-us": "3-D Modeling and Animation consists of computer images created in a virtual three-dimensional (3-D) environment. 3-D Modeling and Animation has applications in many careers, including criminal justice, crime scene, and legal applications; construction and architecture; engineering and design; and the movie and game industries. Students in this course will produce various 3-D models of real-world objects."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student demonstrates creative thinking, constructs knowledge, and develops innovative products and processes using technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate, edit, and create scripts for animations;"}
        },
        {
            "competencyText": {"en-us": "identify and apply color theories, including harmony rules, tints, shades, gradients, color mixing, new color creation, and the visual impacts of specific color combinations using a digital format;"}
        },
        {
            "competencyText": {"en-us": "apply texture, transparency, skinning, and contour along a 3-D object surface;"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and integrate the basic sound editing principles, including mixing and manipulating wave forms, audio tracks, and effects;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast the rules of composition such as the rule of thirds or the golden section/rectangle with respect to harmony and balance;"}
        },
        {
            "competencyText": {"en-us": "evaluate the fundamental concepts of 3-D modeling and design such as composition, perspective, angles, lighting, repetition, proximity, white space, balance, and contrast;"}
        },
        {
            "competencyText": {"en-us": "analyze 3-D model objects to interpret the point of interest, the prominence of the subject, and visual parallels between the structures of natural and human-made environments;"}
        },
        {
            "competencyText": {"en-us": "distinguish among typefaces while recognizing and resolving conflicts that occur through the use of typography as a design element;"}
        },
        {
            "competencyText": {"en-us": "use perspective, including spot and directional light, backgrounds, ambience, shades and shadows, and hue and saturation;"}
        },
        {
            "competencyText": {"en-us": "use the basic principles of design such as proportion, balance, variety, emphasis, harmony, symmetry, and unity in type, color, size, line thickness, shape, and space;"}
        },
        {
            "competencyText": {"en-us": "edit files using appropriate digital editing tools and established design principles such as consistency, repetition, alignment, proximity, white space, image file size, color use, font size, type, and style; and"}
        },
        {
            "competencyText": {"en-us": "identify pictorial qualities in a design such as shape and form, space and depth, or pattern and texture to create visual unity and desired effects in designs."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student uses digital media and environments to communicate and work collaboratively, including at a distance, to support individual learning and contribute to the learning experience of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use vocabulary as it relates to digital art, audio, and animation;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the use of technology to participate in self-directed and collaborative activities within the global community;"}
        },
        {
            "competencyText": {"en-us": "participate in electronic communities;"}
        },
        {
            "competencyText": {"en-us": "create technology specifications for tasks and rubrics for the evaluation of products;"}
        },
        {
            "competencyText": {"en-us": "design and implement procedures to track trends, set timelines, and evaluate products;"}
        },
        {
            "competencyText": {"en-us": "collaborate with peers in delineating technological tasks;"}
        },
        {
            "competencyText": {"en-us": "publish and save information in a variety of ways, including print or digital formats;"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate projects for design, content delivery, purpose, and audience; and"}
        },
        {
            "competencyText": {"en-us": "critique original 3-D digital artwork, portfolios, and products with peers."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student applies digital tools to gather, evaluate, and use information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "distinguish among and correctly apply process color (RGB and CYMK), spot color, and black or white;"}
        },
        {
            "competencyText": {"en-us": "research the history of 3-D modeling and 3-D animation;"}
        },
        {
            "competencyText": {"en-us": "research career choices in 3-D modeling and 3-D animation;"}
        },
        {
            "competencyText": {"en-us": "use the Internet to retrieve information in an electronic format;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the appropriate use of 3-D objects, digital imaging, video integration, and sound retrieved from an electronic format;"}
        },
        {
            "competencyText": {"en-us": "import sounds from a variety of sources; and"}
        },
        {
            "competencyText": {"en-us": "create planning designs such as rough sketches, storyboards, and brainstorming materials."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses critical-thinking skills to plan and conduct research, manage projects, solve problems, and make informed decisions using appropriate digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "distinguish between and use the components of 3-D animation software programs such as cast, score, environment, the X-Y-Z coordinate system, and the animation manipulation interface;"}
        },
        {
            "competencyText": {"en-us": "distinguish between and use the different 3-D modeling techniques such as box modeling, transformation, and polygon primitives using extrusion and rotation;"}
        },
        {
            "competencyText": {"en-us": "distinguish between and use the different 3-D animation techniques such as path and rendering using dynamics and physics;"}
        },
        {
            "competencyText": {"en-us": "apply a variety of color schemes such as monochromatic, analogous, complementary, primary/secondary triads, cool/warm colors, and split complements to digital designs;"}
        },
        {
            "competencyText": {"en-us": "use the basic concepts of color and design theory such as working with 3-D models and environments, characters, objects, and other cast members as needed for the animation;"}
        },
        {
            "competencyText": {"en-us": "use the appropriate rendering techniques to create an animation;"}
        },
        {
            "competencyText": {"en-us": "use a variety of lighting techniques such as shadow, shading, point, spot, directional, and ambient to create effects; and"}
        },
        {
            "competencyText": {"en-us": "define the design attributes and requirements of a 3-D animation project."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student understands human, cultural, and societal issues related to technology and practices legal and ethical behavior. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "discuss copyright laws/issues and use of digital information such as attributing ideas and citing sources using established methods;"}
        },
        {
            "competencyText": {"en-us": "define plagiarism and model respect of intellectual property;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette and knowledge of acceptable use policies when using technology; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the validity and reliability of sources."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a sound understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge and appropriate use of operating systems, software applications, and communication and networking components;"}
        },
        {
            "competencyText": {"en-us": "make decisions regarding the selection and use of software and Internet resources;"}
        },
        {
            "competencyText": {"en-us": "make necessary adjustments regarding compatibility issues with digital file formats, importing and exporting data, and cross-platform compatibility; and"}
        },
        {
            "competencyText": {"en-us": "read, use, and develop technical documentation."}
        },
        {
            "competencyText": {"en-us": "Digital Communications in the 21st Century (One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.44 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. The prerequisite for this course is proficiency in the knowledge and skills relating to Technology Applications, Grades 6-8. This course is recommended for students in Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of the six strands in technology applications, students will support and manage the work of individuals and groups to create products to inform and promote their proposed solutions using appropriate communication skills and methods of delivery. Students will learn to make informed decisions using digital tools and appropriate applications. By using online research and information resources such as journals, newspapers, or authoritative databases, students will synthesize knowledge; create solutions; and evaluate the results for authentic, real-world local, state, national, and global issues."}
        },
        {
            "competencyText": {"en-us": "Digital Communications in the 21st Century will prepare students for the societal demands of increased civic literacy, independent working environments, global awareness, and the mastery of a base set of analysis and communication skills. Students will be expected to design and present an effective product based on well-researched issues in order to thoughtfully propose suggested solutions to authoritative stakeholders. The outcome of the process and product approach is to provide students an authentic platform to demonstrate effective application of multimedia tools within the contexts of global communication and collaborative communities and appropriately share their voices to affect change that concerns their future."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student demonstrates the ability to analyze, evaluate, and adapt during the creative problem-solving process and demonstrates creative thinking in developing solutions to real-world issues using digital tools. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "generate innovative, sustainable solutions for real-world issues such as global warming, immigration, or the global economy using emerging digital tools;"}
        },
        {
            "competencyText": {"en-us": "gather and evaluate accurate information for feasibility and practicality as a basis for making communication decisions; and"}
        },
        {
            "competencyText": {"en-us": "analyze the ethical and social responsibilities as a project team when communicating with peers, stakeholders, and experts."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student uses innovative thinking to develop new ideas and processes for solving real-world issues and conveying those ideas to a global audience through a persuasive digital product. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "examine real-world issues relating to current topics such as health care, government, business, or aerospace;"}
        },
        {
            "competencyText": {"en-us": "develop innovative solutions to address issues;"}
        },
        {
            "competencyText": {"en-us": "create unique methods and products conveying solutions to audiences beyond the classroom such as school officials, non-profit organizations, higher education officials, government, or other stakeholders;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the effective use and importance of verbal and nonverbal communication skills when presenting ideas and solutions to diverse audiences; and"}
        },
        {
            "competencyText": {"en-us": "use appropriate techniques to manage communication apprehension, build self-confidence, and gain command of information."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student develops a process to effectively communicate with peers, experts, and other audiences about current issues and solutions to global problems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate innovative uses of a wide range of emerging technologies, including online learning, mobile devices, digital content, and Web 2.0 tools such as podcasting, wikis, and blogs;"}
        },
        {
            "competencyText": {"en-us": "participate within appropriate electronic communities as a learner, initiator, and contributor;"}
        },
        {
            "competencyText": {"en-us": "extend the learning environment beyond the school walls using appropriate digital tools;"}
        },
        {
            "competencyText": {"en-us": "collaborate with a variety of field experts;"}
        },
        {
            "competencyText": {"en-us": "prepare for, organize, and participate in an informative or persuasive group discussion with an audience; and"}
        },
        {
            "competencyText": {"en-us": "participate appropriately in conversations by making clear requests, giving accurate directions, and asking purposeful questions."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student uses digital tools to facilitate collaboration and communication in the design, development, and evaluation of products offering solutions to real-world issues. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "design and organize resources to create an effective collaborative working environment that enables a group to investigate a local, state, national, or global issue;"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate effective communication;"}
        },
        {
            "competencyText": {"en-us": "demonstrate leadership by managing project activities such as timelines, research, product development, marketing material, and effective communication skills;"}
        },
        {
            "competencyText": {"en-us": "demonstrate effective management of diverse peer-group dynamics such as solving problems, managing conflicts, and building consensus; and"}
        },
        {
            "competencyText": {"en-us": "evaluate original products for accuracy, validity, and compliance with copyright laws."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student uses a variety of strategies to acquire and evaluate information relating to real-world issues. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "locate authoritative information from primary and secondary sources such as field experts, online full-text databases, or current news databases;"}
        },
        {
            "competencyText": {"en-us": "make decisions regarding the selection, acquisition, and use of information gathered, taking into consideration its quality, appropriateness, effectiveness, and level of interest to society; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate fluency in the use of a variety of electronic sources such as cloud computing, emerging collaboration technologies, data mining strategies, and mobile or other technologies."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student uses a variety of digital tools to synthesize information related to real-world issues in student-created materials. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "construct real-world informational materials that inform, persuade, or recommend reform of selected issues;"}
        },
        {
            "competencyText": {"en-us": "identify and employ a method to evaluate the design, functionality, and accuracy of the student-created materials; and"}
        },
        {
            "competencyText": {"en-us": "use effective strategies to organize and outline presentations to support and clarify points."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses critical-thinking skills to conduct research, manage products, solve problems, and make informed decisions for real-world local, state, national, and global issues. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and define authentic problems and significant questions for investigation;"}
        },
        {
            "competencyText": {"en-us": "design and implement procedures to track trends, set timelines, and review and evaluate progress for project completion;"}
        },
        {
            "competencyText": {"en-us": "read and use technical documentation, including appropriate help options, to complete tasks; and"}
        },
        {
            "competencyText": {"en-us": "analyze the audience, occasion, and purpose when designing presentations."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student creates a product presenting solutions for real-world local, state, national, and global issues. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create technology specifications for tasks and rubrics to evaluate products and product quality against established criteria;"}
        },
        {
            "competencyText": {"en-us": "resolve information conflicts and validate information by comparing data;"}
        },
        {
            "competencyText": {"en-us": "represent diverse perspectives in problem solutions; and"}
        },
        {
            "competencyText": {"en-us": "prepare and use visual or auditory aids such as scripts, notes, or digital applications to enhance presentations."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student examines ethical and legal behavior to demonstrate leadership as a digital citizen. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "model safe and ethical use of digital information;"}
        },
        {
            "competencyText": {"en-us": "model respect of intellectual property when manipulating, morphing, or editing graphics, video, text, and sound;"}
        },
        {
            "competencyText": {"en-us": "use technology applications in a positive manner that supports productivity, collaboration, and continuing education; and"}
        },
        {
            "competencyText": {"en-us": "use professional etiquette and protocol in situations such as making introductions, offering and receiving criticism, and communicating with digital tools."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student demonstrates ethical and legal behavior in the creation of student products. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use collaborative tools and strategies; and"}
        },
        {
            "competencyText": {"en-us": "use digital tools to correctly document sources such as in bibliographies or works cited."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student makes decisions regarding the selection, acquisition, and use of digital tools in a multimedia classroom/lab, taking into consideration the quality, appropriateness, effectiveness, and efficiency of the tools. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "determine the most appropriate file type based on universally recognized file formats such as portable document format (PDF), text format (TXT), rich text format (RTF), and Joint Photographic Experts Group format (JPEG);"}
        },
        {
            "competencyText": {"en-us": "use compression schemes for photo, animation, video, and graphics; and"}
        },
        {
            "competencyText": {"en-us": "distinguish among appropriate color, sound, and design principles such as consistency, repetition, alignment, proximity, and ratio of text to white space."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates knowledge through various cloud and network technologies such as web-based interactive presentations, document sharing, and online scholarly databases. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use necessary vocabulary related to digital tools;"}
        },
        {
            "competencyText": {"en-us": "retrieve and discriminate between authoritative and non-authoritative data sources; and"}
        },
        {
            "competencyText": {"en-us": "adopt, adapt, and transfer prior knowledge to multiple situations when retrieving, manipulating, and creating original digital projects."}
        },
        {
            "competencyText": {"en-us": "Digital Video and Audio Design (One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.45 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. This course is recommended for students in Grades 11 and 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student applies academic knowledge and skills in audio and video projects. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply English language arts knowledge and skills by demonstrating the use of appropriate technical concepts;"}
        },
        {
            "competencyText": {"en-us": "apply English language arts knowledge and skills by demonstrating the use of vocabulary and correct grammar and punctuation to write and edit documents; and"}
        },
        {
            "competencyText": {"en-us": "incorporate knowledge of mathematics by determining a feasible resolution and aspect ratio to keep a file."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student understands and examines problem-solving methods. The student is expected to employ critical-thinking and interpersonal skills independently and in teams to solve problems."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student applies information technology applications. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use personal information management, email, Internet, writing and publishing, presentation, and spreadsheet or database applications for audio or video production projects;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the impact of participation in videoconferencing and other social network environments; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the responsibility of digital publications in social network environments."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student understands design systems. The student is expected to analyze and summarize the history and evolution of audio and video production fields."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student understands professional communication strategies. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "adapt language such as structure and style for audience, purpose, situation, and intent;"}
        },
        {
            "competencyText": {"en-us": "organize oral and written information;"}
        },
        {
            "competencyText": {"en-us": "interpret and communicate information, data, and observations;"}
        },
        {
            "competencyText": {"en-us": "present formal and informal presentations;"}
        },
        {
            "competencyText": {"en-us": "apply active listening skills;"}
        },
        {
            "competencyText": {"en-us": "listen to and speak with diverse individuals;"}
        },
        {
            "competencyText": {"en-us": "exhibit public relations skills;"}
        },
        {
            "competencyText": {"en-us": "employ leadership skills;"}
        },
        {
            "competencyText": {"en-us": "employ collaborative and conflict-management skills;"}
        },
        {
            "competencyText": {"en-us": "conduct and participate in meetings; and"}
        },
        {
            "competencyText": {"en-us": "employ mentoring skills."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student understands the pre-production process. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify critical elements in the pre-production stage, including design procedures, timeline development, technology specifications, scripting techniques, and budgeting procedures;"}
        },
        {
            "competencyText": {"en-us": "analyze script and storyboard development processes for a successful production;"}
        },
        {
            "competencyText": {"en-us": "identify and participate in the team roles required for completion of a production;"}
        },
        {
            "competencyText": {"en-us": "identify equipment, crew, and cast requirements for a scripted production; and"}
        },
        {
            "competencyText": {"en-us": "understand the casting or audition process."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student develops employability characteristics. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and participate in training, education, or certification required for employment;"}
        },
        {
            "competencyText": {"en-us": "identify and demonstrate positive work behaviors and personal qualities needed to be employable;"}
        },
        {
            "competencyText": {"en-us": "demonstrate skills related to seeking and applying for employment;"}
        },
        {
            "competencyText": {"en-us": "create a video portfolio to document work experiences, licenses, certifications, and work samples;"}
        },
        {
            "competencyText": {"en-us": "demonstrate skills in evaluating and comparing employment opportunities; and"}
        },
        {
            "competencyText": {"en-us": "examine employment opportunities in entrepreneurship."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student applies ethical decision making and complies with laws regarding the use of technology in audio and video production. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "exhibit ethical conduct related to interacting with others and provide proper credit for ideas;"}
        },
        {
            "competencyText": {"en-us": "discuss and apply copyright laws in relation to fair use and acquisition;"}
        },
        {
            "competencyText": {"en-us": "discuss what defines intellectual property and how to show appropriate respect;"}
        },
        {
            "competencyText": {"en-us": "analyze the ethical impact of the audio and video production industry on society;"}
        },
        {
            "competencyText": {"en-us": "implement personal and workplace safety rules and regulations;"}
        },
        {
            "competencyText": {"en-us": "follow emergency procedures; and"}
        },
        {
            "competencyText": {"en-us": "examine and summarize safety-related problems that may result from working with electrical circuits."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student develops a basic understanding of the history, current practice, future trends, and procedural protocols in the use of audio and video production. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the origin and evolution of audio, video, and film;"}
        },
        {
            "competencyText": {"en-us": "describe how changing technology impacts the digital society;"}
        },
        {
            "competencyText": {"en-us": "define terminology associated with the industry;"}
        },
        {
            "competencyText": {"en-us": "apply knowledge of audio and video script production;"}
        },
        {
            "competencyText": {"en-us": "discuss the impact of audio and video selection on human emotion;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the use of audio and video for a three-screen environment, including cell phones, television monitors, and computer screens;"}
        },
        {
            "competencyText": {"en-us": "demonstrate various videography techniques, including picture composition, video composition, audio composition, editing, and delivery;"}
        },
        {
            "competencyText": {"en-us": "understand the differences in linear and nonlinear systems;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of control peripherals for capturing or ingesting media;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the skills needed to create special lighting, animation, and voice-over effects with appropriate resources; and"}
        },
        {
            "competencyText": {"en-us": "format digital information for effective communication for a defined audience with the use of appropriate camera perspectives, color techniques, and content selection."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student understands the post-production process. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "select the appropriate evaluation and delivery formats such as a product evaluation rubric, job performance critique, and client and audience feedback survey; and"}
        },
        {
            "competencyText": {"en-us": "deliver the product in a variety of media forms such as social networks, collaborative workspaces, and cloud environments."}
        },
        {
            "competencyText": {"en-us": "Web Communications (One-Half Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.46 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half credit for successful completion of this course. This course is recommended for students in Grade 9."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts. This is an exploratory course in web communications."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student demonstrates creative thinking, constructs knowledge, and develops innovative products and processes using technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of local and online collaboration;"}
        },
        {
            "competencyText": {"en-us": "create websites using web editors or web authoring programs;"}
        },
        {
            "competencyText": {"en-us": "evaluate the accessibility and usability of original websites; and"}
        },
        {
            "competencyText": {"en-us": "conceptualize possible technologies based on current technical trends."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student uses digital technology to work collaboratively toward his or her own learning and the learning of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze and implement the proper and acceptable use of digital/virtual communications technologies such as instant messaging (IM), chat, email, and social networking;"}
        },
        {
            "competencyText": {"en-us": "define and implement the acquisition, sharing, and use of files taking into consideration primary ownership and copyright;"}
        },
        {
            "competencyText": {"en-us": "apply decisions regarding the selection, acquisition, and sharing of uniform resource locators (URLs) used in research, taking into consideration their quality, appropriateness, and effectiveness; and"}
        },
        {
            "competencyText": {"en-us": "solve problems using critical-thinking strategies."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student applies digital tools to gather, evaluate, and use information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "verify the accuracy, validity, and currency of acquired information;"}
        },
        {
            "competencyText": {"en-us": "conduct effective searches using Boolean operators;"}
        },
        {
            "competencyText": {"en-us": "acquire and use appropriate vocabulary terms;"}
        },
        {
            "competencyText": {"en-us": "cite sources appropriately using established methods;"}
        },
        {
            "competencyText": {"en-us": "model ethical and legal acquisition of digital information following guidelines in the student code of conduct, including plagiarism and copyright laws;"}
        },
        {
            "competencyText": {"en-us": "identify and discuss emerging technologies and their impact;"}
        },
        {
            "competencyText": {"en-us": "understand Internet history and structure and how they impact current use; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate use of grammar, spelling, and vocabulary when creating original work."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses critical-thinking skills to plan and conduct research, manage projects, solve problems, and make informed decisions using appropriate digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate the transfer and adaptation of knowledge through the creation of original work;"}
        },
        {
            "competencyText": {"en-us": "evaluate and implement security measures such as firewalls and Hypertext Transfer Protocol Secure (HTTPS) to protect original work;"}
        },
        {
            "competencyText": {"en-us": "analyze and follow timelines needed to create, edit, and present original work;"}
        },
        {
            "competencyText": {"en-us": "verify current licensing issues for software being used for the creation of original work;"}
        },
        {
            "competencyText": {"en-us": "identify and evaluate the design and functionality of web pages using rubrics;"}
        },
        {
            "competencyText": {"en-us": "optimize web information for fast download such as dial-up and high speed Internet and mobile devices; and"}
        },
        {
            "competencyText": {"en-us": "evaluate original work through self-, peer, and professional review of websites."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student understands human, cultural, and societal issues related to technology and practices legal and ethical behavior. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in online activities that follow appropriate behavioral, communication, and privacy guidelines, including ethics, personal security, and verbiage determined by the intended audience;"}
        },
        {
            "competencyText": {"en-us": "understand the negative impact of inappropriate technology use, including online bullying and harassment;"}
        },
        {
            "competencyText": {"en-us": "implement online security guidelines, including identity protection, limited personal information sharing, and password protection of a secure website; and"}
        },
        {
            "competencyText": {"en-us": "advocate and practice safe, legal, and responsible use of information and technology."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a sound understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of hardware such as scanners, cameras, printers, video cameras, and external hard drives;"}
        },
        {
            "competencyText": {"en-us": "identify the parts of a computer and explain their functions;"}
        },
        {
            "competencyText": {"en-us": "summarize the need, functionality, and use of servers;"}
        },
        {
            "competencyText": {"en-us": "identify the advantages and disadvantages of running a personal web server versus using a web server provider;"}
        },
        {
            "competencyText": {"en-us": "differentiate and appropriately use various input, processing, output, and primary/secondary storage devices;"}
        },
        {
            "competencyText": {"en-us": "create and implement universally accessible documents;"}
        },
        {
            "competencyText": {"en-us": "analyze bandwidth issues as they relate to audience, servers, connectivity, and cost;"}
        },
        {
            "competencyText": {"en-us": "establish a folder/directory hierarchy for storage of a web page and its related or linked files;"}
        },
        {
            "competencyText": {"en-us": "follow file and folder naming conventions, including spacing, special characters, and capitalization; and"}
        },
        {
            "competencyText": {"en-us": "identify basic design principles when creating a website."}
        },
        {
            "competencyText": {"en-us": "Web Design (One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.47 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. This course is recommended for students in Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts. This is an introductory course in web design."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student demonstrates creative thinking, constructs knowledge, and develops innovative products and processes using technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in local and online collaboration;"}
        },
        {
            "competencyText": {"en-us": "create a website using web editors and web authoring programs;"}
        },
        {
            "competencyText": {"en-us": "evaluate the accessibility and usability of an original website as it relates to a target audience;"}
        },
        {
            "competencyText": {"en-us": "conceptualize new possible technologies based on current technical trends;"}
        },
        {
            "competencyText": {"en-us": "analyze the use of virtualization such as virtual classrooms, distance learning, virtual storage, and a virtual operating system;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge and appropriate use of operating systems, software applications, and communication and networking components; and"}
        },
        {
            "competencyText": {"en-us": "make decisions regarding the selection, acquisition, and use of software, taking into consideration its quality, appropriateness, effectiveness, and efficiency."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student uses digital media and environments to communicate and work collaboratively, including at a distance, to support individual learning and contribute to the learning experience of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze and implement the proper and acceptable use of digital/virtual communications technologies such as instant messaging (IM), chat, email, and social networking;"}
        },
        {
            "competencyText": {"en-us": "define and implement the acquisition, sharing, and use of files, taking into consideration their primary ownership and copyright;"}
        },
        {
            "competencyText": {"en-us": "apply decisions regarding the selection, acquisition, and sharing of uniform resource locators (URLs) used in research, taking into consideration their quality, appropriateness, and effectiveness;"}
        },
        {
            "competencyText": {"en-us": "solve problems using critical-thinking strategies; and"}
        },
        {
            "competencyText": {"en-us": "compare, evaluate, and implement the use of wired versus wireless access."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student applies digital tools to gather, evaluate, and use information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "verify the accuracy, validity, and currency of acquired information;"}
        },
        {
            "competencyText": {"en-us": "conduct effective searches with Boolean operators;"}
        },
        {
            "competencyText": {"en-us": "acquire and use appropriate vocabulary terms;"}
        },
        {
            "competencyText": {"en-us": "cite sources appropriately using established methods;"}
        },
        {
            "competencyText": {"en-us": "model ethical and legal acquisition of digital information following guidelines in the student code of conduct, including plagiarism and copyright laws;"}
        },
        {
            "competencyText": {"en-us": "identify and discuss emerging technologies and their impact;"}
        },
        {
            "competencyText": {"en-us": "understand Internet history and structure and how they impact current use;"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate use of grammar, spelling, and vocabulary when creating original work;"}
        },
        {
            "competencyText": {"en-us": "acquire, evaluate, and use various web standards such as World Wide Web Consortium (W3C), Ecma International, and Internet Corporation for Assigned Names and Numbers (ICANN) to make informed decisions and implement standards in original work;"}
        },
        {
            "competencyText": {"en-us": "understand, analyze, and use interactive websites;"}
        },
        {
            "competencyText": {"en-us": "understand, evaluate, and determine the appropriate use of dynamic and static websites;"}
        },
        {
            "competencyText": {"en-us": "understand, evaluate, and determine the appropriate use of open/closed source file formats and software;"}
        },
        {
            "competencyText": {"en-us": "explain and demonstrate how search engines work such as advanced options, preferences, advertising, and search categories;"}
        },
        {
            "competencyText": {"en-us": "evaluate, create, and apply principles of project management, including web storyboards, site maps, job duties, time constraints, group dynamics, communication interaction, and project completion, evaluation, and feedback;"}
        },
        {
            "competencyText": {"en-us": "understand the use and application of a virtual private network (VPN);"}
        },
        {
            "competencyText": {"en-us": "distinguish among protocols, including Hypertext Transfer Protocol (HTTP) and File Transfer Protocol (FTP);"}
        },
        {
            "competencyText": {"en-us": "summarize the technical needs of a World Wide Web server, including random access memory (RAM), hard disk capacity, central processing unit (CPU) speed, busses, methods of connectivity, and appropriate software;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in the use of a variety of electronic input devices such as keyboard, scanner, voice/sound recorder, mouse, touch screen, or digital video by incorporating such components while publishing web pages;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper digital etiquette and knowledge of acceptable use policies when using networks, especially resources on the Internet and intranets;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proficiency in and appropriate use and navigation of local area networks (LANs), wide area networks (WANs), the Internet, and intranets for research and resource sharing;"}
        },
        {
            "competencyText": {"en-us": "construct appropriate search strategies in the acquisition of information from the Internet, including keyword searches and searches with Boolean operators; and"}
        },
        {
            "competencyText": {"en-us": "acquire information in electronic formats, including text, audio, video, and graphics, citing the source."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses critical-thinking skills to plan and conduct research, manage projects, solve problems, and make informed decisions using appropriate digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate the transfer and adaptation of knowledge through the creation of original work;"}
        },
        {
            "competencyText": {"en-us": "evaluate and implement security measures to protect original work such as firewalls and Hypertext Transfer Protocol Secure (HTTPS);"}
        },
        {
            "competencyText": {"en-us": "analyze and follow timelines needed to create, edit, and present original work;"}
        },
        {
            "competencyText": {"en-us": "verify current licensing issues for software being used for the creation of original work;"}
        },
        {
            "competencyText": {"en-us": "identify and evaluate the design and functionality of web pages using rubrics;"}
        },
        {
            "competencyText": {"en-us": "optimize web information for fast download such as dial-up and high speed Internet and mobile devices;"}
        },
        {
            "competencyText": {"en-us": "evaluate original work through self-, peer, and professional review of websites;"}
        },
        {
            "competencyText": {"en-us": "evaluate the types, functions, and target audiences of websites;"}
        },
        {
            "competencyText": {"en-us": "read, use, and develop technical documents;"}
        },
        {
            "competencyText": {"en-us": "analyze, examine, assess, and decide on servers as they relate to the management of a website;"}
        },
        {
            "competencyText": {"en-us": "analyze, examine, assess, and decide on a web host;"}
        },
        {
            "competencyText": {"en-us": "analyze, examine, assess, and decide on domain name acquisition and retention;"}
        },
        {
            "competencyText": {"en-us": "evaluate the functionality of a website such as color scheme, grammar, technological constraints, age appropriateness, cross-platform usability, and user relevant criteria as it relates to an intended audience;"}
        },
        {
            "competencyText": {"en-us": "identify software file formats and their characteristics and appropriate use;"}
        },
        {
            "competencyText": {"en-us": "identify and apply search engine optimization (SEO) to ensure optimal website visibility;"}
        },
        {
            "competencyText": {"en-us": "investigate and choose electronic security methods for a web server to protect from unauthorized access and negative intentions; and"}
        },
        {
            "competencyText": {"en-us": "draw conclusions from data gathered from electronic and telecommunication resources."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student understands human, cultural, and societal issues related to technology and practices legal and ethical behavior. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in online activities that follow appropriate behavioral, communication, and privacy guidelines, including ethics, personal security, verbiage determined by the intended audience, and ethical use of files and file sharing;"}
        },
        {
            "competencyText": {"en-us": "understand the negative impact of inappropriate technology use, including online bullying and harassment;"}
        },
        {
            "competencyText": {"en-us": "implement online security guidelines, including identity protection, limited personal information sharing, and password protection of a secure website;"}
        },
        {
            "competencyText": {"en-us": "engage in safe, legal, and responsible use of information and technology;"}
        },
        {
            "competencyText": {"en-us": "understand and respond to local, state, national, and global issues to ensure appropriate cross-browser and cross-platform usability;"}
        },
        {
            "competencyText": {"en-us": "interpret, use, and develop a safe online shared computing environment;"}
        },
        {
            "competencyText": {"en-us": "identify legal, ethical, appropriate, and safe website marketing practices;"}
        },
        {
            "competencyText": {"en-us": "identify legal, ethical, appropriate, and safe multimedia usage, including video, audio, graphics, animation, and emerging trends;"}
        },
        {
            "competencyText": {"en-us": "analyze the impact of the World Wide Web on society through research, interviews, and personal observation; and"}
        },
        {
            "competencyText": {"en-us": "participate in relevant and meaningful activities in the larger community and society to create electronic projects."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a sound understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of hardware, including scanners, cameras, printers, video cameras, and external hard drives;"}
        },
        {
            "competencyText": {"en-us": "identify the parts of a computer and explain its functions;"}
        },
        {
            "competencyText": {"en-us": "summarize the need for and functionality and use of servers;"}
        },
        {
            "competencyText": {"en-us": "identify the advantages and disadvantages of running a personal web server versus using a web server provider;"}
        },
        {
            "competencyText": {"en-us": "differentiate and appropriately use various input, processing, output, and primary/secondary storage devices;"}
        },
        {
            "competencyText": {"en-us": "create and implement universally accessible documents;"}
        },
        {
            "competencyText": {"en-us": "analyze bandwidth issues as related to audience, server, connectivity, and cost;"}
        },
        {
            "competencyText": {"en-us": "establish a folder/directory hierarchy for storage of a web page and its related or linked files;"}
        },
        {
            "competencyText": {"en-us": "create file and folder naming conventions to follow established guidelines, including spacing, special characters, and capitalization;"}
        },
        {
            "competencyText": {"en-us": "identify basic design principles when creating a website, including white space, color theory, background color, shape, line, proximity, unity, balance (ratio of text to white space), alignment, typography, font size, type, style, image file size, repetition, contrast, consistency, and aesthetics;"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge of the six core domains (gov, net, com, mil, org, edu) and be familiar with new domain implementation;"}
        },
        {
            "competencyText": {"en-us": "implement escape codes, HyperText Markup Language (HTML), cascading style sheets (CSS), and javascript through hard coding, web editors, and web authoring programs;"}
        },
        {
            "competencyText": {"en-us": "identify and use FTP client software;"}
        },
        {
            "competencyText": {"en-us": "implement java applet insertion;"}
        },
        {
            "competencyText": {"en-us": "identify and differentiate various network topologies, including physical and logical;"}
        },
        {
            "competencyText": {"en-us": "create, evaluate, and use web-based animation;"}
        },
        {
            "competencyText": {"en-us": "create, evaluate, and use video, including editing, compression, exporting, appropriateness, and delivery;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the ability to conduct secure communications from a web server to a client; and"}
        },
        {
            "competencyText": {"en-us": "use hypertext linking appropriately when creating web pages."}
        },
        {
            "competencyText": {"en-us": "Web Game Development (One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.48 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. The recommended prerequisite for this course is Web Design. This course is recommended for students in Grades 11 and 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student demonstrates creative thinking, constructs knowledge, and develops innovative products and processes using technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "research, evaluate, and demonstrate appropriate design of a web-based gaming site;"}
        },
        {
            "competencyText": {"en-us": "illustrate ideas for web artwork from direct observations, experiences, and imagination;"}
        },
        {
            "competencyText": {"en-us": "create original designs for web applications; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate the effective use of art media to create original web designs."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student uses digital media and environments to communicate and work collaboratively, including at a distance, to support individual learning and contribute to the learning experience of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "understand and evaluate the use and appropriateness of webinars;"}
        },
        {
            "competencyText": {"en-us": "examine, discuss, and summarize interactive online learning environments;"}
        },
        {
            "competencyText": {"en-us": "distinguish between distance learning, virtual learning, and online learning;"}
        },
        {
            "competencyText": {"en-us": "define and evaluate Voice over Internet Protocol (VoIP);"}
        },
        {
            "competencyText": {"en-us": "identify and apply end-user, peer, self-, and professional evaluations; and"}
        },
        {
            "competencyText": {"en-us": "work collaboratively to create functioning programs and gaming products."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student applies digital tools to gather, evaluate, and use information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "research, evaluate, and create web forms for database processing;"}
        },
        {
            "competencyText": {"en-us": "identify the various programming languages and differentiate among the available web programming languages;"}
        },
        {
            "competencyText": {"en-us": "research, evaluate, and summarize content management systems (CMS);"}
        },
        {
            "competencyText": {"en-us": "differentiate between Common Gateway Interface (CGI) and computer-generated imagery (CGI);"}
        },
        {
            "competencyText": {"en-us": "discuss, analyze, and summarize streaming media/content and game broadcasting;"}
        },
        {
            "competencyText": {"en-us": "define and evaluate instant messaging (IM) within a game environment;"}
        },
        {
            "competencyText": {"en-us": "analyze and discuss the history of gaming;"}
        },
        {
            "competencyText": {"en-us": "discuss, analyze, compare, and contrast game types such as action, action-adventure, adventure, construction and management simulation, life simulation, massively multiplayer online role-playing (MMORPG), music, party, puzzle, role-playing, sports, strategy, trivia, and vehicle simulation;"}
        },
        {
            "competencyText": {"en-us": "discuss, analyze, compare, and contrast gaming hardware, including console, personal computer, mobile, and web;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast web standards versus browser-specific languages;"}
        },
        {
            "competencyText": {"en-us": "research, evaluate, and summarize e-commerce;"}
        },
        {
            "competencyText": {"en-us": "investigate career opportunities in programming, gaming, art, design, business, and marketing;"}
        },
        {
            "competencyText": {"en-us": "research the characteristics of existing gaming websites to determine local, state, national, and global trends;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast historical and contemporary styles of art as applied to website development;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast the use of the art elements of color, texture, form, line, space, and value and the art principles of emphasis, pattern, rhythm, balance, proportion, and unity in personal web game artwork and the web game artwork of others, using vocabulary accurately;"}
        },
        {
            "competencyText": {"en-us": "describe general characteristics in artwork from a variety of cultures that influence web game design;"}
        },
        {
            "competencyText": {"en-us": "research and evaluate emerging technologies; and"}
        },
        {
            "competencyText": {"en-us": "research and evaluate augmented reality (the supplementing of reality with computer-generated imagery) such as heads-up display and virtual digital projectors."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses critical-thinking skills to plan and conduct research, manage projects, solve problems, and make informed decisions using appropriate digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "select an appropriate web programming language based on given criteria;"}
        },
        {
            "competencyText": {"en-us": "develop requirements for a database and determine the appropriate means to insert, delete, and modify records;"}
        },
        {
            "competencyText": {"en-us": "develop Structured Query Language (SQL) statements to retrieve, insert, modify, and delete records in a database;"}
        },
        {
            "competencyText": {"en-us": "design and create a flow diagram to plan a database, program, and game;"}
        },
        {
            "competencyText": {"en-us": "define and identify proper use of gaming graphics, including skins, textures, environment appearance, environment mapping, raster graphics, and vector graphics;"}
        },
        {
            "competencyText": {"en-us": "plan an animation that includes the movement of characters, camera movements, camera angles, user point of view, mechanics of motion, backgrounds, settings, ambient objects, and environments;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast two-dimensional (2-D) and three-dimensional (3-D) animation;"}
        },
        {
            "competencyText": {"en-us": "develop and create a gaming storyboard and script that shows the overall development of a storyline;"}
        },
        {
            "competencyText": {"en-us": "identify and implement graphic and game design elements, including color, environment, time to completion, difficulty, story complexity, character development, device control, backstory, delivery, and online player(s);"}
        },
        {
            "competencyText": {"en-us": "design and create decision trees for a game's artificial intelligence engine;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast available audio formats for optimal delivery;"}
        },
        {
            "competencyText": {"en-us": "identify the similarities and differences among platforms, including the application of coding on a personal computer, mobile device, and gaming console;"}
        },
        {
            "competencyText": {"en-us": "research and identify existing online game development tools;"}
        },
        {
            "competencyText": {"en-us": "evaluate and determine network requirements for the delivery of online games to end users; and"}
        },
        {
            "competencyText": {"en-us": "create visual solutions by elaborating on direct observation, experiences, and imagination as they apply to original web design."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student understands human, cultural, and societal issues related to technology and practices legal and ethical behavior. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain game ratings and why games fit into certain ratings;"}
        },
        {
            "competencyText": {"en-us": "assess games and game ratings in terms of their impact on societal interactions;"}
        },
        {
            "competencyText": {"en-us": "model the ethical and legal acquisition of digital information following copyright laws, fair-use guidelines, and the student code of conduct;"}
        },
        {
            "competencyText": {"en-us": "define and practice the ethical and legal acquisition, sharing, and use of files taking into consideration their primary ownership and copyright;"}
        },
        {
            "competencyText": {"en-us": "examine original web game artwork to comply with appropriate behavioral, communication, and privacy guidelines, including ethics, online bullying and harassment, personal security, appropriate audience language, ethical use of files/file sharing, technical documentation, and online communities;"}
        },
        {
            "competencyText": {"en-us": "interpret, evaluate, and justify artistic decisions in the creation of original art for web game design; and"}
        },
        {
            "competencyText": {"en-us": "analyze original web game artwork and digital portfolios created by peers and others to form precise conclusions about formal qualities, historical and cultural contexts, intents, and meanings."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a sound understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create a website that includes:"}
        },
        {
            "competencyText": {"en-us": "create a fully functional online game that includes:"}
        },
        {
            "competencyText": {"en-us": "create a digital portfolio."}
        },
        {
            "competencyText": {"en-us": "Independent Study in Technology Applications (One-Half to One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.49 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. The prerequisite for this course is completion of a high school technology applications course as identified in this subchapter and permission of the instructor/mentor for Independent Study in Technology Applications. This course may be taken at Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving, and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of technology applications foundations, including technology-related terms, concepts, and data input strategies, students will communicate information in different formats and to diverse audiences using a variety of technologies. Students will learn to make informed decisions; develop and produce original work that exemplifies the standards identified by the selected profession or discipline; and publish the product in electronic media and print. Students will practice the efficient acquisition of information by identifying task requirements, using search strategies, and using technology to access, analyze, and evaluate the acquired information. By using technology as a tool that supports the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student demonstrates creative thinking, constructs knowledge, and develops innovative products and processes using technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply existing knowledge to promote creativity in designing new technology products or services;"}
        },
        {
            "competencyText": {"en-us": "design and implement procedures to track trends, set timelines, and review and evaluate progress for continual improvement in process and product;"}
        },
        {
            "competencyText": {"en-us": "produce electronic documentation to illustrate the progress of a project;"}
        },
        {
            "competencyText": {"en-us": "seek and respond to input from peers and professionals in delineating technological tasks and problem solving;"}
        },
        {
            "competencyText": {"en-us": "make necessary revisions and/or proceed to the next stage of study;"}
        },
        {
            "competencyText": {"en-us": "use technology terminology appropriate to the independent study course;"}
        },
        {
            "competencyText": {"en-us": "develop and apply advanced creativity and innovation employed in technology applications skills;"}
        },
        {
            "competencyText": {"en-us": "identify and solve problems, individually and with input from peers and professionals, using research methods and advanced creativity and innovation skills used in a selected profession or discipline;"}
        },
        {
            "competencyText": {"en-us": "develop products that meet standards identified by the selected profession or discipline; and"}
        },
        {
            "competencyText": {"en-us": "produce original work to solve an identified problem and publish a product in electronic media and print."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student uses digital media and environments to communicate and work collaboratively, including at a distance, to support individual learning and contribute to the learning experience of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "format developed projects according to defined output specifications, including target audience and viewing environment;"}
        },
        {
            "competencyText": {"en-us": "present findings to a panel for comment and professional response;"}
        },
        {
            "competencyText": {"en-us": "determine and implement the best method of presenting or publishing findings;"}
        },
        {
            "competencyText": {"en-us": "synthesize and publish information in a variety of print or digital formats;"}
        },
        {
            "competencyText": {"en-us": "use evolving network and Internet resources and appropriate technology skills to create, exchange, and publish information;"}
        },
        {
            "competencyText": {"en-us": "develop cultural understanding and global awareness by interacting with learners of other cultures through evolving digital formats and communication methods;"}
        },
        {
            "competencyText": {"en-us": "collaborate with others to identify a problem to be solved, hypotheses, and strategies to accomplish a task;"}
        },
        {
            "competencyText": {"en-us": "participate with electronic communities as a learner, initiator, contributor, and facilitator/mentor; and"}
        },
        {
            "competencyText": {"en-us": "participate in relevant, meaningful activities in the larger community and society to create electronic projects."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student applies digital tools to gather, evaluate, and use information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use evolving network and Internet resources for research and resource sharing of technology applications;"}
        },
        {
            "competencyText": {"en-us": "apply appropriate search strategies in the acquisition of information from the Internet, including keyword and Boolean search strategies;"}
        },
        {
            "competencyText": {"en-us": "pose hypotheses and questions related to a selected problem;"}
        },
        {
            "competencyText": {"en-us": "acquire information using appropriate research strategies with source citations through electronic formats, including interactive components, text, audio, video, graphics, and simulations; and"}
        },
        {
            "competencyText": {"en-us": "identify, create, and use available file formats, including text, image, video, and audio files."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses critical-thinking skills to plan and conduct research, manage projects, solve problems, and make informed decisions using appropriate digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate the design, functionality, and accuracy of the accessed information;"}
        },
        {
            "competencyText": {"en-us": "conduct systematic research;"}
        },
        {
            "competencyText": {"en-us": "demonstrate creative-thinking and problem-solving skills;"}
        },
        {
            "competencyText": {"en-us": "integrate appropriate productivity tools, including network, mobile access, and multimedia tools, in the creation of solutions to problems;"}
        },
        {
            "competencyText": {"en-us": "use enriched curricular content in the creation of products;"}
        },
        {
            "competencyText": {"en-us": "synthesize and generate new information from data gathered from electronic resources;"}
        },
        {
            "competencyText": {"en-us": "read and use technical documentation; and"}
        },
        {
            "competencyText": {"en-us": "write simple technical documentation relative to the audience."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student understands human, cultural, and societal issues related to technology and practices legal and ethical behavior. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "discuss intellectual property, privacy, sharing of information, copyright laws, and software licensing agreements;"}
        },
        {
            "competencyText": {"en-us": "model ethical acquisition and use of digital information;"}
        },
        {
            "competencyText": {"en-us": "model respect of intellectual property when editing graphics, video, text, and sound files;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper etiquette, responsible use of software, and knowledge of acceptable use policies when using network resources;"}
        },
        {
            "competencyText": {"en-us": "demonstrate best practices in understanding and applying information security;"}
        },
        {
            "competencyText": {"en-us": "develop and maintain a technical documentation library in a variety of formats; and"}
        },
        {
            "competencyText": {"en-us": "investigate how technology has changed and the social and ethical ramifications of computer usage."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a sound understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge and appropriate use of input devices, operating systems, software applications, and communication and networking components;"}
        },
        {
            "competencyText": {"en-us": "select, acquire, and use appropriate digital tools;"}
        },
        {
            "competencyText": {"en-us": "delineate and make necessary adjustments regarding compatibility issues, including digital file formats and cross-platform connectivity; and"}
        },
        {
            "competencyText": {"en-us": "use appropriate technology terminology and naming conventions."}
        },
        {
            "competencyText": {"en-us": "Independent Study in Evolving/Emerging Technologies (One-Half to One Credit), Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.50 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. The prerequisite for this course is completion of a high school technology applications course as identified in this subchapter and permission of the instructor/mentor for Independent Study in Evolving/Emerging Technologies. This course may be taken at Grades 9-12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The technology applications curriculum has six strands based on the National Educational Technology Standards for Students (NETS\u0095S) and performance indicators developed by the International Society for Technology in Education (ISTE): creativity and innovation; communication and collaboration; research and information fluency; critical thinking, problem solving and decision making; digital citizenship; and technology operations and concepts."}
        },
        {
            "competencyText": {"en-us": "Through the study of evolving/emerging technologies, including technology-related terms, concepts, and data input strategies, students will communicate information in different formats and to diverse audiences using a variety of technologies. Students will learn to make informed decisions, develop and produce original work that exemplifies the standards identified by the selected profession or discipline, and publish the product in electronic media and print. Students will demonstrate efficient acquisition of information by identifying task requirements, using search strategies, and using technology to access, analyze, and evaluate the acquired information. By using technology as a tool that supports the work of individuals and groups in solving problems, students will select the technology appropriate for the task, synthesize knowledge, create solutions, and evaluate the results."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Creativity and innovation. The student demonstrates creative thinking, constructs knowledge, and develops innovative products and processes using technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply existing knowledge to promote creativity in designing new technology products or services;"}
        },
        {
            "competencyText": {"en-us": "design and implement procedures to track trends, set timelines, and review and evaluate progress for continual improvement in process and product;"}
        },
        {
            "competencyText": {"en-us": "produce electronic documentation to illustrate the progress of a project;"}
        },
        {
            "competencyText": {"en-us": "seek and respond to input from peers and professionals in delineating technological tasks and problem solving;"}
        },
        {
            "competencyText": {"en-us": "make necessary revisions and/or proceed to the next stage of study;"}
        },
        {
            "competencyText": {"en-us": "use technology terminology appropriate to the independent study course;"}
        },
        {
            "competencyText": {"en-us": "develop and apply advanced creativity and innovation employed in technology applications skills;"}
        },
        {
            "competencyText": {"en-us": "identify and solve problems, individually and with input from peers and professionals, using research methods and advanced creativity and innovation skills used in a selected profession or discipline;"}
        },
        {
            "competencyText": {"en-us": "develop products that meet standards identified by a selected profession or discipline; and"}
        },
        {
            "competencyText": {"en-us": "produce original work to solve an identified problem and publish a product in electronic media and print."}
        },
        {
            "competencyText": {"en-us": "Communication and collaboration. The student uses digital media and environments to communicate and work collaboratively, including at a distance, to support individual learning and contribute to the learning experience of others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "format developed projects according to defined output specifications, including target audience and viewing environment;"}
        },
        {
            "competencyText": {"en-us": "present findings to a panel for comment and professional response;"}
        },
        {
            "competencyText": {"en-us": "determine and implement the best method of presenting or publishing findings;"}
        },
        {
            "competencyText": {"en-us": "synthesize and publish information in a variety of print or digital formats;"}
        },
        {
            "competencyText": {"en-us": "use evolving network resources and appropriate technology skills to create, exchange, and publish information;"}
        },
        {
            "competencyText": {"en-us": "develop cultural understanding and global awareness by interacting with learners of other cultures through evolving digital formats and communication methods;"}
        },
        {
            "competencyText": {"en-us": "collaborate with others to identify a problem to be solved, hypotheses, and strategies to accomplish a task;"}
        },
        {
            "competencyText": {"en-us": "participate with electronic communities as a learner, initiator, contributor, and facilitator/mentor; and"}
        },
        {
            "competencyText": {"en-us": "participate in relevant, meaningful activities in the larger community and society to create electronic projects."}
        },
        {
            "competencyText": {"en-us": "Research and information fluency. The student applies digital tools to gather, evaluate, and use information. The student uses a variety of strategies to acquire information from electronic resources, with appropriate supervision. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use evolving network and Internet resources for research and resource sharing of technology applications;"}
        },
        {
            "competencyText": {"en-us": "apply appropriate search strategies in the acquisition of information from the Internet, including keyword and Boolean search strategies;"}
        },
        {
            "competencyText": {"en-us": "pose hypotheses and questions related to a selected problem;"}
        },
        {
            "competencyText": {"en-us": "acquire information using appropriate research strategies with source citations through electronic formats, including interactive components, text, audio, video, graphics, and simulations; and"}
        },
        {
            "competencyText": {"en-us": "identify, create, and use available file formats, including text, image, video, and audio files."}
        },
        {
            "competencyText": {"en-us": "Critical thinking, problem solving, and decision making. The student uses critical-thinking skills to plan and conduct research, manage projects, solve problems, and make informed decisions using appropriate digital tools and resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate the design, functionality, and accuracy of the accessed information;"}
        },
        {
            "competencyText": {"en-us": "conduct systematic research;"}
        },
        {
            "competencyText": {"en-us": "demonstrate creative-thinking and problem-solving skills;"}
        },
        {
            "competencyText": {"en-us": "integrate appropriate productivity tools, including network, mobile access, and multimedia tools, in the creation of solutions to problems;"}
        },
        {
            "competencyText": {"en-us": "use enriched curricular content in the creation of products;"}
        },
        {
            "competencyText": {"en-us": "synthesize and generate new information from data gathered from electronic resources;"}
        },
        {
            "competencyText": {"en-us": "read and use technical documentation; and"}
        },
        {
            "competencyText": {"en-us": "write simple technical documentation relative to the audience."}
        },
        {
            "competencyText": {"en-us": "Digital citizenship. The student understands human, cultural, and societal issues related to technology and practices legal and ethical behavior. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "discuss intellectual property, privacy, sharing of information, copyright laws, and software licensing agreements;"}
        },
        {
            "competencyText": {"en-us": "model ethical acquisition and use of digital information;"}
        },
        {
            "competencyText": {"en-us": "model respect of intellectual property when editing graphics, video, text, and sound files;"}
        },
        {
            "competencyText": {"en-us": "demonstrate proper etiquette, responsible use of software, and knowledge of acceptable use policies when using network resources;"}
        },
        {
            "competencyText": {"en-us": "demonstrate best practices in understanding and applying information security;"}
        },
        {
            "competencyText": {"en-us": "develop and maintain a technical documentation library in a variety of formats; and"}
        },
        {
            "competencyText": {"en-us": "investigate how technology has changed and the social and ethical ramifications of computer usage."}
        },
        {
            "competencyText": {"en-us": "Technology operations and concepts. The student demonstrates a sound understanding of technology concepts, systems, and operations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate knowledge and appropriate use of input devices, operating systems, software applications, and communication and networking components;"}
        },
        {
            "competencyText": {"en-us": "select, acquire, and use appropriate digital tools;"}
        },
        {
            "competencyText": {"en-us": "delineate and make necessary adjustments regarding compatibility issues, including digital file formats and cross-platform connectivity; and"}
        },
        {
            "competencyText": {"en-us": "use appropriate technology terminology and naming conventions."}
        },
        {
            "competencyText": {"en-us": "a word processing document using digital typography standards such as page layout, font formatting, paragraph formatting, and list attributes;"}
        },
        {
            "competencyText": {"en-us": "a spreadsheet workbook using basic computational and graphic components such as basic formulas and functions, data types, and chart generation;"}
        },
        {
            "competencyText": {"en-us": "a database by manipulating components such as entering and searching for relevant data; and"}
        },
        {
            "competencyText": {"en-us": "a digital publication using relevant publication standards;"}
        },
        {
            "competencyText": {"en-us": "a word processing document using digital typography standards such as page layout, font formatting, paragraph formatting, and list attributes;"}
        },
        {
            "competencyText": {"en-us": "a spreadsheet workbook using advanced computational and graphic components such as complex formulas, basic functions, data types, and chart generation;"}
        },
        {
            "competencyText": {"en-us": "a database by manipulating components such as defining fields, entering data, and designing layouts appropriate for reporting; and"}
        },
        {
            "competencyText": {"en-us": "a digital publication using relevant publication standards;"}
        },
        {
            "competencyText": {"en-us": "a word processing document using digital typography standards such as page layout, font formatting, paragraph formatting, mail merge, and list attributes;"}
        },
        {
            "competencyText": {"en-us": "a spreadsheet workbook using advanced computational and graphic components such as complex formulas, advanced functions, data types, and chart generation;"}
        },
        {
            "competencyText": {"en-us": "a database by manipulating components, including defining fields, entering data, and designing layouts appropriate for reporting; and"}
        },
        {
            "competencyText": {"en-us": "a digital publication using relevant publication standards and graphic design principles;"}
        },
        {
            "competencyText": {"en-us": "create a plan for a media project such as a storyboard, stage development, and identification of equipment and resources; and"}
        },
        {
            "competencyText": {"en-us": "evaluate design, content delivery, purpose, and audience throughout a project's timeline and make suggested revisions until completion of the project;"}
        },
        {
            "competencyText": {"en-us": "acquire readily available digital information, including text, audio, video, and graphics, citing the sources;"}
        },
        {
            "competencyText": {"en-us": "create digital content through the use of various devices such as video camera, digital camera, scanner, microphone, interactive whiteboard, video capture, and musical instrument;"}
        },
        {
            "competencyText": {"en-us": "collaborate via online tools such as blogs, discussion boards, email, and online learning communities;"}
        },
        {
            "competencyText": {"en-us": "make decisions regarding the selection and use of software, taking into consideration operating system platform, quality, appropriateness, effectiveness, and efficiency;"}
        },
        {
            "competencyText": {"en-us": "delineate and make necessary adjustments regarding compatibility issues, including digital file formats and cross-platform connectivity; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate the ability to import and export elements from one program to another;"}
        },
        {
            "competencyText": {"en-us": "one space after punctuation, the use of em- and en-dashes, and smart quotation marks;"}
        },
        {
            "competencyText": {"en-us": "categories of type, font, size, style, and alignment appropriate for the task;"}
        },
        {
            "competencyText": {"en-us": "type techniques such as drop cap, decorative letters, or embedded text frames as graphic elements;"}
        },
        {
            "competencyText": {"en-us": "leading and kerning, automatic text flow into linked columns, widows and orphans, and text wrap; and"}
        },
        {
            "competencyText": {"en-us": "type measurement for inches and picas;"}
        },
        {
            "competencyText": {"en-us": "incorporate the principles of design, including balance, contrast, dominant element, white space, consistency, repetition, alignment, and proximity;"}
        },
        {
            "competencyText": {"en-us": "apply the elements of design, including text, graphics, and white space;"}
        },
        {
            "competencyText": {"en-us": "apply color principles appropriate to the product in order to communicate the mood for the specific audience;"}
        },
        {
            "competencyText": {"en-us": "identify the parts of pages, including inside margin, outside margin, and gutter;"}
        },
        {
            "competencyText": {"en-us": "create a master template, including page specifications and other repetitive elements; and"}
        },
        {
            "competencyText": {"en-us": "use style sheets, including a variety of type specifications such as typeface, style, size, alignment, indents, and tabs;"}
        },
        {
            "competencyText": {"en-us": "use digital photography equipment to capture still-shot images that incorporate various photo composition techniques, including lighting, perspective, candid versus posed, rule of thirds, and filling the frame;"}
        },
        {
            "competencyText": {"en-us": "transfer digital images from equipment to the computer; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate image enhancement techniques such as feathering, layering, color enhancement, and image selection using appropriate digital manipulation software;"}
        },
        {
            "competencyText": {"en-us": "use digital photography equipment to capture video that incorporates video principles such as lighting, zooming, panning, and stabilization;"}
        },
        {
            "competencyText": {"en-us": "transfer video from equipment to the computer;"}
        },
        {
            "competencyText": {"en-us": "demonstrate videographic enhancement and editing techniques such as transitions, zooming, content editing, and synchronizing audio and video using appropriate digital manipulation software; and"}
        },
        {
            "competencyText": {"en-us": "export video in digital formats to be used in various delivery systems such as podcasting, downloadable media, embedding, and streaming; and"}
        },
        {
            "competencyText": {"en-us": "produce digital files in various formats such as portable document format (PDF), portable network graphics (PNG), and HyperText Markup Language (HTML);"}
        },
        {
            "competencyText": {"en-us": "publish integrated digital content such as video, audio, text, graphics, and motion graphics following appropriate digital etiquette standards;"}
        },
        {
            "competencyText": {"en-us": "publish and share projects using online methods such as social media and collaborative sites;"}
        },
        {
            "competencyText": {"en-us": "incorporate various digital media into a printed document such as a newsletter, poster, or report;"}
        },
        {
            "competencyText": {"en-us": "use printing options such as tiling, color separations, and collation; and"}
        },
        {
            "competencyText": {"en-us": "collect and organize student-created products to build an individual portfolio."}
        },
        {
            "competencyText": {"en-us": "an interactive database with elements such as SQL statements, Extensible Markup Language (XML), and Open Database Connectivity (ODBC);"}
        },
        {
            "competencyText": {"en-us": "javascript; and"}
        },
        {
            "competencyText": {"en-us": "server-side processing, including Common Gateway Interface (CGI); bitmap and vector graphics; database creation, modification, and deletion; creation and maintenance of user accounts; user authentication; and documentation;"}
        },
        {
            "competencyText": {"en-us": "multiple game levels with increasing difficulty;"}
        },
        {
            "competencyText": {"en-us": "high-score ranking;"}
        },
        {
            "competencyText": {"en-us": "physics, including center of mass, collision detection, lighting, shading, perspective, anatomy, motion blur, lens flare, and reflections;"}
        },
        {
            "competencyText": {"en-us": "art principles, including color theory, texture, balance, lighting, shading, skinning, and drawing;"}
        },
        {
            "competencyText": {"en-us": "graphics resolution, including pixel depth and compression;"}
        },
        {
            "competencyText": {"en-us": "database creation, modification, and deletion;"}
        },
        {
            "competencyText": {"en-us": "creation and maintenance of user accounts;"}
        },
        {
            "competencyText": {"en-us": "user authentication;"}
        },
        {
            "competencyText": {"en-us": "artificial intelligence;"}
        },
        {
            "competencyText": {"en-us": "game-level saving;"}
        },
        {
            "competencyText": {"en-us": "mathematical functions;"}
        },
        {
            "competencyText": {"en-us": "varying camera angles;"}
        },
        {
            "competencyText": {"en-us": "VoIP for online web games; and"}
        },
        {
            "competencyText": {"en-us": "documentation; and"}
        },
        {
            "competencyText": {"en-us": "Implementation of Texas Essential Knowledge and Skills for Technology Applications, Elementary, Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.5 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "Implementation of Texas Essential Knowledge and Skills for Technology Applications, Middle School, Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.13 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "Implementation of Texas Essential Knowledge and Skills for Technology Applications, High School, Beginning with School Year 2012-2013."},
            "comment": {
                "en-us": ["Source: The provisions of this §126.31 adopted to be effective September 26, 2011, 36 TexReg 6263."]
            }
        },
        {
            "competencyText": {"en-us": "The provisions of §126.6 and §126.7 of this subchapter shall be implemented by school districts beginning with the 2012-2013 school year."}
        },
        {
            "competencyText": {"en-us": "The provisions of §§126.14-126.16 of this subchapter shall be implemented by school districts beginning with the 2012-2013 school year."}
        },
        {
            "competencyText": {"en-us": "The provisions of §§126.32-126.50 of this subchapter shall be implemented by school districts beginning with the 2012-2013 school year."}
        }
    ]
}