{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210e",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://teks-api.texasgateway.org/ims/case/v1p0/CFDocuments/191e3393-f863-5361-b193-54e9eae63961",
        "name": {"en-us": "Chapter 74. Elective Courses on the Bible"},
        "description": {"en-us": "Chapter 74. Elective Courses on the Bible"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "Requirements for Elective Courses on the Bible's Hebrew Scriptures (Old Testament) and New Testament and Their Impact on the History and Literature of Western Civilization."}
        },
        {
            "competencyText": {"en-us": "Pursuant to this rule, a school district may offer to students in Grade 9 or above:"}
        },
        {
            "competencyText": {"en-us": "an elective course on the Hebrew Scriptures (Old Testament) and its impact and an elective course on the New Testament and its impact; or"}
        },
        {
            "competencyText": {"en-us": "an elective course that combines the courses on the Hebrew Scriptures (Old Testament) and its impact and on the New Testament and its impact."}
        },
        {
            "competencyText": {"en-us": "The purpose of a course under this section is to:"}
        },
        {
            "competencyText": {"en-us": "teach students knowledge of biblical content, characters, poetry, and narratives that are prerequisites to understanding contemporary society and culture, including literature, art, music, mores, oratory, and public policy; and"}
        },
        {
            "competencyText": {"en-us": "familiarize students with, as applicable:"}
        },
        {
            "competencyText": {"en-us": "the contents of the Hebrew Scriptures or New Testament;"}
        },
        {
            "competencyText": {"en-us": "the history of the Hebrew Scriptures or New Testament;"}
        },
        {
            "competencyText": {"en-us": "the literary style and structure of the Hebrew Scriptures or New Testament; and"}
        },
        {
            "competencyText": {"en-us": "the influence of the Hebrew Scriptures or New Testament on law, history, government, literature, art, music, customs, morals, values, and culture."}
        },
        {
            "competencyText": {"en-us": "A course offered under this section shall follow applicable law and all federal and state guidelines in maintaining religious neutrality and accommodating the diverse religious views, traditions, and perspectives of students in their school district. A course under this section shall not endorse, favor, or promote, or disfavor or show hostility toward, any particular religion or nonreligious faith or religious perspective."}
        },
        {
            "competencyText": {"en-us": "Beginning with school year 2011-2012, a course offered under this section shall follow the Texas Essential Knowledge and Skills for Special Topics in Social Studies, Beginning with School Year 2011-2012, or the Texas Essential Knowledge and Skills for Independent Study in English as set out in this subsection."}
        },
        {
            "competencyText": {"en-us": "Texas Essential Knowledge and Skills for Special Topics in Social Studies (One-Half Credit), Beginning with School Year 2011-2012. The provisions of this paragraph shall be implemented by school districts beginning with the 2011-2012 school year."}
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half unit of credit for successful completion of this course. Students may take this course with different course content for a maximum of two credits."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "In Special Topics in Social Studies, an elective course, students are provided the opportunity to develop a greater understanding of the historic, political, economic, geographic, multicultural, and social forces that have shaped their lives and the world in which they live. Students will use social science knowledge and skills to engage in rational and logical analysis of complex problems using a variety of approaches, while recognizing and appreciating diverse human perspectives."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "State and federal laws mandate a variety of celebrations and observances, including Celebrate Freedom Week."}
        },
        {
            "competencyText": {"en-us": "Each social studies class shall include, during Celebrate Freedom Week as provided under Texas Education Code, ยง29.907, or during another full school week as determined by the board of trustees of a school district, appropriate instruction concerning the intent, meaning, and importance of the Declaration of Independence and the U.S. Constitution, including the Bill of Rights, in their historical contexts. The study of the Declaration of Independence must include the study of the relationship of the ideas expressed in that document to subsequent American history, including the relationship of its ideas to the rich diversity of our people as a nation of immigrants, the American Revolution, the formulation of the U.S. Constitution, and the abolitionist movement, which led to the Emancipation Proclamation and the women's suffrage movement."}
        },
        {
            "competencyText": {"en-us": "Each school district shall require that, during Celebrate Freedom Week or other week of instruction prescribed under subclause (I) of this clause, students in Grades 3-12 study and recite the following text: \"We hold these Truths to be self-evident, that all Men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the Pursuit of Happiness--That to secure these Rights, Governments are instituted among Men, deriving their just Powers from the Consent of the Governed.\""}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student uses problem-solving and decision-making skills, working independently and with others, in a variety of settings. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply social studies methodologies encompassing a variety of research and analytical tools to explore questions or issues thoroughly and fairly to include multiple perspectives;"}
        },
        {
            "competencyText": {"en-us": "evaluate effects of major political, economic, and social conditions on selected social studies topic;"}
        },
        {
            "competencyText": {"en-us": "appraise a geographic perspective that considers physical and cultural processes as they affect the selected topic;"}
        },
        {
            "competencyText": {"en-us": "examine the role of diverse communities in the context of the selected topic;"}
        },
        {
            "competencyText": {"en-us": "analyze ethical issues raised by the selected topic in historic, cultural, and social contexts;"}
        },
        {
            "competencyText": {"en-us": "depending on the topic, use a problem-solving process to identify a problem, gather information, list and consider options, consider advantages and disadvantages, choose and implement a solution, and evaluate the effectiveness of the solution; and"}
        },
        {
            "competencyText": {"en-us": "depending on the topic, use a decision-making process to identify a situation that requires a decision, gather information, identify options, predict consequences, and take action to implement a decision."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student applies critical-thinking skills to organize and use information acquired from a variety of sources, including electronic technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "locate, analyze, organize, synthesize, evaluate, and apply information about selected topic, identifying, describing, and evaluating multiple points of view;"}
        },
        {
            "competencyText": {"en-us": "differentiate between valid primary and secondary sources and use them appropriately to conduct research and construct arguments;"}
        },
        {
            "competencyText": {"en-us": "read narrative texts critically and identify points of view from the historical context surrounding an event and the frame of reference that influenced the participants;"}
        },
        {
            "competencyText": {"en-us": "analyze information by sequencing, categorizing, identifying cause-and-effect relationships, comparing, contrasting, finding the main idea, summarizing, making generalizations and predictions, and drawing inferences and conclusions;"}
        },
        {
            "competencyText": {"en-us": "collect visual images (photographs, paintings, political cartoons, and other media) to enhance understanding and appreciation of multiple perspectives in a social studies topic;"}
        },
        {
            "competencyText": {"en-us": "identify bias in written, oral, and visual material;"}
        },
        {
            "competencyText": {"en-us": "evaluate the validity of a source based on language, corroboration with other sources, and information about the author; and"}
        },
        {
            "competencyText": {"en-us": "use appropriate mathematical skills to interpret social studies information such as maps and graphs."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student creates written, oral, and visual presentations of social studies information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply the conventions of usage and mechanics of written English;"}
        },
        {
            "competencyText": {"en-us": "use social studies terminology correctly;"}
        },
        {
            "competencyText": {"en-us": "use appropriate oral communication techniques;"}
        },
        {
            "competencyText": {"en-us": "construct a thesis that is supported by evidence;"}
        },
        {
            "competencyText": {"en-us": "recognize and evaluate counter arguments;"}
        },
        {
            "competencyText": {"en-us": "use visual images (photographs, paintings, and other media) to facilitate understanding and appreciation of multiple perspectives in a social studies topic;"}
        },
        {
            "competencyText": {"en-us": "develop a bibliography with ideas and information attributed to source materials and authors using accepted social science formats such as Modern Language Association Style Manual (MLA) and Chicago Manual of Style (CMS) to document sources and format written materials; and"}
        },
        {
            "competencyText": {"en-us": "use computer software to create written, graphic, or visual products from collected data."}
        },
        {
            "competencyText": {"en-us": "Texas Essential Knowledge and Skills for Independent Study in English (One-Half to One Credit). The provisions of this paragraph shall be implemented by school districts beginning with the 2011-2012 school year."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Students enrolled in Independent Study in English will focus on a specialized area of study such as the work of a particular author or genre. Students will read and write in multiple forms for a variety of audiences and purposes. High school students are expected to plan, draft, and complete written compositions on a regular basis and carefully examine their papers for clarity, engaging language, and the correct use of the conventions and mechanics of written English."}
        },
        {
            "competencyText": {"en-us": "If this course is being used to satisfy requirements for the Distinguished Achievement Program, a student research/product must be presented before a panel of professionals or approved by the student's mentor."}
        },
        {
            "competencyText": {"en-us": "For high school students whose first language is not English, the students' native language serves as a foundation for English language acquisition and language learning."}
        },
        {
            "competencyText": {"en-us": "Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "The essential knowledge and skills as well as the student expectations for Independent Study in English are described in subparagraph (B) of this paragraph."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "The student inquires through reading literature and researching self-selected and assigned topics. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "read widely for further study;"}
        },
        {
            "competencyText": {"en-us": "generate relevant, interesting, and researchable questions with instructor guidance and approval; and"}
        },
        {
            "competencyText": {"en-us": "draw relevant questions for further study from the research findings or conclusions."}
        },
        {
            "competencyText": {"en-us": "The student uses writing as a tool for learning and research. The student produces visual representations that communicate with others. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "produce research projects and reports in multiple forms for a variety of audiences from primary and secondary sources using available technology;"}
        },
        {
            "competencyText": {"en-us": "conduct a research project(s), producing an original work in print or another medium with a demonstration of advanced skill;"}
        },
        {
            "competencyText": {"en-us": "use writing to organize and support what is known and needs to be learned about a topic, including discovering, recording, reviewing, and learning;"}
        },
        {
            "competencyText": {"en-us": "compile written ideas and representations; interpret information into reports, summaries, or other formats; and draw conclusions; and"}
        },
        {
            "competencyText": {"en-us": "use writing as a tool such as to reflect, explore, or problem solve."}
        }
    ]
}