{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://teks-api.texasgateway.org/ims/case/v1p0/CFDocuments/f72881dd-9796-57da-a12a-f649e03f4c92",
        "name": {"en-us": "Chapter 114. Languages Other Than English"},
        "description": {"en-us": "Chapter 114. Languages Other Than English"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "Subchapter C. High School"}
        },
        {
            "competencyText": {"en-us": "Discovering Languages and Cultures (One-Half to One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.32 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Discovering Languages and Cultures is a non-sequential elective course that can be offered in elementary, middle, or high school. At the high school level, students shall be awarded one-half to one elective credit for successful completion of this course."}
        },
        {
            "competencyText": {"en-us": "Using age-appropriate activities, students explore a variety of aspects of one or more languages and cultures and/or develop basic language learning and communicative skills."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Discovery courses in LOTE allow the student to explore other languages and cultures. The student demonstrates an understanding of the elements of language(s), demonstrates an understanding of cultures, and develops effective language study skills. ACTFL has established guidelines for proficiency levels that are used as a basis for the Texas essential knowledge and skills for LOTE. ACTFL has identified national standards in the Standards for Foreign Language Learning in the 21st Century (the five C's of foreign language education). These standards describe the \"what\" (content) of world languages learning and form the core standards-based instruction in the world languages classroom."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "The student demonstrates an understanding of the elements of language(s). The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in different types of language learning activities;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast aspects of other languages to English and the student's native language; and"}
        },
        {
            "competencyText": {"en-us": "apply basic communication skills in the target language(s), including listening, speaking, reading, and writing."}
        },
        {
            "competencyText": {"en-us": "The student demonstrates an understanding of cultures. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and describe cultural practices in selected regions or countries;"}
        },
        {
            "competencyText": {"en-us": "recognize the cultural products such as art, music, food, clothing, or other culturally related examples in selected regions or countries; and"}
        },
        {
            "competencyText": {"en-us": "compare and contrast aspects of other cultures to the student's own culture."}
        },
        {
            "competencyText": {"en-us": "The student develops effective language study skills. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in a variety of language learning strategies such as identifying cognates and recognizing word origins; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an awareness of language patterns such as word/character order, grammatical structures, and symbols."}
        },
        {
            "competencyText": {"en-us": "Special Topics in Language and Culture (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.33 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. This course cannot be considered a part of the coherent sequence of languages other than English (LOTE) courses required for any endorsement. This course will not count as a level II LOTE course. Students who desire to continue with LOTE study will need to take level II or higher LOTE courses. This course may be substituted for a level II LOTE course upon approval by:"}
        },
        {
            "competencyText": {"en-us": "the student's level I LOTE classroom teacher, the principal or designee, and the student's parent or person standing in parental relation who determine that the student is not likely to be successful in a level II LOTE course;"}
        },
        {
            "competencyText": {"en-us": "the student's admission, review, and dismissal (ARD) committee if the student receives special education services under the Texas Education Code (TEC), Chapter 29, Subchapter A; or"}
        },
        {
            "competencyText": {"en-us": "the committee established for the student under Section 504, Rehabilitation Act of 1973 (29 United States Code, §794) if the student does not receive special education services under the TEC, Chapter 29, Subchapter A, but is covered by the Rehabilitation Act of 1973."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral, written, or signed communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken, written, or signed communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, or visual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally, in writing, or in sign, information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to a signing or presenting orally to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for LOTE. The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "In the Special Topics in Language and Culture course, students demonstrate novice level communication skills acquired in a LOTE level I course, develop a greater understanding of other cultures, make connections to other disciplines, draw comparisons between languages and cultures, and effectively engage in global communities. Students enhance their personal and public lives, and meet the career demands of the 21st century, by gaining insight into other world languages and cultures."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Communication. The student communicates an understanding of the elements of languages. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "introduce self and others using basic, culturally-appropriate greetings;"}
        },
        {
            "competencyText": {"en-us": "ask simple questions and provide simple responses related to personal preferences; and"}
        },
        {
            "competencyText": {"en-us": "exchange essential information about self, family, and familiar topics."}
        },
        {
            "competencyText": {"en-us": "Cultures. The student identifies the practices, products, and perspectives of selected cultures. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and describe selected cultural practices and perspectives such as traditions, daily life, and celebrations;"}
        },
        {
            "competencyText": {"en-us": "examine significant historic and contemporary influences from the cultures studied such as explorers, artists, musicians, and athletes; and"}
        },
        {
            "competencyText": {"en-us": "describe various products across cultures such as food, shelter, clothing, transportation, sports and recreation, music, art, and dance."}
        },
        {
            "competencyText": {"en-us": "Connections. The student describes connections between world languages and other disciplines. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use authentic materials such as maps, graphs, graphic organizers, and other print and visual materials or literature to reinforce comprehension and expression of basic vocabulary in the target language; and"}
        },
        {
            "competencyText": {"en-us": "research and present information on historical and contemporary cultural influences."}
        },
        {
            "competencyText": {"en-us": "Comparisons. The student develops insight into the nature of the target language and culture by comparing the student's own language and culture to another. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare and contrast selected cultural practices and perspectives such as traditions, daily life, and celebrations to student's own culture;"}
        },
        {
            "competencyText": {"en-us": "give examples of cognates, false cognates, idiomatic expressions, or sentence structure to show understanding of how languages are alike and different; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate how media such as television, Internet, newspapers, and advertisements represent selected cultural similarities and differences."}
        },
        {
            "competencyText": {"en-us": "Communities. The student gains an understanding of cultures represented by LOTE to enhance global perspective, personal growth, and enrichment. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "participate in cultural events in local, global, or online communities and discuss experiences and perspectives gained;"}
        },
        {
            "competencyText": {"en-us": "research careers in which cross-cultural awareness or LOTE language skills are needed; and"}
        },
        {
            "competencyText": {"en-us": "describe how cultural awareness impacts personal growth."}
        },
        {
            "competencyText": {"en-us": "American Sign Language, Level I (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.34 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Level I can be offered in elementary, middle, or high school. At the high school level, students shall be awarded one credit for successful completion of this course. There is no prerequisite required for this course."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage receptively and expressively in conversations, to present information expressively to an audience, and to comprehend cultural and linguistic aspects of the language. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct signed communication with others without voice. Examples of this \"two-way\" communication include but are not limited to signing face to face or in a group discussion. Interpersonal communication includes receptive and expressive skills."}
        },
        {
            "competencyText": {"en-us": "In interpretive (receptive) mode of communication, students demonstrate understanding of receptively viewed communication within appropriate cultural contexts. Examples of this type of \"one-way\" receptive comprehension include but are not limited to American Sign Language (ASL) video weblogs (or vlogs), other signed presentations, and signed DVD conversations."}
        },
        {
            "competencyText": {"en-us": "In presentational (expressive) mode of communication, students present information in expressive form without voice to an audience of receptive listeners with whom there is no immediate expressive interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to an expressively signed presentation to a group or recorded presentation where there is no receptive listener present to respond."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "ASL difficulty has been determined by standards of the Foreign Service Institute and Defense Language Institute as a Level IV out of four (Level IV being the most difficult). The American Sign Language Teachers Association (ASLTA) states the challenge to ASL is primarily in the modality of learning. This conclusion is based on the complex grammar system and significant structural and cultural differences in the language. Students are generally seated in a semi-circle to facilitate visual communication, notes cannot be taken without looking away from the primary source of information, and instruction occurs in the target language where learning is done spatially and words are not processed sequentially. The linear nature of spoken language cannot be used in ASL and the simultaneous expression of complex units is used. The level of difficulty of ASL should be noted."}
        },
        {
            "competencyText": {"en-us": "While other languages possess a spoken and/or written element, ASL incorporates manual components with no verbal and/or written form. ASL is a fully developed natural language that is used by members of the North American Deaf Community. The language is distinct from gestures seen in spoken languages in that signs used in ASL are controlled by the structures of its linguistic system, independent of English. ASL encompasses all of the features that make a language a unique, rule-governed communication system. ASL includes handshapes, movements, and other grammatical features needed to form signs and sentences, and parts combine to make wholes. It is not a simplified language and contains structures and processes that English does not. The premise of Deaf culture is rooted in the language itself and cannot be separated."}
        },
        {
            "competencyText": {"en-us": "ASL is a signed language where the modes of communication involve different skills than written and/or spoken languages. ASL is not a formal written language; glossing is the term used to describe a chosen written system of symbols devised to transcribe signs and nonmanual signals to an English equivalent. Since ASL information is received visually and not in an auditory manner, communication skills in ASL are defined as follows:"}
        },
        {
            "competencyText": {"en-us": "interpretive listening and reading targets are called interpretive receptive;"}
        },
        {
            "competencyText": {"en-us": "one-to-one interpersonal targets are called receptive and expressive; and"}
        },
        {
            "competencyText": {"en-us": "one-to-many presentational speaking is expressed through signs and the target is presentational expressive."}
        },
        {
            "competencyText": {"en-us": "Using age-appropriate materials, students in ASL Level I develop the ability to perform the tasks of the novice language learner. The novice language learner, when dealing with familiar topics, should understand ASL phrases receptively and respond expressively with learned material; sign learned words, concepts, phrases, and sentences; recognize the importance of communication and how it applies to the American Deaf culture; and recognize the importance of accuracy of expression by knowing the components of ASL. Students use expressive and receptive skills for comprehension."}
        },
        {
            "competencyText": {"en-us": "ASL Level I proficiency levels, as defined by ACTFL and ASLTA, are as follows: interpersonal receptive, novice mid; interpersonal expressive, novice mid; interpretive receptive, novice high; and presentational expressive, novice high."}
        },
        {
            "competencyText": {"en-us": "Students who have fully or partially acquired the skills required at each proficiency level through home or other immersion experiences are known as heritage speakers. Heritage speakers may be allowed to accelerate based on their ability to demonstrate a proficiency in the Texas essential knowledge and skills at the prescribed proficiency level and communicate across all modes of communication. According to ASLTA's National K-16 ASL Standards, \"heritage language learning is an emerging issue in ASL instruction. The formal instruction of ASL to deaf is a very recent phenomenon, as is the availability of ASL instruction in K-12 settings for hearing children of deaf parents. Heritage language learning is an important and developing interest in the field of ASL teaching and learning.\""}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Communication. The student communicates in ASL using expressive and receptive communication skills without voice. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in a variety of ASL exchanges of learned material to socialize and to provide and obtain information;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of basic ASL such as simple stories, everyday commands, and brief instructions when dealing with familiar topics;"}
        },
        {
            "competencyText": {"en-us": "convey information in ASL using familiar words, concepts, classifiers, phrases, and sentences to others without voice;"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate usage of ASL phonology, morphology, syntax, semantics, and pragmatics; and"}
        },
        {
            "competencyText": {"en-us": "be exposed to and experience ASL literature such as handshape stories that follows traditional cultural features."}
        },
        {
            "competencyText": {"en-us": "Cultures. The student gains knowledge and understanding of American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "recognize and use Deaf cultural norms to demonstrate an understanding of the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "show evidence of appreciation of ASL literature created by the Deaf and how it applies to the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "show evidence of appreciation of the contributions by the Deaf and how they are applied to the perspectives of American Deaf culture such as historical, geographical, political, artistic, and scientific avenues; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of Deaf history and how it applies to the perspectives of American Deaf culture."}
        },
        {
            "competencyText": {"en-us": "Connections. The student uses ASL to make connections with other subject areas and to acquire information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use resources and digital technology to gain access to information about ASL and Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "use ASL to obtain, reinforce, or expand knowledge of other subject areas."}
        },
        {
            "competencyText": {"en-us": "Comparisons. The student develops insight into the nature of language and culture by comparing the student's own language and culture to ASL and American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the nature of language through comparisons of the student's own language and ASL;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the nature of culture through comparisons of the student's own culture and the American Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of how one language and culture can influence another."}
        },
        {
            "competencyText": {"en-us": "Communities. The student participates in the Deaf/ASL community by using ASL. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the novice proficiency level in or out of the school setting through involvement in cultural activities such as attending Deaf events;"}
        },
        {
            "competencyText": {"en-us": "be aware of methods of technology to communicate with the Deaf/ASL community; and"}
        },
        {
            "competencyText": {"en-us": "show evidence of becoming a lifelong learner by using ASL at the novice proficiency level for personal enrichment and/or career development."}
        },
        {
            "competencyText": {"en-us": "American Sign Language, Level II (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.35 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Level II can be offered in elementary, middle, or high school. At the high school level, students shall be awarded one credit for successful completion of this course. American Sign Language (ASL) Level I is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage receptively and expressively in conversations, to present information expressively to an audience, and to comprehend cultural and linguistic aspects of the language. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct signed communication with others without voice. Examples of this \"two-way\" communication include but are not limited to signing face to face or in a group discussion. Interpersonal communication includes receptive and expressive skills."}
        },
        {
            "competencyText": {"en-us": "In interpretive (receptive) mode of communication, students demonstrate understanding of receptively viewed communication within appropriate cultural contexts. Examples of this type of \"one-way\" receptive comprehension include but are not limited to ASL video weblogs (or vlogs), other signed presentations, and signed DVD conversations."}
        },
        {
            "competencyText": {"en-us": "In presentational (expressive) mode of communication, students present information in expressive form without voice to an audience of receptive listeners with whom there is no immediate expressive interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to an expressively signed presentation to a group or recorded presentation where there is no receptive listener present to respond."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "ASL difficulty has been determined by standards of the Foreign Service Institute and Defense Language Institute as a Level IV out of four (Level IV being the most difficult). The American Sign Language Teachers Association (ASLTA) states the challenge to ASL is primarily in the modality of learning. This conclusion is based on the complex grammar system and significant structural and cultural differences in the language. Students are generally seated in a semi-circle to facilitate visual communication, notes cannot be taken without looking away from the primary source of information, and instruction occurs in the target language where learning is done spatially and words are not processed sequentially. The linear nature of spoken language cannot be used in ASL and the simultaneous expression of complex units is used. The level of difficulty of ASL should be noted."}
        },
        {
            "competencyText": {"en-us": "While other languages possess a spoken and/or written element, ASL incorporates manual components with no verbal and/or written form. ASL is a fully developed natural language that is used by members of the North American Deaf Community. The language is distinct from gestures seen in spoken languages in that signs used in ASL are controlled by the structures of its linguistic system, independent of English. ASL encompasses all of the features that make a language a unique, rule-governed communication system. ASL includes handshapes, movements, and other grammatical features needed to form signs and sentences, and parts combine to make wholes. It is not a simplified language and contains structures and processes that English does not. The premise of Deaf culture is rooted in the language itself and cannot be separated."}
        },
        {
            "competencyText": {"en-us": "ASL is a signed language where the modes of communication involve different skills than written and/or spoken languages. ASL is not a formal written language; glossing is the term used to describe a chosen written system of symbols devised to transcribe signs and nonmanual signals to an English equivalent. Since ASL information is received visually and not in an auditory manner, communication skills in ASL are defined as follows:"}
        },
        {
            "competencyText": {"en-us": "interpretive listening and reading targets are called interpretive receptive;"}
        },
        {
            "competencyText": {"en-us": "one-to-one interpersonal targets are called receptive and expressive; and"}
        },
        {
            "competencyText": {"en-us": "one-to-many presentational speaking is expressed through signs and the target is presentational expressive."}
        },
        {
            "competencyText": {"en-us": "Using age-appropriate materials, students in ASL Level II develop the ability to perform the tasks of the novice-to-intermediate language learner. The novice-to-intermediate language learner, when dealing with familiar topics, should understand ASL phrases receptively and respond expressively with learned material; sign learned words, concepts, phrases, and sentences; recognize the importance of communication and how it applies to the American Deaf culture; and recognize the importance of accuracy of expression by knowing the components of ASL. Students use expressive and receptive skills for comprehension."}
        },
        {
            "competencyText": {"en-us": "ASL Level II proficiency levels, as defined by ACTFL and ASLTA, are as follows: interpersonal receptive, novice mid; interpersonal expressive, intermediate low; interpretive receptive, intermediate low; and presentational expressive, intermediate mid."}
        },
        {
            "competencyText": {"en-us": "Students who have fully or partially acquired the skills required at each proficiency level through home or other immersion experiences are known as heritage speakers. Heritage speakers may be allowed to accelerate based on their ability to demonstrate a proficiency in the Texas essential knowledge and skills at the prescribed proficiency level and communicate across all modes of communication. According to ASLTA's National K-16 ASL Standards, \"heritage language learning is an emerging issue in ASL instruction. The formal instruction of ASL to deaf is a very recent phenomenon, as is the availability of ASL instruction in K-12 settings for hearing children of deaf parents. Heritage language learning is an important and developing interest in the field of ASL teaching and learning.\""}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Communication. The student communicates in ASL using expressive and receptive communication skills without voice. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in a variety of ASL exchanges of learned material to socialize and to provide and obtain information;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of ASL such as stories, everyday commands, and instructions when dealing with familiar topics;"}
        },
        {
            "competencyText": {"en-us": "convey information in ASL using concepts, classifiers, phrases, and sentences to others without voice;"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate usage of ASL phonology, morphology, syntax, semantics, and pragmatics; and"}
        },
        {
            "competencyText": {"en-us": "create and express ASL literature, including handshape stories, that follows traditional cultural features."}
        },
        {
            "competencyText": {"en-us": "Cultures. The student gains knowledge and understanding of American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "recognize and use Deaf cultural norms to demonstrate, in writing or ASL, an understanding of the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "show evidence of appreciation of ASL literature created by the Deaf and how it applies to the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "show evidence of appreciation of the contributions to arts and sciences by the Deaf and how they are applied to the perspectives of American Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of Deaf history and how it applies to the perspectives of American Deaf culture."}
        },
        {
            "competencyText": {"en-us": "Connections. The student uses ASL to make connections with other subject areas and to acquire information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use resources and digital technology to gain access to information about ASL and Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "use ASL to obtain, reinforce, or expand knowledge of other subject areas."}
        },
        {
            "competencyText": {"en-us": "Comparisons. The student develops or expands insight into the nature of language and culture by comparing the student's own language and culture to ASL and American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the nature of language through comparisons of the student's own language and ASL;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the nature of culture through comparisons of the student's own culture and the American Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of how one language and culture can influence another."}
        },
        {
            "competencyText": {"en-us": "Communities. The student participates in the Deaf/ASL community by using ASL. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the novice-to-intermediate proficiency level in or out of the school setting through involvement in cultural activities such as attending Deaf events;"}
        },
        {
            "competencyText": {"en-us": "use technology to communicate with the Deaf/ASL community; and"}
        },
        {
            "competencyText": {"en-us": "show evidence of becoming a lifelong learner by using ASL at the novice-to-intermediate proficiency level for personal enrichment and career development."}
        },
        {
            "competencyText": {"en-us": "American Sign Language, Level III (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.36 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Level III can be offered in middle or high school. At the high school level, students shall be awarded one credit for successful completion of this course. American Sign Language (ASL) Levels I and II are prerequisites for this course."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage receptively and expressively in conversations, to present information expressively to an audience, and to comprehend cultural and linguistic aspects of the language. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct signed communication with others without voice. Examples of this \"two-way\" communication include but are not limited to signing face to face or in a group discussion. Interpersonal communication includes receptive and expressive skills."}
        },
        {
            "competencyText": {"en-us": "In interpretive (receptive) mode of communication, students demonstrate understanding of receptively viewed communication within appropriate cultural contexts. Examples of this type of \"one-way\" receptive comprehension include but are not limited to ASL video weblogs (or vlogs), other signed presentations, and signed DVD conversations."}
        },
        {
            "competencyText": {"en-us": "In presentational (expressive) mode of communication, students present information in expressive form without voice to an audience of receptive listeners with whom there is no immediate expressive interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to an expressively signed presentation to a group or recorded in some way where there is no receptive listener present to respond."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "ASL difficulty has been determined by standards of the Foreign Service Institute and Defense Language Institute as a Level IV out of four (Level IV being the most difficult). The American Sign Language Teachers Association (ASLTA) states the challenge to ASL is primarily in the modality of learning. This conclusion is based on the complex grammar system and significant structural and cultural differences in the language. Students are generally seated in a semi-circle to facilitate visual communication, notes cannot be taken without looking away from the primary source of information, and instruction occurs in the target language where learning is done spatially and words are not processed sequentially. The linear nature of spoken language cannot be used in ASL and the simultaneous expression of complex units is used. The level of difficulty of ASL should be noted."}
        },
        {
            "competencyText": {"en-us": "While other languages possess a spoken and/or written element, ASL incorporates manual components with no verbal and/or written form. ASL is a fully developed natural language that is used by members of the North American Deaf Community. The language is distinct from gestures seen in spoken languages in that signs used in ASL are controlled by the structures of its linguistic system, independent of English. ASL encompasses all of the features that make a language a unique, rule-governed communication system. ASL includes handshapes, movements, and other grammatical features needed to form signs and sentences, and parts combine to make wholes. It is not a simplified language and contains structures and processes that English does not. The premise of Deaf culture is rooted in the language itself and cannot be separated."}
        },
        {
            "competencyText": {"en-us": "ASL is a signed language where the modes of communication involve different skills than written and/or spoken languages. ASL is not a formal written language; glossing is the term used to describe a chosen written system of symbols devised to transcribe signs and nonmanual signals to an English equivalent. Since ASL information is received visually and not in an auditory manner, communication skills in ASL are defined as follows:"}
        },
        {
            "competencyText": {"en-us": "interpretive listening and reading targets are called interpretive receptive;"}
        },
        {
            "competencyText": {"en-us": "one-to-one interpersonal targets are called receptive and expressive; and"}
        },
        {
            "competencyText": {"en-us": "one-to-many presentational speaking is expressed through signs and the target is presentational expressive."}
        },
        {
            "competencyText": {"en-us": "Using age-appropriate activities, students in ASL Level III expand their ability to perform novice tasks and develop their ability to perform the tasks of the intermediate language learner. The intermediate language learner, when dealing with everyday topics, should understand ASL phrases receptively and respond expressively with learned material; sign learned words, concepts, phrases, and sentences; apply acquired knowledge of Deaf cultural norms to the development of communication skills; and apply knowledge of the components of ASL to increase accuracy of expression. Students use expressive and receptive skills for comprehension."}
        },
        {
            "competencyText": {"en-us": "ASL Level III proficiency levels, as defined by ACTFL and ASLTA, are as follows: interpersonal receptive, intermediate mid; interpersonal expressive, advanced low; interpretive receptive, intermediate low; and presentational expressive, advanced low."}
        },
        {
            "competencyText": {"en-us": "Students who have fully or partially acquired the skills required at each proficiency level through home or other immersion experiences are known as heritage speakers. Heritage speakers may be allowed to accelerate based on their ability to demonstrate a proficiency in the Texas essential knowledge and skills at the prescribed proficiency level and communicate across all modes of communication. According to ASLTA's National K-16 ASL Standards, \"heritage language learning is an emerging issue in ASL instruction. The formal instruction of ASL to deaf is a very recent phenomenon, as is the availability of ASL instruction in K-12 settings for hearing children of deaf parents. Heritage language learning is an important and developing interest in the field of ASL teaching and learning.\""}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Communication. The student communicates in ASL using expressive and receptive communication skills without voice. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in a variety of ASL exchanges of learned material to socialize and to provide and obtain information at an intermediate proficiency level;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of ASL such as stories, commands, and instructions when dealing with familiar and less familiar topics;"}
        },
        {
            "competencyText": {"en-us": "convey information in ASL using concepts, classifiers, phrases, and sentences to others without voice at the intermediate proficiency level;"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate usage of ASL phonology, morphology, syntax, semantics, and pragmatics at the intermediate proficiency level; and"}
        },
        {
            "competencyText": {"en-us": "create and express ASL literature, including handshape stories, that follows traditional cultural features."}
        },
        {
            "competencyText": {"en-us": "Cultures. The student gains knowledge and understanding of American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL to recognize and use Deaf cultural norms to demonstrate an understanding of the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "apply ASL to show evidence of appreciation of ASL literature created by the Deaf and how it applies to the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "apply ASL to show evidence of appreciation of the contributions to arts and sciences by the Deaf and how they are applied to the perspectives of American Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an in-depth understanding of Deaf history and how it applies to the perspectives of American Deaf culture."}
        },
        {
            "competencyText": {"en-us": "Connections. The student uses ASL to make connections with other subject areas and to acquire information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use resources and digital technology to gain access to in-depth information about ASL and Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate proficiency level to obtain, reinforce, or expand knowledge of other subject areas."}
        },
        {
            "competencyText": {"en-us": "Comparisons. The student expands insight into the nature of language and culture by comparing the student's own language and culture to ASL and American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate proficiency level to demonstrate an understanding of the nature of language through comparisons of the student's own language and ASL;"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate proficiency level to demonstrate an understanding of the nature of culture through comparisons of the student's own culture and the American Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate proficiency level to demonstrate an understanding of how one language and culture can influence another."}
        },
        {
            "competencyText": {"en-us": "Communities. The student participates in the Deaf/ASL community by using ASL. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate proficiency level in or out of the school setting through involvement in cultural activities such as attending Deaf events;"}
        },
        {
            "competencyText": {"en-us": "use technology to communicate with the Deaf/ASL community; and"}
        },
        {
            "competencyText": {"en-us": "show evidence of becoming a lifelong learner by using ASL at the intermediate proficiency level for personal enrichment and career development."}
        },
        {
            "competencyText": {"en-us": "American Sign Language, Level IV (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.37 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Level IV can be offered in middle or high school. At the high school level, students shall be awarded one credit for successful completion of this course. American Sign Language (ASL) Levels I, II, and III are prerequisites for this course."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage receptively and expressively in conversations, to present information expressively to an audience, and to comprehend cultural and linguistic aspects of the language. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct signed communication with others without voice. Examples of this \"two-way\" communication include but are not limited to signing face to face or in a group discussion. Interpersonal communication includes receptive and expressive skills."}
        },
        {
            "competencyText": {"en-us": "In interpretive (receptive) mode of communication, students demonstrate understanding of receptively viewed communication within appropriate cultural contexts. Examples of this type of \"one-way\" receptive comprehension include but are not limited to ASL video weblogs (or vlogs), other signed presentations, and signed DVD conversations."}
        },
        {
            "competencyText": {"en-us": "In presentational (expressive) mode of communication, students present information in expressive form without voice to an audience of receptive listeners with whom there is no immediate expressive interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to an expressively signed presentation to a group or recorded in some way where there is no receptive listener present to respond."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "ASL difficulty has been determined by standards of the Foreign Service Institute and Defense Language Institute as a Level IV out of four (Level IV being the most difficult). The American Sign Language Teachers Association (ASLTA) states the challenge to ASL is primarily in the modality of learning. This conclusion is based on the complex grammar system and significant structural and cultural differences in the language. Students are generally seated in a semi-circle to facilitate visual communication, notes cannot be taken without looking away from the primary source of information, and instruction occurs in the target language where learning is done spatially and words are not processed sequentially. The linear nature of spoken language cannot be used in ASL and the simultaneous expression of complex units is used. The level of difficulty of ASL should be noted."}
        },
        {
            "competencyText": {"en-us": "While other languages possess a spoken and/or written element, ASL incorporates manual components with no verbal and/or written form. ASL is a fully developed natural language that is used by members of the North American Deaf Community. The language is distinct from gestures seen in spoken languages in that signs used in ASL are controlled by the structures of its linguistic system, independent of English. ASL encompasses all of the features that make a language a unique, rule-governed communication system. ASL includes handshapes, movements, and other grammatical features needed to form signs and sentences, and parts combine to make wholes. It is not a simplified language and contains structures and processes that English does not. The premise of Deaf culture is rooted in the language itself and cannot be separated."}
        },
        {
            "competencyText": {"en-us": "ASL is a signed language where the modes of communication involve different skills than written and/or spoken languages. ASL is not a formal written language; glossing is the term used to describe a chosen written system of symbols devised to transcribe signs and nonmanual signals to an English equivalent. Since ASL information is received visually and not in an auditory manner, communication skills in ASL are defined as follows:"}
        },
        {
            "competencyText": {"en-us": "interpretive listening and reading targets are called interpretive receptive;"}
        },
        {
            "competencyText": {"en-us": "one-to-one interpersonal targets are called receptive and expressive; and"}
        },
        {
            "competencyText": {"en-us": "one-to-many presentational speaking is expressed through signs and the target is presentational expressive."}
        },
        {
            "competencyText": {"en-us": "Using age-appropriate activities, students in ASL Level IV expand their ability to perform novice tasks and develop their ability to perform the tasks of the intermediate-to-advanced language learner. The intermediate-to-advanced language learner, when dealing with everyday topics, should understand ASL phrases receptively and respond expressively with learned material at an intermediate-to-advanced proficiency level; sign learned words, concepts, phrases, and sentences at an intermediate-to-advanced proficiency level; apply acquired knowledge of Deaf cultural norms to the development of communication skills; and apply knowledge of the components of ASL to increase accuracy of expression. Students use expressive and receptive skills for comprehension."}
        },
        {
            "competencyText": {"en-us": "ASL Level IV proficiency levels, as defined by ACTFL and ASLTA, are as follows: interpersonal receptive, intermediate high; interpersonal expressive, advanced high; interpretive receptive, intermediate high; and presentational expressive, advanced high."}
        },
        {
            "competencyText": {"en-us": "Students who have fully or partially acquired the skills required at each proficiency level through home or other immersion experiences are known as heritage speakers. Heritage speakers may be allowed to accelerate based on their ability to demonstrate a proficiency in the Texas essential knowledge and skills at the prescribed proficiency level and communicate across all modes of communication. According to ASLTA's National K-16 ASL Standards, \"heritage language learning is an emerging issue in ASL instruction. The formal instruction of ASL to deaf is a very recent phenomenon, as is the availability of ASL instruction in K-12 settings for hearing children of deaf parents. Heritage language learning is an important and developing interest in the field of ASL teaching and learning.\""}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Communication. The student communicates in ASL using expressive and receptive communication skills without voice. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in a variety of ASL exchanges of learned material to socialize and to provide and obtain information at an intermediate-to-advanced proficiency level;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of ASL such as stories, commands, and instructions when dealing with familiar and unfamiliar topics;"}
        },
        {
            "competencyText": {"en-us": "convey information in ASL using concepts, classifiers, phrases, and sentences to others without voice at the intermediate-to-advanced proficiency level;"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate usage of ASL phonology, morphology, syntax, semantics, and pragmatics at the intermediate-to-advanced proficiency level; and"}
        },
        {
            "competencyText": {"en-us": "create and express ASL literature, including handshape stories, that follows traditional cultural features."}
        },
        {
            "competencyText": {"en-us": "Cultures. The student gains knowledge and understanding of American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL to recognize and use Deaf cultural norms to demonstrate an understanding of the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "apply ASL to show evidence of appreciation of ASL literature created by the Deaf and how it applies to the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "apply ASL to show evidence of appreciation of the contributions to arts and sciences by the Deaf and how they are applied to the perspectives of American Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an in-depth understanding of Deaf history and how it applies to the perspectives of American Deaf culture."}
        },
        {
            "competencyText": {"en-us": "Connections. The student uses ASL to make connections with other subject areas and to acquire information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use resources and digital technology to gain access to extensive information on ASL and Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate-to-advanced proficiency level to obtain, reinforce, or expand knowledge of other subject areas."}
        },
        {
            "competencyText": {"en-us": "Comparisons. The student expands insight into the nature of language and culture by comparing the student's own language and culture to ASL and American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate-to-advanced proficiency level to demonstrate an understanding of the nature of language through comparisons of the student's own language and ASL;"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate-to-advanced proficiency level to demonstrate an understanding of the nature of culture through comparisons of the student's own culture and the American Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate-to-advanced proficiency level to demonstrate an understanding of how one language and culture can influence another."}
        },
        {
            "competencyText": {"en-us": "Communities. The student participates in the Deaf/ASL community by using ASL. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the intermediate-to-advanced proficiency level in or out of the school setting through involvement in cultural activities such as attending Deaf events;"}
        },
        {
            "competencyText": {"en-us": "use technology to communicate with the Deaf/ASL community; and"}
        },
        {
            "competencyText": {"en-us": "show evidence of becoming a lifelong learner by using ASL at the intermediate-to-advanced proficiency level for personal enrichment and career development."}
        },
        {
            "competencyText": {"en-us": "American Sign Language, Advanced Independent Study (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.38 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. American Sign Language Advanced Independent Study (ASL AIS) can be offered in high school. Students shall be awarded one credit for successful completion of this course. This course can be taken up to three times for state credit. ASL Levels I, II, III, and IV are prerequisites for this course."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage receptively and expressively in conversations, to present information expressively to an audience, and to comprehend cultural and linguistic aspects of the language. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct signed communication with others without voice. Examples of this \"two-way\" communication include but are not limited to signing face to face or in a group discussion. Interpersonal communication includes receptive and expressive skills."}
        },
        {
            "competencyText": {"en-us": "In interpretive (receptive) mode of communication, students demonstrate understanding of receptively viewed communication within appropriate cultural contexts. Examples of this type of \"one-way\" receptive comprehension include but are not limited to ASL video weblogs (or vlogs), other signed presentations, and signed DVD conversations."}
        },
        {
            "competencyText": {"en-us": "In presentational (expressive) mode of communication, students present information in expressive form without voice to an audience of receptive listeners with whom there is no immediate expressive interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to an expressively signed presentation to a group or recorded in some way where there is no receptive listener present to respond."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "ASL difficulty has been determined by standards of the Foreign Service Institute and Defense Language Institute as a Level IV out of four (Level IV being the most difficult). The American Sign Language Teachers Association (ASLTA) states the challenge to ASL is primarily in the modality of learning. This conclusion is based on the complex grammar system and significant structural and cultural differences in the language. Students are generally seated in a semi-circle to facilitate visual communication, notes cannot be taken without looking away from the primary source of information, and instruction occurs in the target language where learning is done spatially and words are not processed sequentially. The linear nature of spoken language cannot be used in ASL and the simultaneous expression of complex units is used. The level of difficulty of ASL should be noted."}
        },
        {
            "competencyText": {"en-us": "While other languages possess a spoken and/or written element, ASL incorporates manual components with no verbal and/or written form. ASL is a fully developed natural language that is used by members of the North American Deaf Community. The language is distinct from gestures seen in spoken languages in that signs used in ASL are controlled by the structures of its linguistic system, independent of English. ASL encompasses all of the features that make a language a unique, rule-governed communication system. ASL includes handshapes, movements, and other grammatical features needed to form signs and sentences, and parts combine to make wholes. It is not a simplified language and contains structures and processes that English does not. The premise of Deaf culture is rooted in the language itself and cannot be separated."}
        },
        {
            "competencyText": {"en-us": "ASL is a signed language where the modes of communication involve different skills than written and/or spoken languages. ASL is not a formal written language; glossing is the term used to describe a chosen written system of symbols devised to transcribe signs and nonmanual signals to an English equivalent. Since ASL information is received visually and not in an auditory manner, communication skills in ASL are defined as follows:"}
        },
        {
            "competencyText": {"en-us": "interpretive listening and reading targets are called interpretive receptive;"}
        },
        {
            "competencyText": {"en-us": "one-to-one interpersonal targets are called receptive and expressive; and"}
        },
        {
            "competencyText": {"en-us": "one-to-many presentational speaking is expressed through signs and the target is presentational expressive."}
        },
        {
            "competencyText": {"en-us": "Using age-appropriate activities, students in ASL Advanced Independent Study expand their ability to perform intermediate-to-advanced tasks and develop their ability to perform the tasks of the advanced language learner. The advanced language learner, when dealing with everyday topics, should understand ASL phrases receptively and respond expressively with learned material at an intermediate-to-advanced proficiency level; sign learned words, concepts, phrases, and sentences at an advanced proficiency level; apply acquired knowledge of Deaf cultural norms to the development of extensive communication skills; and apply knowledge of the components of ASL to increase accuracy of expression. Students use expressive and receptive skills for comprehension."}
        },
        {
            "competencyText": {"en-us": "ASL Advanced Independent Study proficiency levels, as defined by ACTFL and ASLTA, are as follows: interpersonal receptive, advanced; interpersonal expressive, advanced; interpretive receptive, novice intermediate; and presentational expressive, advanced."}
        },
        {
            "competencyText": {"en-us": "Students who have fully or partially acquired the skills required at each proficiency level through home or other immersion experiences are known as heritage speakers. Heritage speakers may be allowed to accelerate based on their ability to demonstrate a proficiency in the Texas essential knowledge and skills at the prescribed proficiency level and communicate across all modes of communication. According to ASLTA's National K-16 ASL Standards, \"heritage language learning is an emerging issue in ASL instruction. The formal instruction of ASL to deaf is a very recent phenomenon, as is the availability of ASL instruction in K-12 settings for hearing children of deaf parents. Heritage language learning is an important and developing interest in the field of ASL teaching and learning.\""}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Communication. The student communicates in ASL using expressive and receptive communication skills without voice. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in a variety of ASL exchanges of learned material to socialize and to provide and obtain information at an advanced proficiency level;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an in-depth understanding of ASL such as stories, commands, and instructions when dealing with familiar and unfamiliar topics;"}
        },
        {
            "competencyText": {"en-us": "convey information in ASL using concepts, classifiers, phrases, and sentences to others without voice at the advanced proficiency level;"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate usage of ASL phonology, morphology, syntax, semantics, and pragmatics at the advanced proficiency level; and"}
        },
        {
            "competencyText": {"en-us": "create and express ASL literature, including handshape stories, that follows traditional cultural features."}
        },
        {
            "competencyText": {"en-us": "Cultures. The student gains knowledge and understanding of American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL to recognize and use Deaf cultural norms to demonstrate an in-depth understanding of the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "apply ASL to show evidence of an in-depth appreciation of ASL literature created by the Deaf and how it applies to the perspectives of American Deaf culture;"}
        },
        {
            "competencyText": {"en-us": "apply ASL to show evidence of an in-depth appreciation of the contributions to arts and sciences by the Deaf and how they are applied to the perspectives of American Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an in-depth understanding of Deaf history and how it applies to the perspectives of American Deaf culture."}
        },
        {
            "competencyText": {"en-us": "Connections. The student uses ASL to make connections with other subject areas and to acquire information. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use resources and digital technology to gain access to extensive information about ASL and Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the advanced proficiency level to obtain, reinforce, or expand knowledge of other subject areas."}
        },
        {
            "competencyText": {"en-us": "Comparisons. The student expands insight into the nature of language and culture by comparing the student's own language and culture to ASL and American Deaf culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the advanced proficiency level to demonstrate an understanding of the nature of language through comparisons of the student's own language and ASL;"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the advanced proficiency level to demonstrate an understanding of the nature of culture through comparisons of the student's own culture and the American Deaf culture; and"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the advanced proficiency level to demonstrate an understanding of how one language and culture can influence another."}
        },
        {
            "competencyText": {"en-us": "Communities. The student participates in the Deaf/ASL community by using ASL. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply ASL at the advanced proficiency level in or out of the school setting through involvement in cultural activities such as attending Deaf events;"}
        },
        {
            "competencyText": {"en-us": "use technology to communicate with the Deaf/ASL community; and"}
        },
        {
            "competencyText": {"en-us": "show evidence of becoming a lifelong learner by using ASL at the advanced proficiency level for personal enrichment and career development."}
        },
        {
            "competencyText": {"en-us": "Level I, Novice Mid to Novice High Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.39 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level I can be offered in elementary, middle, or high school. At the high school level, students shall be awarded one credit for successful completion of this course. There is no prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of logographic languages such as Chinese and Japanese and non-Romance and non-Germanic languages such as Arabic and Russian will require more time to achieve proficiency, especially in reading and writing. Initially, the skill focus should be placed on speaking and listening without ignoring reading and writing in the target language's writing system. As the students become more proficient, a balanced emphasis of all four skills becomes more attainable."}
        },
        {
            "competencyText": {"en-us": "Districts may offer a level of a language in a variety of scheduling arrangements that may extend or reduce the traditional schedule when careful consideration is given to the instructional time available on a campus and the language ability, access to programs, and motivation of students."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Students recognize the importance of acquiring accuracy of expression by knowing the components of language, including grammar, syntax, register, appropriate discourse level, and text type."}
        },
        {
            "competencyText": {"en-us": "Students in Level I are expected to reach a proficiency level of Novice Mid to Novice High, as defined in the ACTFL Proficiency Guidelines 2012 and the ACTFL Performance Descriptors for Language Learners."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice Mid proficiency level express meaning in highly predictable contexts through the use of memorized and recalled words and phrases. They are best able to understand aural cognates, borrowed words, and high-frequency, highly contextualized words and phrases with repetition. Novice Mid students may be difficult to understand by the most sympathetic listeners and readers accustomed to dealing with language learners. Novice Mid students are inconsistently successful when performing Novice-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice High proficiency level express meaning in simple, predictable contexts through the use of learned and recombined phrases and short sentences. They are best able to understand sentence-length information within highly contextualized situations and sources. Novice High students may generally be understood by sympathetic listeners and readers accustomed to dealing with language learners. Novice High students are consistently successful when performing Novice-level tasks. Novice High students show evidence of Intermediate Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "By the end of Level I, students of logographic languages should perform on a Novice Mid proficiency level for reading and writing. In listening and speaking, students of logographic languages should perform on a Novice Mid to Novice High proficiency level."}
        },
        {
            "competencyText": {"en-us": "Students who have fully or partially acquired the skills required at each proficiency level through home or other immersion experiences are known as heritage speakers. Heritage speakers may be allowed to accelerate based on their ability to demonstrate a proficiency in the Texas essential knowledge and skills for LOTE across all modes of communication at the prescribed proficiency level."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student negotiates meaning through the spoken and written exchange of information in rehearsed and unrehearsed situations in a variety of contexts. The student uses a mixture of words and phrases and some simple sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask and respond to questions about everyday life in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "express and exchange personal opinions or preferences in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "ask and tell others what they need to, should, or must do in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "articulate requests, offer alternatives, or develop simple plans in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "participate in spoken conversation using culturally appropriate expressions, register, and gestures; and"}
        },
        {
            "competencyText": {"en-us": "participate in written conversation using culturally appropriate expressions, register, and style."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student comprehends sentence-length information from culturally authentic print, digital, audio, and audiovisual materials as appropriate within highly contextualized situations and sources. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of culturally authentic print, digital, audio, and audiovisual materials in everyday contexts;"}
        },
        {
            "competencyText": {"en-us": "identify key words and details from fiction and nonfiction texts and audio and audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "infer meaning of unfamiliar words or phrases in highly contextualized texts, audio, and audiovisual materials; and"}
        },
        {
            "competencyText": {"en-us": "identify cultural practices from authentic print, digital, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student presents information orally and in writing using a mixture of words and phrases and some simple sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "state and support an opinion or preference orally and in writing; and"}
        },
        {
            "competencyText": {"en-us": "describe people, objects, and simple situations orally and in writing using a mixture of words, phrases, and simple sentences."}
        },
        {
            "competencyText": {"en-us": "Level II, Novice High to Intermediate Low Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.40 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level II can be offered in elementary, middle, or high school. At the high school level, students shall be awarded one credit for successful completion of this course. Successful completion of Level I, achieving a Novice Mid to Novice High proficiency level, or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of logographic languages such as Chinese and Japanese and non-Romance and non-Germanic languages such as Arabic and Russian will require more time to achieve proficiency, especially in reading and writing. Initially, the skill focus should be placed on speaking and listening without ignoring reading and writing in the target language's writing system. As the students become more proficient, a balanced emphasis of all four skills becomes more attainable."}
        },
        {
            "competencyText": {"en-us": "Districts may offer a level of a language in a variety of scheduling arrangements that may extend or reduce the traditional schedule when careful consideration is given to the instructional time available on a campus and the language ability, access to programs, and motivation of students."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Students recognize the importance of acquiring accuracy of expression by knowing the components of language, including grammar, syntax, register, appropriate discourse level, and text type."}
        },
        {
            "competencyText": {"en-us": "Students in Level II are expected to reach a proficiency level of Novice High to Intermediate Low, as defined in the ACTFL Proficiency Guidelines 2012 and the ACTFL Performance Descriptors for Language Learners."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice High proficiency level express meaning in simple, predictable contexts through the use of learned and recombined phrases and short sentences. Novice High students are best able to understand sentence-length information within highly contextualized situations and sources. Novice High students may generally be understood by sympathetic listeners and readers accustomed to dealing with language learners. Novice High students are consistently successful when performing Novice-level tasks. Novice High students show evidence of Intermediate Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate Low proficiency level express meaning in straightforward and personal contexts by combining and recombining what they know, what they read, and what they hear in short statements and sentences. Intermediate Low students are able to understand some information from simple connected statements in oral or written sources. Intermediate Low students are generally understood by sympathetic listeners and readers accustomed to dealing with language learners. Intermediate Low students are inconsistently successful when performing Intermediate-level tasks."}
        },
        {
            "competencyText": {"en-us": "By the end of Level II, students of logographic languages should perform on a Novice Mid to Novice High proficiency level for reading and writing. In listening and speaking, students of logographic languages should perform on a Novice High to Intermediate Low proficiency level. Students at the Novice Mid proficiency level express meaning in highly predictable contexts through the use of memorized and recalled words and phrases. Novice Mid students are best able to understand aural cognates, borrowed words, and high-frequency, highly contextualized words and phrases with repetition. Novice Mid students may be difficult to understand by the most sympathetic listeners and readers accustomed to dealing with language learners. Novice Mid students are inconsistently successful when performing Novice-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students who have fully or partially acquired the skills required at each proficiency level through home or other immersion experiences are known as heritage speakers. Heritage speakers may be allowed to accelerate based on their ability to demonstrate a proficiency in the Texas essential knowledge and skills for LOTE across all modes of communication at the prescribed proficiency level."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student negotiates meaning through the spoken and written exchange of information in rehearsed and unrehearsed situations in a variety of contexts. The student uses a mixture of short statements and sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask and respond to questions about everyday life with simple elaboration in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "express and exchange personal opinions or preferences with simple supporting statements in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "ask and tell others what they need to, should, or must do with simple supporting reasons in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "articulate requests, offer alternatives, and develop plans with simple supporting statements in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "interact and react in spoken conversation using culturally appropriate expressions, register, and gestures; and"}
        },
        {
            "competencyText": {"en-us": "interact and react in writing using culturally appropriate expressions, register, and style."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student comprehends simple connected statements from culturally authentic print, digital, audio, and audiovisual materials as appropriate within contextualized situations and sources. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of culturally authentic print, digital, audio, and audiovisual materials in everyday contexts;"}
        },
        {
            "competencyText": {"en-us": "identify the main idea, theme, and supporting details from fiction and nonfiction texts and audio and audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "infer meaning of unfamiliar words or phrases in highly contextualized texts, audio, and audiovisual materials; and"}
        },
        {
            "competencyText": {"en-us": "identify cultural practices from authentic print, digital, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student presents information orally and in writing using a mixture of phrases and sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "express and support an opinion or preference orally and in writing with supporting statements; and"}
        },
        {
            "competencyText": {"en-us": "describe people, objects, and situations orally and in writing using a series of sequenced sentences with essential details and simple elaboration."}
        },
        {
            "competencyText": {"en-us": "Level III, Intermediate Low to Intermediate Mid Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.41 adopted to be effective July 15, 2014, 39 TexReg 5385"]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level III can be offered in middle or high school. At the high school level, students shall be awarded one credit for successful completion of this course. Successful completion of Level II, achieving a Novice High to Intermediate Low proficiency level, or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of logographic languages such as Chinese and Japanese and non-Romance and non-Germanic languages such as Arabic and Russian will require more time to achieve proficiency, especially in reading and writing. Initially, the skill focus should be placed on speaking and listening without ignoring reading and writing in the target language's writing system. As the students become more proficient, a balanced emphasis of all four skills becomes more attainable."}
        },
        {
            "competencyText": {"en-us": "Districts may offer a level of a language in a variety of scheduling arrangements that may extend or reduce the traditional schedule when careful consideration is given to the instructional time available on a campus and the language ability, access to programs, and motivation of students."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Students recognize the importance of acquiring accuracy of expression by knowing the components of language, including grammar, syntax, register, appropriate discourse level, and text type."}
        },
        {
            "competencyText": {"en-us": "Students in Level III are expected to reach a proficiency level of Intermediate Low to Intermediate Mid, as defined in the ACTFL Proficiency Guidelines 2012 and the ACTFL Performance Descriptors for Language Learners."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate Low proficiency level express meaning in straightforward and personal contexts by combining and recombining what they know, what they read, and what they hear in short statements and sentences. Intermediate Low students are able to understand some information from simple connected statements in oral or written sources. Intermediate Low students are generally understood by sympathetic listeners and readers accustomed to dealing with language learners. Intermediate Low students are inconsistently successful when performing Intermediate-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate Mid proficiency level express meaning in straightforward and personal contexts by easily combining and recombining what they know, what they read, and what they hear in short statements and a mixture of sentences and strings of sentences. Intermediate Mid students are able to understand some information from connected statements in oral or written sources. Intermediate Mid students are generally understood by sympathetic listeners and readers accustomed to dealing with language learners. Intermediate Mid students are consistently successful when performing Intermediate-level tasks."}
        },
        {
            "competencyText": {"en-us": "By the end of Level III, students of logographic languages should perform on a Novice High to Intermediate Low proficiency level for reading and writing. In listening and speaking, students of logographic languages should perform on an Intermediate Low to Intermediate Mid proficiency level. Students at the Novice High proficiency level express meaning in simple, predictable contexts through the use of learned and recombined phrases and short sentences. Novice High students are best able to understand sentence-length information within highly contextualized situations and sources. Novice High students may generally be understood by sympathetic listeners and readers accustomed to dealing with language learners. Novice High students are consistently successful when performing Novice-level tasks. Novice High students show evidence of Intermediate Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "Students who have fully or partially acquired the skills required at each proficiency level through home or other immersion experiences are known as heritage speakers. Heritage speakers may be allowed to accelerate based on their ability to demonstrate a proficiency in the Texas essential knowledge and skills for LOTE across all modes of communication at the prescribed proficiency level."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student negotiates meaning through the spoken and written exchange of information in rehearsed and unrehearsed situations in a variety of contexts. The student uses a mixture of short statements, sentences, and strings of sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask and respond to questions about and beyond the scope of everyday life with simple elaboration in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "express and exchange personal opinions, preferences, and recommendations with supporting statements in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "ask and tell others what they need to, should, and must do with supporting reasons in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "articulate requests, offer suggestions, and develop plans with supporting statements in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "interact and react in spoken conversation using culturally appropriate expressions, register, and gestures; and"}
        },
        {
            "competencyText": {"en-us": "interact and react in writing using culturally appropriate expressions, register, and style."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student comprehends connected statements from culturally authentic print, digital, audio, and audiovisual materials as appropriate within contextualized situations and sources. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of culturally authentic print, digital, audio, and audiovisual materials in a variety of contexts;"}
        },
        {
            "competencyText": {"en-us": "paraphrase the main idea, theme, and supporting details from fiction and nonfiction texts and audio and audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "infer meaning of unfamiliar words or phrases in contextualized texts, audio, and audiovisual materials; and"}
        },
        {
            "competencyText": {"en-us": "compare and contrast cultural practices from authentic print, digital, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student presents information orally and in writing using a mixture of phrases, sentences, and strings of sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "express and defend an opinion or preference orally and in writing with supporting statements and with recommendations;"}
        },
        {
            "competencyText": {"en-us": "narrate situations and events orally and in writing using connected sentences with details and elaboration; and"}
        },
        {
            "competencyText": {"en-us": "inform others orally and in writing about a variety of topics using connected sentences with details and elaboration."}
        },
        {
            "competencyText": {"en-us": "Level IV, Intermediate Mid to Intermediate High Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.42 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level IV can be offered in middle or high school. At the high school level, students shall be awarded one credit for successful completion of this course. Successful completion of Level III, achieving an Intermediate Low to Intermediate Mid proficiency level, or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of logographic languages such as Chinese and Japanese and non-Romance and non-Germanic languages such as Arabic and Russian will require more time to achieve proficiency, especially in reading and writing. Initially, the skill focus should be placed on speaking and listening without ignoring reading and writing in the target language's writing system. As the students become more proficient, a balanced emphasis of all four skills becomes more attainable."}
        },
        {
            "competencyText": {"en-us": "Districts may offer a level of a language in a variety of scheduling arrangements that may extend or reduce the traditional schedule when careful consideration is given to the instructional time available on a campus and the language ability, access to programs, and motivation of students."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Students recognize the importance of acquiring accuracy of expression by knowing the components of language, including grammar, syntax, register, appropriate discourse level, and text type."}
        },
        {
            "competencyText": {"en-us": "Students in Level IV are expected to reach a proficiency level of Intermediate Mid to Intermediate High, as defined in the ACTFL Proficiency Guidelines 2012 and the ACTFL Performance Descriptors for Language Learners."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate Mid proficiency level express meaning in straightforward and personal contexts by easily combining and recombining what they know, what they read, and what they hear in short statements and a mixture of sentences and strings of sentences. Intermediate Mid students are able to understand some information from connected statements in oral or written sources. Intermediate Mid students are generally understood by sympathetic listeners and readers accustomed to dealing with language learners. Intermediate Mid students are consistently successful when performing Intermediate-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate High proficiency level express meaning in a variety of contexts by creating with the language, easily combining and recombining what they know, what they read, and what they hear in a mixture of sentences and connected discourse. Intermediate High students are able to understand information from connected statements in oral or written sources. Intermediate High students are generally understood by listeners and readers unaccustomed to dealing with language learners. Intermediate High students are consistently successful when performing Intermediate-level tasks. Intermediate High students show evidence of Advanced Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "By the end of Level IV, students of logographic languages should perform on an Intermediate Low to Intermediate Mid proficiency level for reading and writing. In listening and speaking, students of logographic languages should perform on an Intermediate Mid to Intermediate High proficiency level. Students at the Intermediate Low proficiency level express meaning in straightforward and personal contexts by combining and recombining what they know, what they read, and what they hear in short statements and sentences. Intermediate Low students are able to understand some information from simple connected statements in oral or written sources. Intermediate Low students are generally understood by sympathetic listeners and readers accustomed to dealing with language learners. Intermediate Low students are inconsistently successful when performing Intermediate-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students who have fully or partially acquired the skills required at each proficiency level through home or other immersion experiences are known as heritage speakers. Heritage speakers may be allowed to accelerate based on their ability to demonstrate a proficiency in the Texas essential knowledge and skills for LOTE across all modes of communication at the prescribed proficiency level."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student negotiates meaning through the spoken and written exchange of information in rehearsed and unrehearsed situations in a variety of contexts. The student uses a mixture of sentences and connected discourse with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask and respond to questions about and beyond the scope of everyday life with elaboration in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "ask and respond to questions in unfamiliar contexts in spoken and written conversation with limited details;"}
        },
        {
            "competencyText": {"en-us": "express and exchange personal opinions, preferences, and recommendations with supporting elaborative statements in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "ask and tell others what they need to, should, and must do using detailed rationale in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "articulate requests, offer suggestions, and develop plans with supporting elaborative statements in spoken and written conversation;"}
        },
        {
            "competencyText": {"en-us": "interact and react in spoken conversation using culturally appropriate expressions, register, and gestures; and"}
        },
        {
            "competencyText": {"en-us": "interact and react in writing using culturally appropriate expressions, register, and style."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student comprehends connected statements from culturally authentic print, digital, audio, and audiovisual materials as appropriate within contextualized situations and sources. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze culturally authentic print, digital, audio, and audiovisual materials in a variety of contexts;"}
        },
        {
            "competencyText": {"en-us": "paraphrase and analyze the main idea, theme, and supporting details from fiction and nonfiction texts and audio and audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "infer meaning of unfamiliar words or phrases in texts, audio, and audiovisual materials; and"}
        },
        {
            "competencyText": {"en-us": "compare and contrast cultural practices and perspectives from authentic print, digital, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student presents information orally and in writing using a mixture of sentences and connected discourse with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "express and defend an opinion or persuade others orally and in writing with supporting elaborative statements and with recommendations;"}
        },
        {
            "competencyText": {"en-us": "narrate situations and events orally and in writing using connected sentences and some connected discourse with details and elaboration; and"}
        },
        {
            "competencyText": {"en-us": "inform others orally and in writing about a variety of topics using connected sentences and some connected discourse with details and elaboration."}
        },
        {
            "competencyText": {"en-us": "Level V, Intermediate High to Advanced Mid Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.43 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level V can be offered in high school. Students shall be awarded one credit for successful completion of this course. Successful completion of Level IV, achieving an Intermediate Mid to Intermediate High proficiency level in the four skills of listening, reading, writing, and speaking, or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of logographic languages such as Chinese and Japanese and non-Romance and non-Germanic languages such as Arabic and Russian will require more time to achieve proficiency, especially in reading and writing. Initially, the skill focus should be placed on speaking and listening without ignoring reading and writing in the target language's writing system. As the students become more proficient, a balanced emphasis of all four skills becomes more attainable."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for LOTE. The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "The three modes of communication (interpersonal, interpretive, and presentational) provide the organizing principle for describing language performance across all ranges of performance: Novice, Intermediate, Advanced, Superior, and Distinguished."}
        },
        {
            "competencyText": {"en-us": "The interpersonal mode is characterized by the active negotiation of meaning among individuals. Participants observe and monitor one another to see how their meanings and intentions are being communicated. Adjustments and clarifications can be made accordingly."}
        },
        {
            "competencyText": {"en-us": "The interpretive mode focuses on the appropriate cultural interpretation of meanings that occur in written and spoken form where there is no recourse to the active negotiation of meaning with the writer or the speaker."}
        },
        {
            "competencyText": {"en-us": "The presentational mode refers to the creation of oral and written messages in a manner that facilitates interpretation by members of the other culture where no direct opportunity for the active negotiation of meaning between members of the two cultures exists."}
        },
        {
            "competencyText": {"en-us": "All student expectations and modes of communication are aligned with and address the ACTFL National Standards for Foreign Language Education: Communication, Cultures, Connections, Comparisons, and Communities."}
        },
        {
            "competencyText": {"en-us": "Students will perform on the Intermediate High to Advanced Mid proficiency level as described by the ACTFL Proficiency Guidelines 2012."}
        },
        {
            "competencyText": {"en-us": "The Intermediate High to Advanced Mid student communicates in a language other than English using all three modes and all four skills."}
        },
        {
            "competencyText": {"en-us": "By the end of Level V, students of logographic languages should perform on an Intermediate Mid to Intermediate High proficiency level for reading and writing. In listening and speaking, students of logographic languages should perform on an Intermediate High to Advanced Low proficiency level."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student communicates in the interpersonal mode using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The interpersonal mode is the ability to understand and exchange information in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in conversations with generally consistent use of register in all time frames;"}
        },
        {
            "competencyText": {"en-us": "verbally exchange information with generally consistent use of register on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities;"}
        },
        {
            "competencyText": {"en-us": "write with generally consistent use of register and in all time frames items such as correspondence, narratives, descriptions, and summaries of a factual nature; and"}
        },
        {
            "competencyText": {"en-us": "produce, with generally consistent use of register, written exchanges that provide information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The interpretive mode focuses on comprehending main ideas and identifying some supporting details in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "read and analyze information from a variety of authentic print and electronic resources such as artwork, graphs, media, narratives, and descriptions in various literary genres, including texts about past, present, and future events that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities;"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and analyze cultural practices and perspectives from authentic print and electronic resources;"}
        },
        {
            "competencyText": {"en-us": "listen to and analyze information from a variety of authentic audio and audiovisual resources from the target culture that communicate information in the past, present, and future on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities; and"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and analyze cultural practices and perspectives from authentic audio and audiovisual resources."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student communicates using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The presentational mode refers to the creation of oral and written messages in the target language. The student's presentation is comprehensible to an audience unaccustomed to interacting with language learners. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "plan, produce, and present, with some ease and clarity of expression, spoken presentational communications that are supported with cited examples in multiple paragraph length discourse to explain, express opinions, describe, and narrate on topics that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities; and"}
        },
        {
            "competencyText": {"en-us": "plan and produce, with some ease and clarity of expression, written presentational communications that are supported with cited examples in multiple paragraph length discourse to explain, express opinions, describe, and narrate on topics that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities."}
        },
        {
            "competencyText": {"en-us": "Level VI, Advanced Mid to Advanced High Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.44 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level VI can be offered in high school. Students shall be awarded one credit for successful completion of this course. Successful completion of Level V, achieving an Intermediate High to Advanced Mid proficiency level in the four skills of listening, reading, writing, and speaking, or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of logographic languages such as Chinese and Japanese and non-Romance and non-Germanic languages such as Arabic and Russian will require more time to achieve proficiency, especially in reading and writing. Initially, the skill focus should be placed on speaking and listening without ignoring reading and writing in the target language's writing system. As the students become more proficient, a balanced emphasis of all four skills becomes more attainable."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for LOTE. The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "The three modes of communication (interpersonal, interpretive, and presentational) provide the organizing principles for describing language performance across all ranges of performance: Novice, Intermediate, Advanced, Superior, and Distinguished."}
        },
        {
            "competencyText": {"en-us": "The interpersonal mode is characterized by the active negotiation of meaning among individuals. Participants observe and monitor one another to see how their meanings and intentions are being communicated. Adjustments and clarifications can be made accordingly."}
        },
        {
            "competencyText": {"en-us": "The interpretive mode focuses on the appropriate cultural interpretation of meanings that occur in written and spoken form where there is no recourse to the active negotiation of meaning with the writer or the speaker."}
        },
        {
            "competencyText": {"en-us": "The presentational mode refers to the creation of oral and written messages in a manner that facilitates interpretation by members of the other culture where no direct opportunity for the active negotiation of meaning between members of the two cultures exists."}
        },
        {
            "competencyText": {"en-us": "All student expectations and modes of communication are aligned with and address the ACTFL National Standards for Foreign Language Education: Communication, Cultures, Connections, Comparisons, and Communities."}
        },
        {
            "competencyText": {"en-us": "Students will perform on an Advanced Mid to Advanced High proficiency level as described by the ACTFL Proficiency Guidelines 2012."}
        },
        {
            "competencyText": {"en-us": "The Advanced Mid to Advanced High student communicates in a language other than English using all three modes and all four skills."}
        },
        {
            "competencyText": {"en-us": "By the end of Level VI, students of logographic languages should perform on an Intermediate High to Advanced Low proficiency level for reading and writing. In listening and speaking, students of logographic languages should perform on an Advanced Low to Advanced Mid proficiency level."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal Communication: speaking and writing. The student communicates in the interpersonal mode using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The interpersonal mode is the ability to understand and exchange information in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in conversations with mostly consistent use of register in all time frames;"}
        },
        {
            "competencyText": {"en-us": "verbally exchange information with mostly consistent use of register on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities;"}
        },
        {
            "competencyText": {"en-us": "write with mostly consistent use of register in all time frames and with some elaboration items such as correspondence, narratives, descriptions, and summaries of a factual nature; and"}
        },
        {
            "competencyText": {"en-us": "produce, with mostly consistent use of register, written exchanges that provide information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student uses the interpretive mode in communication using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The interpretive mode focuses on comprehending main ideas and identifying some supporting details in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "read and appraise information from a variety of authentic print and electronic resources such as artwork, graphs, media, narratives, and descriptions in various literary genres, including texts about past, present, and future events that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities;"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and appraise cultural practices and perspectives from authentic print and electronic resources;"}
        },
        {
            "competencyText": {"en-us": "listen to and appraise information from a variety of authentic audio and audiovisual resources from the target culture that communicate information in the past, present, and future on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities; and"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and appraise cultural practices and perspectives from authentic audio and audiovisual resources."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student communicates using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The presentational mode refers to the creation of oral and written messages in the target language. The student's presentation is comprehensible to an audience unaccustomed to interacting with language learners. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "plan, produce, and present, with mostly consistent ease and clarity of expression, spoken presentational communications that are supported with cited examples in multiple paragraph length discourse to explain, express opinions, describe, and narrate on topics that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities; and"}
        },
        {
            "competencyText": {"en-us": "plan and produce, with mostly consistent ease and clarity of expression, written presentational communications that are supported with cited examples in multiple paragraph length discourse to explain, express opinions, describe, and narrate on topics that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities."}
        },
        {
            "competencyText": {"en-us": "Level VII, Advanced High to Superior Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.45 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level VII can be offered in high school. Students shall be awarded one credit for successful completion of this course. Successful completion of Level VI, achieving an Advanced Mid to Advanced High proficiency level in the four skills of listening, reading, writing, and speaking, or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of logographic languages such as Chinese and Japanese and non-Romance and non-Germanic languages such as Arabic and Russian will require more time to achieve proficiency, especially in reading and writing. Initially, the skill focus should be placed on speaking and listening without ignoring reading and writing in the target language's writing system. As the students become more proficient, a balanced emphasis of all four skills becomes more attainable."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for LOTE. The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "The three modes of communication (interpersonal, interpretive, and presentational) provide the organizing principles for describing language performance across all ranges of performance: Novice, Intermediate, Advanced, Superior, and Distinguished."}
        },
        {
            "competencyText": {"en-us": "The interpersonal mode is characterized by the active negotiation of meaning among individuals. Participants observe and monitor one another to see how their meanings and intentions are being communicated. Adjustments and clarifications can be made accordingly."}
        },
        {
            "competencyText": {"en-us": "The interpretive mode focuses on the appropriate cultural interpretation of meanings that occur in written and spoken form where there is no recourse to the active negotiation of meaning with the writer or the speaker."}
        },
        {
            "competencyText": {"en-us": "The presentational mode refers to the creation of oral and written messages in a manner that facilitates interpretation by members of the other culture where no direct opportunity for the active negotiation of meaning between members of the two cultures exists."}
        },
        {
            "competencyText": {"en-us": "All student expectations and modes of communication are aligned with and address the ACTFL National Standards for Foreign Language Education: Communication, Cultures, Connections, Comparisons, and Communities."}
        },
        {
            "competencyText": {"en-us": "Students will perform on an Advanced High to Superior proficiency level as described by the ACTFL Proficiency Guidelines 2012."}
        },
        {
            "competencyText": {"en-us": "The Advanced High to Superior student communicates in a language other than English using all three modes and all four skills."}
        },
        {
            "competencyText": {"en-us": "By the end of Level VII, students of logographic languages should perform on an Advanced Low to Advanced Mid proficiency level for reading and writing. In listening and speaking, students of logographic languages should perform on an Advanced Mid to Advanced High proficiency level."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student communicates in the interpersonal mode using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The interpersonal mode is the ability to understand and exchange information in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in conversations with consistent use of register in all time frames;"}
        },
        {
            "competencyText": {"en-us": "verbally exchange information with consistent use of register on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities;"}
        },
        {
            "competencyText": {"en-us": "write with consistent use of register in all time frames and with elaboration items such as correspondence, narratives, descriptions, and summaries of a factual nature; and"}
        },
        {
            "competencyText": {"en-us": "produce, with consistent use of register, written exchanges that provide information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student uses the interpretive mode in communication using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The interpretive mode focuses on comprehending main ideas and identifying some supporting details in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "read and synthesize information from a variety of authentic print and electronic resources such as artwork, graphs, media, narratives, and descriptions in various literary genres, including texts about past, present, and future events that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities;"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and synthesize cultural practices and perspectives from authentic print and electronic resources;"}
        },
        {
            "competencyText": {"en-us": "listen to and synthesize information from a variety of authentic audio and audiovisual resources from the target culture that communicate information in the past, present, and future on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities; and"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and synthesize cultural practices and perspectives from authentic audio and audiovisual resources."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student communicates using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The presentational mode refers to the creation of oral and written messages in the target language. The student's presentation is comprehensible to an audience unaccustomed to interacting with language learners. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "plan, produce, and present, with consistent ease and clarity of expression, spoken presentational communications that are supported with cited examples in multiple paragraph length discourse to explain, express opinions, describe, and narrate on topics that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities; and"}
        },
        {
            "competencyText": {"en-us": "plan and produce, with consistent ease and clarity of expression, written presentational communications that are supported with cited examples in multiple paragraph length discourse to explain, express opinions, describe, and narrate on topics that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities."}
        },
        {
            "competencyText": {"en-us": "Seminar in Languages Other Than English, Advanced (One-Half to One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.46 adopted to be effective July 15, 2014, 39 TexReg 5385."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. All products and presentations must be in the target language. A prerequisite to enroll into this course is a minimum performance level of Intermediate Mid to Advanced High on the American Council on the Teaching of Foreign Languages (ACTFL) scale. The student may take this course with different course content for a maximum of three credits. The course shall be conducted in the target language."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. ACTFL identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English (LOTE). The use of culturally authentic resources in world language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "The student enrolled in a seminar course in a modern language will focus on a specialized area of study such as the work of a particular author, genre, or topic. The student will speak, write, read, and listen, as appropriate, in the target language for a variety of audiences and purposes. The student is expected to plan, draft, and complete written compositions as well as oral presentations on a regular basis and carefully examine his or her papers and presentations for clarity, engaging language, and the correct use of the conventions and mechanics of the target language as applicable."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "The student inquires through assigned topics and research in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "generate relevant and researchable questions with instructor guidance and approval;"}
        },
        {
            "competencyText": {"en-us": "communicate with accuracy and fluency in order to participate fully and effectively in conversations on a variety of topics in formal and informal settings from multiple perspectives;"}
        },
        {
            "competencyText": {"en-us": "comprehend language from within the cultural framework, including the use of nuance and subtlety;"}
        },
        {
            "competencyText": {"en-us": "produce formal and informal correspondence on a variety of social, academic, or professional topics;"}
        },
        {
            "competencyText": {"en-us": "produce in-depth summaries, reports, or research papers on a variety of social, academic, or professional topics; and"}
        },
        {
            "competencyText": {"en-us": "pose relevant questions from the research findings or conclusions for further study."}
        },
        {
            "competencyText": {"en-us": "The student applies critical-thinking skills to build a portfolio that organizes and uses information acquired from a variety of sources, including technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "collect a variety of visual images such as photographs, paintings, political cartoons, and other media;"}
        },
        {
            "competencyText": {"en-us": "compile written ideas and representations;"}
        },
        {
            "competencyText": {"en-us": "interpret information and draw conclusions from a wide range of sources;"}
        },
        {
            "competencyText": {"en-us": "identify bias in written, oral, and visual material;"}
        },
        {
            "competencyText": {"en-us": "use writing and speaking skills for reflection and exploration;"}
        },
        {
            "competencyText": {"en-us": "cite sources appropriately; and"}
        },
        {
            "competencyText": {"en-us": "present a portfolio."}
        },
        {
            "competencyText": {"en-us": "Classical Languages, Level I, Novice Low to Intermediate Low Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.47 adopted to be effective November 3, 2014, 39 TexReg 8574."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level I can be offered in elementary, middle, or high school. At the high school level, students shall be awarded one credit for successful completion of this course. There is no prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of classical languages such as Latin and Greek read and comprehend proficiency-level appropriate texts. The communicative skills of listening, speaking, and writing are used to enhance the interpretive communication mode of reading."}
        },
        {
            "competencyText": {"en-us": "Districts may offer a level of a language in a variety of scheduling arrangements that may extend or reduce the traditional schedule when careful consideration is given to the instructional time available on a campus and the language ability, access to programs, and motivation of students."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational. Interpretative communication is the overarching goal of classical language instruction. Students of classical languages should be provided ample opportunities to interpret culturally appropriate materials in the language of study, supported by opportunities for interpersonal and presentational communication."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others such as conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts such as comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction such as presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English. The use of culturally authentic resources in classical language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Students recognize the importance of acquiring accuracy of expression by knowing the components of language, including grammar, syntax, and genre."}
        },
        {
            "competencyText": {"en-us": "At the end of Level I, students of classical languages should reach a Novice High to Intermediate Low proficiency level in reading, a Novice Low to Novice Mid proficiency level in listening, a Novice Low to Novice Mid proficiency level in speaking, and a Novice Mid proficiency level in writing. Proficiency levels are aligned with the ACTFL Proficiency Guidelines 2012 and the ACTFL Performance Descriptors for Language Learners."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice Low proficiency level express meaning on some very familiar topics, using single words and phrases that have been practiced and memorized. They are best able to understand a few memorized words and phrases when heard. Novice Low students may be difficult to understand by the most sympathetic listeners and are likely to make frequent errors in pronunciation and syntax."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice Mid proficiency level express meaning in highly predictable contexts through the use of memorized and recalled words and phrases. They are best able to understand aural cognates, borrowed words, and high-frequency, highly contextualized words and phrases with repetition. Novice Mid students may be difficult to understand by the most sympathetic listeners and readers accustomed to dealing with language learners. Novice Mid students are inconsistently successful when performing Novice-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice High proficiency level express meaning in simple, predictable contexts through the use of learned and recombined phrases and short sentences. They are best able to understand sentence-length information within highly contextualized situations and sources. Novice High students may generally be understood by sympathetic listeners and readers accustomed to dealing with language learners. Novice High students are consistently successful when performing Novice-level tasks. Novice High students show evidence of Intermediate Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate Low proficiency level express meaning in straightforward and personal contexts by combining and recombining what they know, what they read, and what they hear in short statements and sentences. Intermediate Low students are able to understand some information from simple connected statements in oral or written sources. Intermediate Low students are generally understood by sympathetic listeners and readers accustomed to dealing with language learners. Intermediate Low students are inconsistently successful when performing Intermediate-level tasks."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student negotiates meaning through the spoken and written exchange of information in a variety of contexts. The student uses a mixture of words and phrases with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask and respond to questions, such as yes/no questions, either/or questions, or who/what/where/when questions, in spoken or written conversation in classroom contexts; and"}
        },
        {
            "competencyText": {"en-us": "articulate memorized requests, greetings, and introductions in spoken or written conversation."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student comprehends sentence-length information from culturally relevant print, digital, audio, and audiovisual materials as appropriate within highly contextualized situations and sources. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of culturally relevant print, digital, audio, or audiovisual materials in classroom contexts;"}
        },
        {
            "competencyText": {"en-us": "identify key words and details from fiction or nonfiction texts or audio or audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "infer meaning of unfamiliar words or phrases in highly contextualized texts, audio, or audiovisual materials; and"}
        },
        {
            "competencyText": {"en-us": "identify cultural practices from authentic print, digital, audio, or audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student presents information orally or in writing using a mixture of words and phrases with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "express an opinion or preference orally or in writing; and"}
        },
        {
            "competencyText": {"en-us": "describe people, objects, or simple situations orally or in writing using a mixture of words, phrases, or simple sentences."}
        },
        {
            "competencyText": {"en-us": "Classical Languages, Level II, Novice Mid to Intermediate Mid Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.48 adopted to be effective November 3, 2014, 39 TexReg 8574."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level II can be offered in elementary, middle, or high school. At the high school level, students shall be awarded one credit for successful completion of this course. Successful completion of Level I or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of classical languages such as Latin and Greek read and comprehend proficiency-level appropriate texts. The communicative skills of listening, speaking, and writing are used to enhance the interpretive communication mode of reading."}
        },
        {
            "competencyText": {"en-us": "Districts may offer a level of a language in a variety of scheduling arrangements that may extend or reduce the traditional schedule when careful consideration is given to the instructional time available on a campus and the language ability, access to programs, and motivation of students."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational. Interpretative communication is the overarching goal of classical language instruction. Students of classical languages should be provided ample opportunities to interpret culturally appropriate materials in the language of study, supported by opportunities for interpersonal and presentational communication."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others such as conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts such as comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction such as presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English. The use of culturally authentic resources in classical language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Students recognize the importance of acquiring accuracy of expression by knowing the components of language, including grammar, syntax, and genre."}
        },
        {
            "competencyText": {"en-us": "At the end of Level II, students of classical languages should reach an Intermediate Low to Intermediate Mid proficiency level in reading, a Novice Mid to Novice High proficiency level in listening, a Novice Mid proficiency level in speaking, and a Novice Mid to Novice High proficiency level in writing. Proficiency levels are aligned with the ACTFL Proficiency Guidelines 2012 and the ACTFL Performance Descriptors for Language Learners."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice Mid proficiency level express meaning in highly predictable contexts through the use of memorized and recalled words and phrases. They are best able to understand aural cognates, borrowed words, and high-frequency, highly contextualized words and phrases with repetition. Novice Mid students may be difficult to understand by the most sympathetic listeners and readers accustomed to dealing with language learners. Novice Mid students are inconsistently successful when performing Novice-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice High proficiency level express meaning in simple, predictable contexts through the use of learned and recombined phrases and short sentences. Novice High students are best able to understand sentence-length information within highly contextualized situations and sources. Novice High students may generally be understood by sympathetic listeners and readers accustomed to dealing with language learners. Novice High students are consistently successful when performing Novice-level tasks. Novice High students show evidence of Intermediate Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate Low proficiency level express meaning in straightforward and personal contexts by combining and recombining what they know, what they read, and what they hear in short statements and sentences. Intermediate Low students are able to understand some information from simple connected statements in oral or written sources. Intermediate Low students are generally understood by sympathetic listeners and readers accustomed to dealing with language learners. Intermediate Low students are inconsistently successful when performing Intermediate-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate Mid proficiency level express meaning in straightforward and personal contexts by easily combining and recombining what they know, what they read, and what they hear in short statements and a mixture of sentences and strings of sentences. Intermediate Mid students are able to understand some information from connected statements in oral or written sources. Intermediate Mid students are generally understood by sympathetic listeners and readers accustomed to dealing with language learners. Intermediate Mid students are consistently successful when performing Intermediate-level tasks."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student negotiates meaning through the spoken and written exchange of information in a variety of contexts. The student uses a mixture of words, phrases, and simple sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask and respond to questions with simple elaboration in spoken or written conversation;"}
        },
        {
            "competencyText": {"en-us": "express and exchange personal opinions or preferences in spoken or written conversation using simple constructions such as impersonal verbs; and"}
        },
        {
            "competencyText": {"en-us": "ask and tell others what they need to, should, or must do in spoken or written conversation using appropriate constructions such as the imperative mood, impersonal verbs, or the subjunctive mood."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student comprehends simple connected statements from culturally relevant print, digital, audio, and audiovisual materials as appropriate within contextualized situations and sources. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of culturally relevant print, digital, audio, or audiovisual materials in classroom contexts;"}
        },
        {
            "competencyText": {"en-us": "identify the main idea, theme, and supporting details from fiction or nonfiction texts or audio or audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "infer meaning of unfamiliar words or phrases in highly contextualized texts, audio, or audiovisual materials; and"}
        },
        {
            "competencyText": {"en-us": "identify cultural practices from relevant print, digital, audio, or audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student presents information orally or in writing using a mixture of phrases and simple sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "express and support an opinion or preference orally or in writing; and"}
        },
        {
            "competencyText": {"en-us": "describe people, objects, or situations orally or in writing with essential details."}
        },
        {
            "competencyText": {"en-us": "Classical Languages, Level III, Novice Mid to Advanced Low Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.49 adopted to be effective November 3, 2014, 39 TexReg 8574."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level III can be offered in middle or high school. At the high school level, students shall be awarded one credit for successful completion of this course. Successful completion of Level II or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of classical languages such as Latin and Greek read and comprehend proficiency-level appropriate authentic texts of prose or poetry of selected authors. The communicative skills of listening, speaking, and writing are used to enhance the interpretive communication mode of reading."}
        },
        {
            "competencyText": {"en-us": "Districts may offer a level of a language in a variety of scheduling arrangements that may extend or reduce the traditional schedule when careful consideration is given to the instructional time available on a campus and the language ability, access to programs, and motivation of students."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational. Interpretative communication is the overarching goal of classical language instruction. Students of classical languages should be provided ample opportunities to interpret culturally appropriate materials in the language of study, supported by opportunities for interpersonal and presentational communication."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others such as conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts such as comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction such as presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English. The use of culturally authentic resources in classical language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Students recognize the importance of acquiring accuracy of expression by knowing the components of language, including grammar, syntax, and genre."}
        },
        {
            "competencyText": {"en-us": "At the end of Level III, students of classical languages should reach an Intermediate High to Advanced Low proficiency level in reading, a Novice High proficiency level in listening, a Novice Mid to Novice High proficiency level in speaking, and a Novice Mid to Novice High proficiency level in writing. Proficiency levels are aligned with the ACTFL Proficiency Guidelines 2012 and the ACTFL Performance Descriptors for Language Learners."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice Mid proficiency level express meaning in highly predictable contexts through the use of memorized and recalled words and phrases. They are best able to understand aural cognates, borrowed words, and high-frequency, highly contextualized words and phrases with repetition. Novice Mid students may be difficult to understand by the most sympathetic listeners and readers accustomed to dealing with language learners. Novice Mid students are inconsistently successful when performing Novice-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice High proficiency level express meaning in simple, predictable contexts through the use of learned and recombined phrases and short sentences. Novice High students are best able to understand sentence-length information within highly contextualized situations and sources. Novice High students may generally be understood by sympathetic listeners and readers accustomed to dealing with language learners. Novice High students are consistently successful when performing Novice-level tasks. Novice High students show evidence of Intermediate Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate High proficiency level express meaning in a variety of contexts by creating with the language, easily combining and recombining what they know, what they read, and what they hear in a mixture of sentences and connected discourse. Intermediate High students are able to understand information from connected statements in oral or written sources. Intermediate High students are generally understood by listeners and readers unaccustomed to dealing with language learners. Intermediate High students are consistently successful when performing Intermediate-level tasks. Intermediate High students show evidence of Advanced Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "Students at the Advanced Low proficiency level are able to understand conventional narrative and descriptive texts with a clear underlying structure though their comprehension may be uneven. These texts predominantly contain high-frequency vocabulary and structures. Readers understand the main ideas and some supporting details. Comprehension may often derive primarily from situational and subject-matter knowledge. Readers at this level will be challenged to comprehend more complex texts."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student negotiates meaning through the spoken and written exchange of information in a variety of contexts. The student uses a mixture of words, phrases, and simple sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask and respond to questions with simple elaboration in spoken or written conversation;"}
        },
        {
            "competencyText": {"en-us": "express and exchange personal opinions or preferences in spoken or written conversation using simple constructions such as impersonal verbs; and"}
        },
        {
            "competencyText": {"en-us": "ask and tell others what they need to, should, or must do in spoken or written conversation using appropriate constructions such as the imperative mood, impersonal verbs, or the subjunctive mood."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student comprehends connected statements from culturally authentic print, digital, audio, and audiovisual materials as appropriate within contextualized situations and sources. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of culturally authentic print, digital, audio, or audiovisual materials in a variety of contexts;"}
        },
        {
            "competencyText": {"en-us": "paraphrase the main idea, theme, and supporting details from fiction or nonfiction texts or audio or audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "analyze authentic literature with respect to stylistic topics such as elements of genre, literary devices, audience, or metrics;"}
        },
        {
            "competencyText": {"en-us": "infer meaning of unfamiliar words or phrases in contextualized texts, audio, or audiovisual materials; and"}
        },
        {
            "competencyText": {"en-us": "compare and contrast cultural practices from authentic print, digital, audio, or audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student presents information orally or in writing using a mixture of phrases and sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "cite the justification for an opinion or preference orally or in writing using textual evidence; and"}
        },
        {
            "competencyText": {"en-us": "read prose or poetry aloud with attention to features of declamation such as metrical structure, meaningful phrase grouping, and appropriate voice inflection."}
        },
        {
            "competencyText": {"en-us": "Classical Languages, Level IV, Novice Mid to Advanced Mid Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.50 adopted to be effective November 3, 2014, 39 TexReg 8574."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Level IV can be offered in middle or high school. At the high school level, students shall be awarded one credit for successful completion of this course. Successful completion of Level III or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of classical languages such as Latin and Greek read and comprehend proficiency level-appropriate authentic texts of prose or poetry of selected authors. The communicative skills of listening, speaking, and writing are used to enhance the interpretive communication mode of reading."}
        },
        {
            "competencyText": {"en-us": "Districts may offer a level of a language in a variety of scheduling arrangements that may extend or reduce the traditional schedule when careful consideration is given to the instructional time available on a campus and the language ability, access to programs, and motivation of students."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational. Interpretative communication is the overarching goal of classical language instruction. Students of classical languages should be provided ample opportunities to interpret culturally appropriate materials in the language of study, supported by opportunities for interpersonal and presentational communication."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others such as conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts such as comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction such as presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English. The use of culturally authentic resources in classical language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Students recognize the importance of acquiring accuracy of expression by knowing the components of language, including grammar, syntax, and genre."}
        },
        {
            "competencyText": {"en-us": "At the end of Level IV, students of classical languages should reach an Advanced Low to Advanced Mid proficiency level in reading, a Novice High proficiency level in listening, a Novice Mid to Novice High proficiency level in speaking, and a Novice Mid to Novice High proficiency level in writing. Proficiency levels are aligned with the ACTFL Proficiency Guidelines 2012 and the ACTFL Performance Descriptors for Language Learners."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice Mid proficiency level express meaning in highly predictable contexts through the use of memorized and recalled words and phrases. They are best able to understand aural cognates, borrowed words, and high-frequency, highly contextualized words and phrases with repetition. Novice Mid students may be difficult to understand by the most sympathetic listeners and readers accustomed to dealing with language learners. Novice Mid students are inconsistently successful when performing Novice-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students at the Novice High proficiency level express meaning in simple, predictable contexts through the use of learned and recombined phrases and short sentences. Novice High students are best able to understand sentence-length information within highly contextualized situations and sources. Novice High students may generally be understood by sympathetic listeners and readers accustomed to dealing with language learners. Novice High students are consistently successful when performing Novice-level tasks. Novice High students show evidence of Intermediate Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "Students at the Advanced Low proficiency level are able to understand conventional narrative and descriptive texts with a clear underlying structure though their comprehension may be uneven. These texts predominantly contain high-frequency vocabulary and structures. Readers understand the main ideas and some supporting details. Comprehension may often derive primarily from situational and subject-matter knowledge. Readers at this level will be challenged to comprehend more complex texts."}
        },
        {
            "competencyText": {"en-us": "Students at the Advanced Mid proficiency level are able to understand conventional narrative and descriptive texts such as expanded descriptions of persons, places, and things and narrations about past, present, and future events. These texts reflect the standard linguistic conventions of the written form of the language in such a way that readers can predict what they are going to read. Readers understand the main ideas, facts, and many supporting details. Comprehension derives not only from situational and subject-matter knowledge but also from knowledge of the language itself. Readers at this level may derive some meaning from texts that are structurally and/or conceptually more complex."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student negotiates meaning through the spoken and written exchange of information in a variety of contexts. The student uses a mixture of words, phrases, and simple sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask and respond to questions with simple elaboration in spoken or written conversation;"}
        },
        {
            "competencyText": {"en-us": "express and exchange personal opinions or preferences, in spoken or written conversation, using constructions such as impersonal verbs; and"}
        },
        {
            "competencyText": {"en-us": "ask and tell others what they need to, should, and must do in spoken or written conversation using constructions such as the imperative mood, impersonal verbs, or the subjunctive mood."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student comprehends connected statements from culturally authentic print, digital, audio, or audiovisual materials as appropriate within contextualized situations and sources. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze culturally authentic print, digital, audio, or audiovisual materials in a variety of contexts;"}
        },
        {
            "competencyText": {"en-us": "paraphrase and analyze the main idea, theme, and supporting details from fiction or nonfiction texts, prepared or unprepared, or from audio or audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "analyze authentic literature in depth with respect to topics such as elements of genre, literary devices, audience, or metrics;"}
        },
        {
            "competencyText": {"en-us": "infer meaning of unfamiliar words or phrases in texts, audio, or audiovisual materials; and"}
        },
        {
            "competencyText": {"en-us": "compare and contrast cultural practices and perspectives from authentic print, digital, audio, or audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student presents information orally or in writing using a mixture of phrases and sentences with appropriate and applicable grammar structures and processes at the specified proficiency levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "cite the justification for an opinion or an argument orally or in writing utilizing textual evidence; and"}
        },
        {
            "competencyText": {"en-us": "read prose or poetry aloud with attention to features such as metrical structure, meaningful phrase grouping, and appropriate voice inflection."}
        },
        {
            "competencyText": {"en-us": "Classical Languages, Levels V-VII, Novice High to Superior Low Proficiency (One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.51 adopted to be effective November 3, 2014, 39 TexReg 8574."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Levels V-VII can be offered in high school. Students shall be awarded one credit for successful completion of this course. Successful completion of the preceding level or demonstrated equivalent proficiency as determined by the district is a prerequisite for this course."}
        },
        {
            "competencyText": {"en-us": "Students of classical languages read and comprehend on-level authentic texts of prose and poetry of selected authors. The skills of listening, speaking, and writing are used to reinforce the skill of reading."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational. Interpretative communication is the overarching goal of classical language instruction. Students of classical languages should be provided ample opportunities to interpret culturally appropriate materials in the language of study, supported by opportunities for interpersonal and presentational communication."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others such as face to face exchanges, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts such as comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction such as presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English. The use of culturally authentic resources in classical language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "The three modes of communication (interpersonal, interpretive, and presentational) provide the organizing principle for describing language performance across all ranges of performance: Novice, Intermediate, Advanced, Superior, and Distinguished."}
        },
        {
            "competencyText": {"en-us": "The interpersonal mode is characterized by the active negotiation of meaning among individuals. Participants observe and monitor one another to see how their meanings and intentions are being communicated. Adjustments and clarifications can be made accordingly."}
        },
        {
            "competencyText": {"en-us": "The interpretive mode focuses on the appropriate cultural interpretation of meanings that occur in written and spoken form where there is no recourse to the active negotiation of meaning with the writer or the speaker."}
        },
        {
            "competencyText": {"en-us": "The presentational mode refers to the creation of oral and written messages in a manner that facilitates interpretation by members of the other culture where no direct opportunity for the active negotiation of meaning between members of the two cultures exists."}
        },
        {
            "competencyText": {"en-us": "All student expectations and modes of communication are aligned with and address the ACTFL National Standards for Foreign Language Education: Communication, Cultures, Connections, Comparisons, and Communities."}
        },
        {
            "competencyText": {"en-us": "Students of classical languages should reach an Advanced High to Superior Low proficiency level in reading during Levels V-VII. Students of classical languages will require more time to achieve proficiency in speaking, writing, and listening and should reach a Novice High to Intermediate Low proficiency level in speaking, writing, and listening during Levels V-VII."}
        },
        {
            "competencyText": {"en-us": "Students of classical languages wishing to pursue advanced study targeted to specific topics may consider enrolling in a course under §114.52 of this title (relating to Seminar in Classical Languages, Advanced (One-Half to One Credit), Adopted 2014)."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student communicates in the interpersonal mode using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The interpersonal mode is the ability to understand and exchange information in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "engage in simple exchanges with generally consistent use of syntax in any time frame and respond appropriately to questions, statements, commands, or other stimuli such as pictures, gestures, or the surrounding environment; and"}
        },
        {
            "competencyText": {"en-us": "produce written exchanges at the appropriate proficiency level that provide information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The interpretive mode focuses on comprehending main ideas and identifying some supporting details in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze information from a variety of prepared or unprepared authentic texts in various literary genres and relevant print, electronic, audio, or audiovisual resources that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities;"}
        },
        {
            "competencyText": {"en-us": "compare, contrast, and analyze cultural practices and perspectives from authentic texts or relevant print, electronic, audio, or audiovisual resources; and"}
        },
        {
            "competencyText": {"en-us": "analyze authentic literature in depth with respect to stylistic topics such as elements of genre, literary devices, audience, or metrics."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student communicates using appropriate and applicable grammatical structures and processes in the target language at the specified proficiency levels. The presentational mode refers to the creation of oral and written messages in the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "cite the justification for an opinion or an argument orally or in writing using textual evidence to explain, express opinions, describe, or narrate on topics that communicate information on a variety of geographic, scientific, historical, artistic, social, or political features of target culture communities; and"}
        },
        {
            "competencyText": {"en-us": "read prose or poetry aloud with attention to features of declamation such as metrical structure, meaningful phrase grouping, and appropriate voice inflection and gestures."}
        },
        {
            "competencyText": {"en-us": "Seminar in Classical Languages, Advanced (One-Half to One Credit), Adopted 2014."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.52 adopted to be effective November 3, 2014, 39 TexReg 8574."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one-half to one credit for successful completion of this course. Products and presentations need not be produced entirely in the target language. A prerequisite to enroll into this course is a minimum proficiency level of Advanced Mid in reading and a minimum performance level of Novice High in listening, speaking, and writing on the American Council on the Teaching of Foreign Languages (ACTFL) scale. The student may take this course with different course content for a maximum of three credits. The course need not be conducted entirely in the target language. Fluency in the target language should reflect a minimum proficiency level of Novice High in the speaking, listening, and writing skills."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture. Students become aware of multiple perspectives and means of expression, which lead to an appreciation of difference and diversity. Further benefits of foreign language study include stronger cognitive development, increased creativity, and divergent thinking. Students who effectively communicate in more than one language, with an appropriate understanding of cultural context, are globally literate and possess the attributes of successful participants in the world community."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students may be provided ample opportunities to engage in conversations, to present information to an audience, or to interpret culturally authentic materials in or about the language of study. ACTFL identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and culturally authentic resources is imperative to support the teaching of the essential knowledge and skills for languages other than English. The use of culturally authentic resources in classical language study enables students to make connections with other content areas, to compare the language and culture studied with their own, and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "The student enrolled in a seminar course in a classical language will focus on a specialized area of study such as the work of a particular author, genre, or topic. The student will speak, write, read, or listen, as appropriate, in the target language for a variety of audiences and purposes. The student is expected to plan, draft, and complete written compositions as well as oral presentations on a regular basis and carefully examine his or her papers and presentations for clarity, engaging language, and the correct use of conventions and mechanics as applicable."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "The student inquires through assigned topics and research in or about the target language. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "generate relevant and researchable questions with instructor guidance and approval;"}
        },
        {
            "competencyText": {"en-us": "communicate with clarity in order to participate fully and effectively in conversations on a variety of topics from multiple perspectives in formal and informal settings;"}
        },
        {
            "competencyText": {"en-us": "comprehend language from within the cultural framework or genre, including the use of nuance and subtlety;"}
        },
        {
            "competencyText": {"en-us": "produce in-depth summaries, reports, or research papers on a variety of social, academic, or professional topics; and"}
        },
        {
            "competencyText": {"en-us": "pose relevant questions from the research findings or conclusions for further study."}
        },
        {
            "competencyText": {"en-us": "The student applies critical-thinking skills to build a portfolio that organizes and uses information acquired from a variety of sources, including technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "collect a variety of visual images such as photographs of mosaics, frescoes, graffiti, coins, statues, architecture, reliefs, and other media;"}
        },
        {
            "competencyText": {"en-us": "compile written ideas and representations;"}
        },
        {
            "competencyText": {"en-us": "interpret information and draw conclusions from a wide range of sources;"}
        },
        {
            "competencyText": {"en-us": "identify bias in written, oral, or visual material;"}
        },
        {
            "competencyText": {"en-us": "use writing or speaking skills for reflection and exploration;"}
        },
        {
            "competencyText": {"en-us": "cite sources appropriately; and"}
        },
        {
            "competencyText": {"en-us": "present a portfolio."}
        },
        {
            "competencyText": {"en-us": "Advanced Language for Career Applications (One Credit)."},
            "comment": {
                "en-us": ["Source: The provisions of this §114.53 adopted to be effective July 30, 2017, 42 TexReg 3640."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements."}
        },
        {
            "competencyText": {"en-us": "Advanced Language for Career Applications may be offered in high school. Students shall be awarded one credit for successful completion of this course. Prerequisite: successful completion of Level III, achieving an Intermediate Low to Intermediate Mid proficiency level, or demonstrated equivalent proficiency as determined by the district."}
        },
        {
            "competencyText": {"en-us": "Districts may offer this course in a variety of scheduling arrangements that may extend or reduce the traditional schedule when careful consideration is given to the instructional time available on a campus and the language ability, access to programs, and motivation of students."}
        },
        {
            "competencyText": {"en-us": "This course may not satisfy a high school languages other than English (LOTE) graduation requirement or a LOTE requirement for an endorsement. Students shall be awarded one elective credit for successful completion of this course."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "The study of world languages is an essential part of education. In the 21st century language classroom, students gain an understanding of two basic aspects of human existence: the nature of communication and the complexity of culture."}
        },
        {
            "competencyText": {"en-us": "The Advanced Language for Career Applications course provides students with instruction in terminology that prepares students to communicate in a language other than English in a professional, business, or industry setting. Students will learn how to communicate in the target language and use culturally appropriate language when addressing diverse audiences in different workplace environments."}
        },
        {
            "competencyText": {"en-us": "Communication is the overarching goal of world language instruction. Students should be provided ample opportunities to engage in conversations, to present information to an audience, and to interpret culturally authentic materials in the language of study. The American Council on the Teaching of Foreign Languages (ACTFL) identifies three modes of communication: interpersonal, interpretive, and presentational."}
        },
        {
            "competencyText": {"en-us": "In the interpersonal mode of communication, students engage in direct oral or written communication with others. Examples of this \"two-way\" communication include but are not limited to conversing face to face, participating in digital discussions and messaging, and exchanging personal letters."}
        },
        {
            "competencyText": {"en-us": "In the interpretive mode of communication, students demonstrate understanding of spoken and written communication within appropriate cultural contexts. Examples of this type of \"one-way\" reading or listening include but are not limited to comprehension of digital texts as well as print, audio, and audiovisual materials."}
        },
        {
            "competencyText": {"en-us": "In the presentational mode of communication, students present orally or in writing information, concepts, and ideas to an audience of listeners or readers with whom there is no immediate interaction. Examples of this \"one-to-many\" mode of communication include but are not limited to presenting to a group; creating and posting digital content; or writing reports, compositions, or articles for a magazine or newspaper."}
        },
        {
            "competencyText": {"en-us": "The use of age-level appropriate and industry-specific authentic resources is imperative to support the teaching of the essential knowledge and skills for LOTE. The use of authentic resources in the target language enables students to increase their academic vocabulary and to participate in local and global communities."}
        },
        {
            "competencyText": {"en-us": "Students recognize the importance of acquiring accuracy of expression by knowing the components of language, including grammar, syntax, register (formal or informal language use), appropriate discourse level, and text type."}
        },
        {
            "competencyText": {"en-us": "Students in Advanced Language for Career Applications are expected to reach a proficiency level of Intermediate Mid to Intermediate High, as defined in the ACTFL Proficiency Guidelines 2012 and the ACTFL Performance Descriptors for Language Learners."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate Mid proficiency level express meaning in straightforward and personal contexts by easily combining and recombining what they know, what they read, and what they hear in short statements and a mixture of sentences and strings of sentences. Intermediate Mid students are able to understand some information from connected statements in oral or written sources. Intermediate Mid students are generally understood by sympathetic listeners and readers accustomed to dealing with language learners. Intermediate Mid students are consistently successful when performing Intermediate-level tasks."}
        },
        {
            "competencyText": {"en-us": "Students at the Intermediate High proficiency level express meaning in a variety of contexts by creating with the language, easily combining and recombining what they know, what they read, and what they hear in a mixture of sentences and connected discourse. Intermediate High students are able to understand information from connected statements in oral or written sources. Intermediate High students are generally understood by listeners and readers unaccustomed to dealing with language learners. Intermediate High students are consistently successful when performing Intermediate-level tasks. Intermediate High students show evidence of Advanced Low proficiency but lack consistency."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Interpersonal communication: speaking and writing. The student negotiates meaning through the spoken and written exchange of information in the target language in rehearsed and unrehearsed situations in a variety of contexts appropriate to the professional, business, or industry setting. The student uses a mixture of sentences and connected discourse with appropriate and applicable grammar structures and processes. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use professional etiquette and protocol such as making introductions, speaking on the telephone, and offering and receiving feedback appropriate to the professional, business, or industry setting;"}
        },
        {
            "competencyText": {"en-us": "participate appropriately in conversations and in informal written exchanges related to the professional, business, or industry setting;"}
        },
        {
            "competencyText": {"en-us": "identify and use appropriate strategies for communicating with diverse individuals;"}
        },
        {
            "competencyText": {"en-us": "evaluate the effectiveness of one's own and others' communication;"}
        },
        {
            "competencyText": {"en-us": "give and receive complex oral instructions to perform tasks specific to the professional, business, or industry setting;"}
        },
        {
            "competencyText": {"en-us": "interact and react in spoken conversation using culturally appropriate expressions, register, and gestures; and"}
        },
        {
            "competencyText": {"en-us": "interact and react in writing using culturally appropriate expressions, register, and style."}
        },
        {
            "competencyText": {"en-us": "Interpretive communication: reading and listening. The student comprehends connected statements appropriate to the target language and the professional, business, or industry setting from culturally authentic print, digital, audio, and audiovisual materials. The student uses the interpretive mode in communication with appropriate and applicable grammatical structures and processes. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "employ appropriate verbal, nonverbal, and listening comprehension skills to enhance relationships in the professional, business, or industry setting;"}
        },
        {
            "competencyText": {"en-us": "paraphrase the main idea and supporting details from professional, business, or industry-related texts, audio, and audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast practices and perspectives related to the professional, business, or industry setting from authentic print, digital, audio, and audiovisual materials;"}
        },
        {
            "competencyText": {"en-us": "use prior knowledge and experiences to understand and interpret meanings in oral and written print, digital, audio, and audiovisual materials appropriate to the professional, business, or industry setting;"}
        },
        {
            "competencyText": {"en-us": "apply data to evaluate performance or provide solutions to problems specific to the professional, business, or industry setting; and"}
        },
        {
            "competencyText": {"en-us": "understand and follow directives and procedures within the context of the professional, business, or industry setting."}
        },
        {
            "competencyText": {"en-us": "Presentational communication: speaking and writing. The student presents business or industry-related information in the target language both orally and in writing using a mixture of sentences and connected discourse with appropriate and applicable grammar structures and processes with an awareness of situational uses of language in cultural contexts. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "apply spoken and written conventions and mechanics;"}
        },
        {
            "competencyText": {"en-us": "present analyzed data and communicate findings in a variety of formats specific to the professional, business, or industry setting;"}
        },
        {
            "competencyText": {"en-us": "design and present an effective professional, business, or industry-related product using appropriate register for the audience, occasion, and purpose; and"}
        },
        {
            "competencyText": {"en-us": "create written, oral, and visual presentations of professional, business, or industry-related information to inform, persuade, or motivate an audience."}
        },
        {
            "competencyText": {"en-us": "Professional, business, or industry-specific terminology. The student effectively communicates using the target language and cultural understanding in rehearsed and unrehearsed situations using professional, business, or industry-specific terminology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use various strategies to infer the meaning of unfamiliar words or phrases in business or industry-specific texts, audio, and audiovisual materials such as trade publications, case studies, business journals, or conference presentations;"}
        },
        {
            "competencyText": {"en-us": "apply newly acquired basic and academic language related to the professional, business, or industry setting in meaningful ways that build concepts and language implementation;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of different dialects used in communities served by the profession, business, or industry; and"}
        },
        {
            "competencyText": {"en-us": "communicate using advanced technical vocabulary, jargon, and abbreviations necessary for communicating with employers, clients, and other professionals in the target language."}
        },
        {
            "competencyText": {"en-us": "Career applications. The student demonstrates professional standards/employability skills as required in the professional, business, or industry setting. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate appropriate communication for employers, clients, and coworkers in the target language through verbal, nonverbal, and digital means;"}
        },
        {
            "competencyText": {"en-us": "demonstrate professional etiquette appropriate to the professional, business, or industry setting;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of relevant ethical and legal issues such as confidentiality and fiduciary responsibility;"}
        },
        {
            "competencyText": {"en-us": "communicate effectively in the target language in career development activities such as mock interviews;"}
        },
        {
            "competencyText": {"en-us": "set goals and reflect on progress in using the target language for career development and advancement; and"}
        },
        {
            "competencyText": {"en-us": "adhere to ethical codes of conduct by following copyright laws and restrictions and using technology responsibly."}
        },
        {
            "competencyText": {"en-us": "Implementation of Texas Essential Knowledge and Skills for Languages Other Than English, High School, Adopted 2014."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §114.31 adopted to be effective July 15, 2014, 39 TexReg 5385",
                    " amended to be effective November 3, 2014, 39 TexReg 8574."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The provisions of this section and §§114.32-114.52 of this title shall be implemented by school districts."}
        },
        {
            "competencyText": {"en-us": "The provisions of §114.33 of this title (relating to Special Topics in Language and Culture (One Credit), Adopted 2014) shall be implemented beginning with the 2014-2015 school year."}
        },
        {
            "competencyText": {"en-us": "No later than August 31, 2016, the commissioner of education shall determine whether instructional materials funding has been made available to Texas public schools for materials that cover the essential knowledge and skills for languages other than English as adopted in §§114.32 and 114.34-114.52 of this title."}
        },
        {
            "competencyText": {"en-us": "If the commissioner makes the determination that instructional materials funding has been made available under subsection (c) of this section, §§114.32 and 114.34-114.52 of this title shall be implemented beginning with the 2017-2018 school year and apply to the 2017-2018 and subsequent school years."}
        },
        {
            "competencyText": {"en-us": "If the commissioner does not make the determination that instructional materials funding has been made available under subsection (c) of this section, the commissioner shall determine no later than August 31 of each subsequent school year whether instructional materials funding has been made available. If the commissioner determines that instructional materials funding has been made available, the commissioner shall notify the State Board of Education and school districts that §§114.32 and 114.34-114.52 of this title shall be implemented for the following school year."}
        },
        {
            "competencyText": {"en-us": "Sections 114.21-114.29 of this title shall be superseded by the implementation of this section and §§114.32-114.52 of this title."}
        }
    ]
}