{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://case.georgiastandards.org/uri/3e7b4120-9bda-11ea-a315-0242ac150004",
        "name": {"en-us": "National Standards for Quality Online Courses"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "The overall design of the course is made clear to the learner at the beginning of the course. The course materials include support services essential to learner and instructor success. Course instructions articulate or link to relevant information and services."}
        },
        {
            "competencyText": {"en-us": "The online course provides learners with various content options that promote their mastery of content and are aligned with state or national content standards."}
        },
        {
            "competencyText": {"en-us": "The online course incorporates instructional materials, activities, resources, and assessments that are aligned to standards, engage all learners, and support the achievement of academic goals."}
        },
        {
            "competencyText": {"en-us": "A variety of assessment strategies are used throughout the course geared toward learning and engagement and learners are provided with feedback on their progress."}
        },
        {
            "competencyText": {"en-us": "The course design reflects a commitment to accessibility so that all learners can access all content and activities and to usability so that all learners can easily navigate and interact with all course components. Online course materials, activities, and assessments are designed to ensure that all learners have access to the same information and are able to engage in the same interactions and within the same time frame. The course, developed with universal design principles in mind, addresses Section 504 of the Rehabilitation Act of 1973 and Title II of the Americans with Disabilities Act (ADA) by following (Web Content Accessibility Guidelines) WCAG 2.0 AA standards. This does not guarantee or imply that particular country/federal/state/local accessibility regulations are met. Please consult with an accessibility specialist to ensure that all required accessibility regulations are met."}
        },
        {
            "competencyText": {"en-us": "The technologies enabling the various course components facilitate active learning and do not impede the learning process."}
        },
        {
            "competencyText": {"en-us": "The online course is evaluated regularly for effectiveness, using a variety of assessment strategies, and the findings are used as a basis for improvement. The course is kept up-to-date, both in content and in the application of new research on course design and technologies."}
        },
        {
            "competencyText": {"en-us": "A course overview and syllabus are included in the online course."},
            "comment": {
                "en-us": ["EXPLANATIONS\tAn overview of the course and the syllabus make clear to learners how to get started and where to find essential course components. These can be presented up front in the course instructions.\n\nEXAMPLES\tThe instructor has a syllabus posted in the course that includes a scope and sequence, pacing guide, contact information, link to orientation, textbook information, and grading information."]
            }
        },
        {
            "competencyText": {"en-us": "Minimum computer skills and digital literacy skills expected of the learner are clearly stated.*"},
            "comment": {
                "en-us": [
                    "EXPLANATIONS\tComputer skills might include the ability to download and upload files",
                    " download and install software",
                    " use email with attachments",
                    " copy and paste",
                    " create, save, and submit files in commonly used word-processing program formats",
                    " and work in multiple browser windows and tabs simultaneously.Digital literacy skills might include using online libraries and databases to locate information",
                    " using online search tools, properly citing sources",
                    " critical evaluation of information, including the accuracy of data sources",
                    " and creating digital content in various sources of media.\n\nEXAMPLES\tInformation about and/or a list of needed computer and digital literacy skills, tools, and resources should be included on the course homepage or on the learner dashboard.General, as well as course-specific skills, tools, and resources that learners must have to succeed in the course are specified.\n\nResources include tutorials and practice exercises to practice computer and digital literacy skills."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The instructor’s biographical information and information on how to communicate with the instructor are provided to learners and other stakeholders."},
            "comment": {
                "en-us": ["EXPLANATIONS\tInformation includes standards for instructor responsiveness and availability that are clearly stated. It also includes a self-introduction by the instructor, which is appropriate and is clearly available in the course.\n\nEXAMPLES\tInstructor information is provided to learners with contact, availability, and biographical information.Instructor response time and information on how to contact the instructor via phone, email, and/or online messaging tools is provided within the contact information.\n\nIf regular contact with the instructor is required as part of the course, clear expectations for meeting this requirement are posted within the course."]
            }
        },
        {
            "competencyText": {"en-us": "Learner expectations and policies are clearly stated and readily accessible within the introductory material of the course."},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe Acceptable Use Policy, as well as learner expectations for academic integrity, use of copyrighted materials, plagiarism and netiquette (Internet etiquette), privacy policies, and the accessibility policy are clearly stated.\n\nEXAMPLES\tPolicies are provided up front within the course overview, syllabus, or orientation.Learners are instructed to use the appropriate copyright and licensing labeling of all third-party content used in their assignments, including documents, videos, audio recordings, etc."]
            }
        },
        {
            "competencyText": {"en-us": "Minimum technology requirements for the course are clearly stated, and information on how to obtain the technologies is provided.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tLearners are provided with detailed, clearly worded information regarding the technologies they will need throughout the course, including information on where they can be obtained. The term “technologies” covers a wide range, including hardware, software, and plug-ins and mobile applications (apps).\n\nEXAMPLES\tLearners are told whether software used in the course runs on both Mac and PC.\n\nLearners are informed that they will need speakers, a microphone, and/or a headset.\n\nLearners are provided with a list of required downloadable resources, including links."]
            }
        },
        {
            "competencyText": {"en-us": "Grading policies and practices are clearly defined in accordance with course content learning expectations."},
            "comment": {
                "en-us": ["EXPLANATIONS\tExpectations for successfully completing the course, earning course credit, and calculating grades are clearly defined for the learner and instructor.\n\nEXAMPLES\tLearners begin the course with an instructor-supported overview of grading policies and procedures as they link to content objectives. These policies and procedures are clearly captured in an accessible document."]
            }
        },
        {
            "competencyText": {"en-us": "The online course provides a clear description or link to the technical support offered and how to obtain it.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tOnline technical help and support should be available any time. If 24/7 support is not available, support hours are clearly posted within the course or on the online program’s website, and a maximum response time is noted.\n\nEXAMPLES\tThe course provider has staff available by chat client from the content page for learners who are facing technical issues. From their location they are able to remotely access the learner’s machine to diagnose technology issues (i.e., browser extensions, system compatibility, connectivity issues, etc.).Assistance may take the form of Frequently Asked Questions, training resources, mentors, peer support, or conversational agent (chatbot)."]
            }
        },
        {
            "competencyText": {"en-us": "Learners are offered an orientation prior to the start of the online course."},
            "comment": {
                "en-us": ["EXPLANATIONS\tLearners are offered an orientation for taking an online course before starting the coursework when they are new to the learning environment, course structure, or tools. The orientation should describe the experience of learning online and what is needed to manage challenges successfully.\n\nEXAMPLES\tTime commitments, software and hardware requirements, and how to set up the learner’s computer and work environment may be part of this orientation. The training may be provided either in written form, face-to-face, through a video, or entirely online."]
            }
        },
        {
            "competencyText": {"en-us": "The online course objectives or competencies are measurable and clearly state what the learner will be able to demonstrate as a result of successfully completing the course.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tWithin the online course, course objectives or competencies are present, explicitly stated, measurable, and can be easily found by learners. After reading the list of objectives or competencies, learners will understand what they will be learning throughout the course.\n\nCourse-level learning objectives or competencies are typically provided to learners in a course syllabus and/or at the beginning of a course and establish the basis upon which online instructional units or modules are organized and aligned.\n\nEXAMPLES\tThe following are some examples of measurable course-level objectives or competencies:\n\n1. I can select appropriate mathematical operations for problem solving. \n2. The learner will be able to develop a personalized plan for success which integrates academic integrity, setting goals, and managing time. \n3. You will be able to articulate personal attitudes around risk and its relationship to high risk situations on the road. \n4. I can collaborate on a group project on the Solar System by completing designated tasks and offering feedback to team members on their tasks."]
            }
        },
        {
            "competencyText": {"en-us": "The online course expectations are consistent with course-level objectives or competencies, are representative of the structure of the course, and are clearly stated."},
            "comment": {
                "en-us": ["EXPLANATIONS\tLearners are introduced to the purpose and structure of the course. Course expectations are consistent with course objectives or competencies, are representative of the scope of the course, and are clearly stated.\n\nEXAMPLES\tDetailed expectations for class participation and/or any other specific expectations the instructor may have for learners are provided within the online course. Learner expectations of the instructor should also be specified.\n\nCourse policies regarding attendance, absences, late submissions, feedback, response time, revisions, exams, etc. are detailed.\n\nLearners are told at the course start that they will be expected to complete all readings and assignments, participate in weekly online discussions with the other learners and the instructor, submit a semester project detailed in the project description, and participate in multiple peer-re view activities."]
            }
        },
        {
            "competencyText": {"en-us": "The online course content is aligned with accepted state and/or other accepted content standards, where applicable.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tWhere state standards and/or other accepted content standards exist for the subject area of the course, those standards must be identified and accurately represented in the content and objectives of the course.\n\nIf an elective course is not meant to meet every standard, it should be aligned to those standards relevant to the course.\n\nThe content and assignments for the core courses are explicitly and thoroughly aligned to the state’s academic standards, curriculum framework, assessments, or currency. Advanced Placement® courses must be approved by the College Board, and other elective courses should be aligned to other nationally accepted content standards such as computer science, technology courses, etc.\n\nEXAMPLES\tAP Environmental Science is aligned to the AP College Board standards.\n\nEnvironmental Science is aligned to the state standards."]
            }
        },
        {
            "competencyText": {"en-us": "Digital literacy and communication skills are incorporated and taught as an integral part of the curriculum.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tDigital literacy and communication skills are an integrated, instructional component of the curriculum.\n\nDigital literacy refers to the ability to effectively and responsibly locate, evaluate, create, and communicate knowledge using technology.\n\nLinks to support as well as sample assignments are included either within task instructions or an appendix.\n\nLearners are provided with clear and specific expectations for all types of communications and interactions during the online course. Expectations for all online communications should include guidelines on appropriate online behavior in all academic and nonacademic interactions, including peer interactions, as well as interactions with the instructor in both synchronous and asynchronous environments.\n\nEXAMPLES\tGuidelines and rules of conduct for participating in discussion boards, which are introduced within the course overview, are referenced from discussion activity details.\n\nDigital communication skills are emphasized and measured in rubrics and grading."]
            }
        },
        {
            "competencyText": {"en-us": "Supplemental learning resources and related instructional materials are available to support and enrich learning and are aligned to the specific content being delivered.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tLearners have access to online academic help resources and optional additional materials to pursue areas of course content more deeply or to branch into related areas that might be of interest.\n\nCourse instructions articulate or link to academic support services and resources that can help learners in the course. Learners also have access to resources that enrich the course content.\n\nThese resources are made available within the online course from where they are most needed or helpful.\n\nEXAMPLES\tLearners have access to a virtual library of resources from the home page. Course activities may have links to the library when learners are expected or may need to do additional research for an assignment.\n\nAcademic support services, such as tutoring, are available, and supplemental learning resources and related instructional and technical materials are available to support and enrich the online learning experience.\n\nA list of prerequisite knowledge and skills for the online course are provided in the course information and syllabus materials along with links to resources for sharpening these skills if needed."]
            }
        },
        {
            "competencyText": {"en-us": "The online course content and supporting materials reflect a culturally diverse perspective that is free of bias.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe online course content (including readings, images, assignments, etc.) reflects a predominantly multicultural or bias-free approach. In some courses, it may not be possible or appropriate to take a multicultural or bias-free approach.\n\nThe course invites multiple perspectives and reflects an understanding of the perspectives of diverse ethnic groups.\n\nEXAMPLES\tThe course includes a diverse and balanced choice of images and other forms of media.\n\nImages and other forms of media in the course reflect a variety of ethnicity, body styles, gender, socioeconomic status, and ability."]
            }
        },
        {
            "competencyText": {"en-us": "The online course materials (e.g., textbooks, primary source documents, OER) that support course content standards are accurate and current."},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe online course materials are accurate and valid and represent up-to-date thinking and practice in the discipline.\n\nEXAMPLES\tThe AP textbook used is a current edition and one of the recommended texts of The College Board.\n\nInstructor-created content reflects current industry practices in the content area.\n\nLinks to external content are checked regularly to ensure access and consistency."]
            }
        },
        {
            "competencyText": {"en-us": "The online course is free of adult content and avoids unnecessary advertisements.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe course does not expose learners to adult content, developmentally inappropriate content, or unnecessary advertisements.\n\nEXAMPLES\tThe course links, materials, and resources do not expose learners to unnecessary advertisements.\n\nThe course does not expose learners to pornographic material and subject matter containing content unfit for the age level of the typical learner in the course."]
            }
        },
        {
            "competencyText": {"en-us": "Copyright and licensing status for any third-party content is appropriately cited and easily found."},
            "comment": {
                "en-us": ["EXPLANATIONS\tAll instructional materials (including media such as pictures and video) used in the course are appropriately cited, including permission to share where applicable. Guidance for learner content use, downloading, and sharing is also included.\n\nInstruction models appropriate source citation following the conventions of an appropriate style guide (MLA, APA, Chicago, etc.).\n\nEXAMPLES\tCopyright information, including Creative Commons licensing, can be included on each course page, at the end of each module, or in a document that includes all citations for the entire course."]
            }
        },
        {
            "competencyText": {"en-us": "Documentation and other support materials are available to support effective online course facilitation.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe instructor has access to resources to promote effective course facilitation.\n\nAssessment and assignment answers are provided to instructors so that they can provide timely feedback to learners and increase mastery of content and concepts and support instructional capacity.\n\nGuidance is provided regarding opportunities for appropriate instructor-learner interaction, including opportunities for regular feedback about learner progress and discussion prompts for critical thinking.\n\nEXAMPLES\tLinks to documentation, screencasts, instructor orientations, and/or other materials explaining how to most efficiently and effectively use the grading system within the online environment are clearly displayed in the instructor’s course view.\n\nTemplates and answer keys for assignments and assessments are provided the instructor."]
            }
        },
        {
            "competencyText": {"en-us": "The online course design includes activities that guide learners toward promoting ownership of their learning and self-monitoring."},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe course design includes opportunities for learners to engage with content through research, collaboration, discussion, and application. Rather than being passive receivers of information, learners are able to participate in the discovery process of their learning.\n\nEXAMPLES\tThe course design includes web-based content, which allows learner choice of learning pathway, and self assessment tools that provide feedback and motivation to continue learning evidenced through efforts made to actively engage with course content.\n\nLearners take ownership of their learning through progress trackers and learning-target trackers that provide learners with information and feedback that they need for the next level of proficiency."]
            }
        },
        {
            "competencyText": {"en-us": "The online course’s content and learning activities promote the achievement of the stated learning objectives or competencies."},
            "comment": {
                "en-us": ["EXPLANATIONS\tAlignment is clear between the learning activities and objectives within a course resulting in learner’s achievement.\n\nAssignments are meaningful, rigorous, and relevant. They contain appropriate levels of Depth of Knowledge (DOK) in order to ensure learners can meet the learning objectives or competencies in the course.\n\nEXAMPLES\tLearning activities are chosen in order to align with the learning objectives to reinforce what is intended for learners to learn. Based on content area and what is being learned, activities chosen may include simulations, reading, presentations, labs, case studies, etc. For instance, if a learner is asked to learn about a well-known historical event and understand that there are various versions of the event based on different stakeholders that were involved, the learner might consider sharing his or her learning through a play that he or she writes and casts character roles based on the various perspectives."]
            }
        },
        {
            "competencyText": {"en-us": "The online course is organized by units and lessons that fall into a logical sequence."},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe course is organized into a logical sequence, with a consistent presentation of both the modules/units and the lessons and content within each module.\n\nEXAMPLES\tAt the start of each module/unit, an overview is posted describing the activities, assignments, assessments, and resources to be used and completed, and how they relate to the learning objectives for the module/unit."]
            }
        },
        {
            "competencyText": {"en-us": "The online course content is appropriate to the reading level of the intended learners.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe text used in the course largely matches the desired level. Where the text used is more complex than appropriate for the target audience, scaffolding techniques are used to make text accessible to learners.\n\nEXAMPLES\tA design team/subject matter expert identifies the grade level of the intended online course and a target level of quantitative text complexity.\n\nThe online course content is appropriate to the reading level required by content and grade and depth of knowledge. Accommodations should be made available to assist learners with the under standing associated with the reading level."]
            }
        },
        {
            "competencyText": {"en-us": "The online course design includes introductory assignments or activities to engage learners within the first week of the course."},
            "comment": {
                "en-us": ["EXPLANATIONS\tIt is important for learners to engage with the course early and establish a relationship with their instructor to help ensure that learners are progressing adequately through the course. Introductory assignments allow the instructor to recognize whether or not a learner is able to get started in the course. This will allow the instructor to see whether additional help is needed to ensure the learner gets off to a good start. In some cases, submitting an introductory assignment helps with accountability and accurate learner enrollment counts.\n\nEXAMPLES\tA course orientation requires learners to learn how to engage with the course and complete assignments/activities.\n\nLearners introduce themselves to their instructor or peers in a discussion assignment.\n\nLearners are required to complete and submit introductory assignments or assessments within the first few lessons."]
            }
        },
        {
            "competencyText": {"en-us": "The online course provides learners with multiple learning paths as appropriate, based on learner needs, that engage learners in a variety of ways."},
            "comment": {
                "en-us": ["EXPLANATIONS\tEngaging learners, especially in an online course, can be challenging at times and is often one of the first areas of struggle reported by an online instructor, whether new or seasoned or somewhere in between. A course that is designed to provide learners with multiple ways of expressing their knowledge throughout the course, allowing for learner voice and choice, engages learners.\n\nEXAMPLES\tThe course design incorporates assignments in the form of video and audio uploads for a variety of expressions of the students’ learning.\n\nInstructors provide differentiated instruction to meet learners’ individualized instructional needs.\n\nInstructional design represents best practice in online learning and industry-standard tools for engaging learners. Assignments and assessments reflect learner voice and choice and demonstrate 21st century skills of communication and collaboration.\n\nUniversal Design for Learning (UDL), a framework based on how people learn is used to design engaging activities that address learner variability."]
            }
        },
        {
            "competencyText": {"en-us": "The online course provides regular opportunities for learner-learner interaction."},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe requirements for learner interaction are clearly stated and substantial.\n\nLearning activities are developed to foster regular learner-learner interaction. The instructional design and course content encourage exchanges amongst the learners through discussion boards, synchronous chats, and/or other communication tools.\n\nLearner agency in question and hypothesis generation, discussions, and the exchange of ideas is essential to learning. Thus, learners should have access to discussion boards to participate both in instructor-directed activities and learner-initiated discussions.\n\nIn some courses, learner-learner interaction may not be appropriate, such as, for example, a credit-recovery course and where learners are working at their own pace.\n\nEXAMPLES\tThreaded discussions are available for developing community, asking and finding answers to questions, and commenting on the content. Rules and expectations for the discussion are clear and posted within the course.\n\nLearners are required to respond to a discussion prompt, which directs them to write at least three sentences addressing the prompt, and provide a thoughtful response (at least one sentence) to at least two of their classmates’ answers."]
            }
        },
        {
            "competencyText": {"en-us": "The online course design provides opportunities for learner-instructor interaction, including opportunities for regular feedback about learner progress.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tInteractions between the learner and instructor are designed to enhance learners’ understanding and mastery of the learning objectives.\n\nEXAMPLES\tLearners submit an assignment or project for instructor feedback. Instructors monitor a frequently-asked-questions (FAQ) discussion forum.\n\nLearners engage in frequent conversation with their instructor utilizing synchronous and/or asynchronous tools such as e-journals, emails, text, discussion boards, and teleconferencing."]
            }
        },
        {
            "competencyText": {"en-us": "Online course instructional materials and resources present content in an effective, engaging, and appropriate manner.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tOnline course materials and resources are appropriate, relevant, and accessible to diverse learners and convey online course content in an effective and engaging manner to support learner mastery of course content and concepts.\n\nThe online course materials contribute to the achievement of the stated course and module/ unit-level learning objectives or competencies, and their relationship with learning objectives or competencies is clearly stated.\n\nThe course content and instructional materials are of appropriate cognitive rigor (Depth of Knowledge & Bloom’s taxonomy), scaffolding, and range to support the learning goals.\n\nEXAMPLES\tTo meet the objective “Learners will write a five paragraph argumentative essay,” materials are scaffolded to walk learners through the process over a series of assignments that progress from more basic to more complex skills.\n\nA closed-captioned, 3-minute video illustrating cell mitosis is employed to show the process in a unit on cell biology within the context of genetics.\n\nImages of paintings by Van Gogh, da Vinci, and Rembrandt are used to illustrate the painting techniques they used: impasto, sfumato, and chiaroscuro. (Images are alt-tagged and narratively described for diverse learners.)"]
            }
        },
        {
            "competencyText": {"en-us": "Learner assessments are linked to stated course, unit, or lesson-level objectives or competencies"},
            "comment": {
                "en-us": [
                    "EXPLANATIONS\tA clear link between the assessment and the stated goals of the online course is established.\n\nEXAMPLES\tFor an objective or competency where learners are told they need to learn how to identify metaphors in poems, an assessment would present a poem with metaphors and require learners to identify the metaphors therein. The assessment would NOT require the learner to define the term “metaphor,” to write their own metaphor, or to explain the meaning of a metaphor for that objective or competency",
                    " although these are helpful tasks, they are not linked to the stated objective or competency."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Valid course assessments measure learner progress toward mastery of content."},
            "comment": {
                "en-us": ["EXPLANATIONS\tFrequent formative assessments measure progress towards mastery of content (as measured by summative assessments). Learners at all learning levels are given the opportunity to demonstrate progress in acquiring major content ideas.\n\nEXAMPLES\tThe online course includes a visible path of formative and summative assessments measuring learner progress toward mastery of content within the course objectives.\n\nLearners are tasked to demonstrate understandings of the immediate major effects of the Great Depression on American politics in the 1930s and 1940s. Multiple formative assessments, such as learning checks, reflections, or short quizzes, are included in the course to measure progress toward mastery as well as a summative assessment to measure mastery. Formative assessments incorporate self-assessments as well as instructor-led assessments."]
            }
        },
        {
            "competencyText": {"en-us": "Assessment practices provide routine and varied opportunities for self-monitoring and reflection of learning.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tAssessment strategies provide learners with opportunities to reflect on their progress towards meeting course requirements and mastering learning objectives or competencies.\n\nEXAMPLES\tWriting assignments that allow for the submission of a draft for instructor comments and suggestions for improvement.\n\nThe course includes formative assessments, which provide clear feedback for each answer choice.\n\nLearners engage with interactive games and simulations that have feedback built in.\n\nSelf-scoring practice quizzes.\n\nPeer reviews.\n\nExample papers or essays provided for learner viewing."]
            }
        },
        {
            "competencyText": {"en-us": "Assessment materials provide the learner with the flexibility to demonstrate mastery in a variety of ways.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tMultiple methods of assessment strategies are included, based on the specified learning objective or competencies and learner need.\n\nEach assessment does not have to have multiple methods, but over the entire course there are multiple methods of assessments used.\n\nIn addition, alternative assessments should be open to all learners when appropriate. Alternative assessment strategies may be more appropriate for some subjects and competency types (e.g., knowledge) than others (e.g., CTE skills). In some cases an authentic assessment strategy may be the only reliable way to measure skill mastery.\n\nEXAMPLES\tA U.S. History course provides learners with choice and flexibility in demonstrating their application of content knowledge, including oral reports, videos, computer presentations, group posters, musical projects, etc. These may be chosen at the time of assessment or as a second choice option for revisions, as provided by the instructor.\n\nLearners have an opportunity to correct errors and receive feedback on their level of proficiency. Learners may demonstrate mastery of any content using varying assessment strategies."]
            }
        },
        {
            "competencyText": {"en-us": "Rubrics that clearly define expectations for varied levels of proficiency are created and shared with learners.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tSpecific and descriptive criteria are provided for the evaluation of learners’ work and assist the instructor in determining the level of achievement of learning objectives and competencies.\n\nRubrics allow learners and instructors to understand expectations for varied levels of proficiency. Rubrics might be created by instructors as well as course designers, but course designers should create space for rubrics and add templates in accordance with the norms of the school.\n\nRubrics clearly define expectations by being linked to learning objectives and current state and/or other accepted content standards.\n\nEXAMPLES\tExamples: Learners must demonstrate their knowledge of the immediate political outcomes of WWII. The provided rubric allows for a variety of performance-based products, videos, papers, speeches, etc. Further, the provided rubric offers a rich description of key competencies for each type of performance-based product."]
            }
        },
        {
            "competencyText": {"en-us": "Online course navigation is logical, consistent, and efficient from the learner’s point of view.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tNavigation refers to the process of planning, controlling, and recording the movement of a learner from one place to another in the online course.\n\nNavigation throughout the course is consistent, logical, and efficient and facilitates ease of use.\n\nEXAMPLES\tConsistent layout and design are employed throughout, making content, instructional materials, tools, and media easy to locate from anywhere in the course. Design elements are used consistently, increasing predictability and intuitiveness.\n\nOnline course pages have links that are consistently labeled with easy-to-understand, self-describing, and meaningful names (for example, the text “National Standards for Quality Online Learning website” is the hyperlink rather than www.nsqol.org. Icons used as links also have a text alternative that describes the function of the icon or an accompanying text link.\n\nThe course design enables learners to easily locate where they are within the course and to easily return to the homepage from any location.\n\nThe hierarchy of material in a page or document is clearly indicated through heading styles (Heading 1, Heading 2, etc.). A table of contents is included that allows learners to move easily throughout documents."]
            }
        },
        {
            "competencyText": {"en-us": "The online course design facilitates readability.*"},
            "comment": {
                "en-us": [
                    "EXPLANATIONS\tOnline course design elements maximize usability by facilitating readability and minimizing distractions.\n\nFor information pertaining to the reading level of course content, see Indicator C4.\n\nEXAMPLES\tContent is formatted to serve specific instructional purposes. For example, format and text color are used purposefully to communicate key points, group like items, and emphasize relevant relationships. Color alone is not used to convey meaning, and sensory characteristics (size, shape, location) are not required for understanding directions.\n\nSimilar content is grouped together",
                    " headings are used to indicate change of topic.\n\nHeading and body styles are consistent throughout the course and follow a logical structure.\n\nWhite space or negative space is used around content to help increase comprehension and reduce eye fatigue that occurs with large blocks of text or use of many images."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The online course provides accessible course materials and activities to meet the needs of diverse learners.*"},
            "comment": {
                "en-us": [
                    "EXPLANATIONS\tAll online course content (text and images, documents, LMS pages, web pages, media, etc.) used in the course are accessible to all learners, or an equitable alternative is available. The international Web Content Accessibility Guidelines (WCAG) provide additional guidance for achieving accessibility.\n\nAchieving accessibility means that individuals with sensory, physical, cognitive, or learning disabilities can independently acquire the same information, engage in the same interactions, and enjoy the same learning experiences, with substantially equivalent ease of use as individuals without disabilities. Alternative content is “equally effective,” which means that the same information is as readily available as the original content.\n\nEXAMPLES\tImages and graphs are described via alternative text, long description, or audio description.\n\nAll tables are set up as text and not embedded as images.\n\nTables are set up with headings for columns and rows and are used only for summarizing data, not for formatting.\n\nDocument or HTML titles, headings, etc. are formatted using styles (Heading 1, Heading 2, etc.) found in the word processing software (such as Word) style gallery",
                    " they do not merely utilize a larger or bold or italic font.\n\nPDFs that contain text are not merely image scans",
                    " any text contained in PDFs is selectable and searchable.\n\nIf the audio content corresponds with the visual content in a way that conveys meaning (e.g., a video demonstrating how to operate a Bunsen burner in a chemistry lab), captions provide an equivalent experience.\n\nVisual information that is critical to meaning is conveyed through audio description."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Course multimedia facilitate ease of use.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tMultimedia used as a vehicle for content or feedback (e.g., images, audio, animation, video, and interactive components) are easy to use, intelligible, and interoperable across devices.\n\nEXAMPLES\tGraphics and animations are used to enhance instructional materials and illustrate ideas without causing distractions.\n\nImages are appropriately sized and can be viewed in their entirety without scrolling.\n\nAudio quality is clear."]
            }
        },
        {
            "competencyText": {"en-us": "Vendor accessibility statements are provided for all technologies required in the course.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tLearners have access to information on the accessibility of the learning management system and all additional required technologies and content.\n\nCourse tools and materials link to the vendor’s accessibility statement or vendor-provided details through a Voluntary Product Accessibility Template (VPAT).\n\nEXAMPLES\tA vendor’s accessibility statement is provided in the course syllabus or a page on resources or required technology software.\n\nA district manages a web page that includes anchored links to the accessibility statements for technologies used in the course, including the learning management system, any integrated third-party software (e.g., plagiarism-detection software), and polling and social media tools."]
            }
        },
        {
            "competencyText": {"en-us": "Educational tools ensure learner privacy and maintain confidentiality of learner information in accordance with local, state, and national laws for learner data."},
            "comment": {
                "en-us": ["EXPLANATIONS\tAll technologies and tools included for use as part of the course ensure that learner privacy is protected in accordance with Acceptable Use Policy and applicable law.\n\nEXAMPLES\tOnline course tools and technologies chosen, whether included in the learning platform or external to the learning platform, comply with applicable state and relevant U.S. child protection laws such as the following (if outside of the U.S., consult relevant national law):\n\n* The Children’s Internet Protection Act (CIPA)\n* The Family Educational Rights and Privacy Act (FERPA)\n* The Children’s Online Privacy Protection Act (COPPA)"]
            }
        },
        {
            "competencyText": {"en-us": "The online course tools support the learning objectives or competencies.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tClear information and instructions are provided regarding how the tools support the learning objectives or competencies. Tools are not used simply for their own sake.\n\nEXAMPLES\tAn online course that requires posting to a discussion forum makes it clear how the discussions support a learning objective or competency."]
            }
        },
        {
            "competencyText": {"en-us": "The online course provides options for the instructor to adapt learning activities to accommodate learners’ needs and preferences.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe online course permits the instructor to add and/or revise course content, activities, and assessments to modify or extend learning opportunities as appropriate.\n\nEXAMPLES\tThe online course allows the instructor to select, add, sequence, and modify the assessments and content provided.\n\nThe online course has the capability for the instructor to upload documents and links and add text and commentary to course pages."]
            }
        },
        {
            "competencyText": {"en-us": "The course allows instructors to control the release of content.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe system in which the online course is presented allows the instructor to adapt the release of content and make content available to users as needed or as indicated by a calendar or pacing guide.\n\nEXAMPLES\tA course allows instructors the capability to select or hide particular lessons or modules, re-order the sequence of lessons, provide timed release of content, and select among provided activities, exercises, etc."]
            }
        },
        {
            "competencyText": {"en-us": "The course provides the necessary technical functionality to score and record assessments and calculate earned course points or grades.*"},
            "comment": {
                "en-us": ["EXPLANATIONS\tIn online courses where assessments are designed to interact with an online gradebook, the publisher must provide the necessary technical integrations that allow assessment results to be automatically recorded in the gradebook.\n\nIf a gradebook is provided, it should be a flexible tool, providing functions beyond the recording of individual scores on assignments.\n\nEXAMPLES\tThe gradebook provided within the course allows an instructor to manage the class roster, assign weights to assignments, examine specific individual learner assignments or quiz results, and import and export scores/grades.\n\nThe gradebook allows for generation of scores/grades by learning objective.\n\nTechnical functionality within a course allows for analysis of grading patterns – statistics, charts and graphs – by course, learning objective, etc., in addition to statistical analysis of performance on individual questions or unit learning objectives – mean, median, percentile, standard deviation, etc."]
            }
        },
        {
            "competencyText": {"en-us": "The online course uses multiple methods and sources of input for assessing course effectiveness."},
            "comment": {
                "en-us": ["EXPLANATIONS\tA combination of learner, instructor, content experts, instructional designer, and outside reviewers may be used to evaluate the course for effectiveness. A variety of methods may be used, including online course evaluations, learner completion rates, satisfaction surveys, peer review, instructor and learner feedback, content and learning analytics, and learner performance on in-course as well as state or national assessments. External researchers or evaluators are considered to study the effectiveness of the course.\n\nEXAMPLES\tThe online course is evaluated through a documented process on a set schedule, ensuring all courses are evaluated on a regular cycle. The evaluation process includes analysis of learner surveys, learner performance, and peer review."]
            }
        },
        {
            "competencyText": {"en-us": "The online course is reviewed to ensure that the course is current."},
            "comment": {
                "en-us": ["EXPLANATIONS\tReview and revise the online course to ensure quality, integrity, and that the content is current, including assessment. The frequency and level of review should be established as a policy of the course provider (school, district, state, or national).\n\nEXAMPLES\tThe online course review process and cycle are shared publicly. Online courses should be reviewed on a regular cycle to keep the content current, engaging, and relevant."]
            }
        },
        {
            "competencyText": {"en-us": "The online course is updated on a continuous improvement cycle for effectiveness based on the findings from ongoing reviews."},
            "comment": {
                "en-us": ["EXPLANATIONS\tThe provider indicates the frequency of online course evaluations, whether reviews are conducted internally or externally, and how the provider uses evaluation results to improve courses.\n\nEXAMPLES\tBuilt into the evaluation process for online courses, the provider cites improvements in the online course based on the latest research-supported best practices."]
            }
        }
    ]
}