{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://www.cpalms.org/Public/ims/case/v1p0/CFDocuments/46a98ac7-8878-4212-a321-94b9890bca02.json",
        "name": {"en-us": "CTE-Architecture and Construction"},
        "description": {"en-us": "CTE-Architecture and Construction Standards"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "Grade 6-8"}
        },
        {
            "competencyText": {"en-us": "Construction"}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Define and use proper terminology associated with the construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Describe some of the careers available in the construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Identify common characteristics of the careers in the construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Research the history of the construction career pathway and describe how the careers have evolved and impacted society. "}
        },
        {
            "competencyText": {"en-us": "Identify skills required to successfully enter a career in the construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Describe technologies associated in careers within the construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Investigate careers and entry requirements within the construction pathway."}
        },
        {
            "competencyText": {"en-us": "Describe careers in the construction career pathway (e.g. managers - project managers, project engineers, estimators, superintendents; sub-contractors and tradespersons - carpenters, masons, electricians, plumbers, HVAC technicians; etc.)."}
        },
        {
            "competencyText": {"en-us": "Explain educational and training pathways available for careers in the construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Research and present information on a career in the construction career pathway including roles and responsibilities, opportunities for employment and the requirements for education and training."}
        },
        {
            "competencyText": {"en-us": "Plan the construction of a model or architectural detail from a set of plans."}
        },
        {
            "competencyText": {"en-us": "Calculate material quantities and costs."}
        },
        {
            "competencyText": {"en-us": "Determine the critical path as a progression of construction activities."}
        },
        {
            "competencyText": {"en-us": "Draw a bar chart depicting construction schedule."}
        },
        {
            "competencyText": {"en-us": "Construct a model or architectural detail from plans and specifications."}
        },
        {
            "competencyText": {"en-us": "Use appropriate tools while demonstrating safe work practices."}
        },
        {
            "competencyText": {"en-us": "Apply proper cutting and fastening techniques for basic model materials."}
        },
        {
            "competencyText": {"en-us": "Design/Pre-Construction"}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the design/pre-construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Define and use proper terminology associated with the design/pre-construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Describe some of the careers available in the design/pre-construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Identify common characteristics of the careers in the design/pre-construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Research the history of the design/pre-construction career pathway and describe how the associated careers have evolved and impacted society."}
        },
        {
            "competencyText": {"en-us": "Identify skills required to successfully enter any career in the design/pre-construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Describe technologies associated in careers within the design/pre-construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Investigate careers and entry requirements within the design/pre-construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Describe careers in the design/pre-construction career pathway (e.g. architects, interior designers, drafters, engineers - civil, MEP and structural, urban and regional planners, etc.)."}
        },
        {
            "competencyText": {"en-us": "Explain educational and training pathways necessary for careers in the design/pre-construction career pathway."}
        },
        {
            "competencyText": {"en-us": "Research and present information on a career in the design/pre-construction career pathway including roles and responsibilities, opportunities for employment and the requirements for education and training."}
        },
        {
            "competencyText": {"en-us": "Draw basic plans by hand."}
        },
        {
            "competencyText": {"en-us": "Draw plans and corresponding elevations, sections and details."}
        },
        {
            "competencyText": {"en-us": "Apply appropriate architectural scales to drawings."}
        },
        {
            "competencyText": {"en-us": "Apply basic building codes in drawings."}
        },
        {
            "competencyText": {"en-us": "Create door, window and finish schedules."}
        },
        {
            "competencyText": {"en-us": "Supplemental"}
        },
        {
            "competencyText": {"en-us": "Identify and explore careers in the Architecture & Construction cluster."}
        },
        {
            "competencyText": {"en-us": "Identify the pathways in the Architecture & Construction career cluster and the careers in each pathway."}
        },
        {
            "competencyText": {"en-us": "Describe the types of places that employ individuals who have careers in the Architecture & Construction career cluster."}
        },
        {
            "competencyText": {"en-us": "Describe the variety of tasks performed by individuals who have careers in the Architecture & Construction career cluster."}
        },
        {
            "competencyText": {"en-us": "List the skills, abilities, and talents needed for careers in the Architecture & Construction career cluster."}
        },
        {
            "competencyText": {"en-us": "Identify the level of training and education required for careers in the Architecture & Construction career cluster."}
        },
        {
            "competencyText": {"en-us": "Research a career in the Architecture & Construction career cluster and present findings to the class."}
        },
        {
            "competencyText": {"en-us": "Apply math, science, and reading skills in the completion of a project or activity related to the Architecture & Construction career cluster."}
        },
        {
            "competencyText": {"en-us": "Read and interpret basic construction documents and specifications."}
        },
        {
            "competencyText": {"en-us": "Name various types of drawings used in construction documents and explain their purpose."}
        },
        {
            "competencyText": {"en-us": "Locate sections, elevations and details indicated on the floor plan within the set of construction documents."}
        },
        {
            "competencyText": {"en-us": "Select and use appropriate architectural scales for various drawings."}
        },
        {
            "competencyText": {"en-us": "Identify various symbols and terminology used in construction documents."}
        },
        {
            "competencyText": {"en-us": "Read and interpret specifications."}
        },
        {
            "competencyText": {"en-us": "Explain the scope and purpose of building codes and regulations."}
        },
        {
            "competencyText": {"en-us": "Read civil, architectural and mechanical, electrical and plumbing (MEP) drawings."}
        },
        {
            "competencyText": {"en-us": "Locate civil plans within a construction documents set, identify defining features and state the importance of these plans."}
        },
        {
            "competencyText": {"en-us": "Locate architectural plans within a construction documents set, identify defining features and state the importance of these plans."}
        },
        {
            "competencyText": {"en-us": "Locate mechanical plans within a construction documents set, identify defining features and state the importance of these plans."}
        },
        {
            "competencyText": {"en-us": "Locate electrical plans within a construction documents set, identify defining features and state the importance of these plans."}
        },
        {
            "competencyText": {"en-us": "Locate plumbing plans within a construction documents set, identify defining features and state the importance of these plans."}
        },
        {
            "competencyText": {"en-us": "Name types of careers associated with the development of civil, architectural and mechanical, electrical and plumbing (MEP) drawings."}
        },
        {
            "competencyText": {"en-us": "Explain sustainability issues related to the design, construction and maintenance of the built environment."}
        },
        {
            "competencyText": {"en-us": "Describe the impact of the construction industry on the natural environment."}
        },
        {
            "competencyText": {"en-us": "Identify sustainable alternatives to conventional practices."}
        },
        {
            "competencyText": {"en-us": "Identify specific practices that can lessen adverse impacts on the environment."}
        },
        {
            "competencyText": {"en-us": "Maintenance/Operations"}
        },
        {
            "competencyText": {"en-us": "Demonstrate an understanding of the maintenance/operations career pathway."}
        },
        {
            "competencyText": {"en-us": "Define and use proper terminology associated with the maintenance/operations career pathway."}
        },
        {
            "competencyText": {"en-us": "Describe some of the careers available in the maintenance/operations career pathway."}
        },
        {
            "competencyText": {"en-us": "Identify common characteristics of the careers in the maintenance/operations career pathway."}
        },
        {
            "competencyText": {"en-us": "Research the history of the maintenance/operations career pathway and describe how the careers have evolved and impacted society."}
        },
        {
            "competencyText": {"en-us": "Identify skills required to successfully enter a career in the maintenance/operations career pathway."}
        },
        {
            "competencyText": {"en-us": "Describe technologies associated in careers within the maintenance/operations career pathway."}
        },
        {
            "competencyText": {"en-us": "Investigate careers and entry requirements within the maintenance/operations career pathway."}
        },
        {
            "competencyText": {"en-us": "Describe careers in the maintenance/operations career pathway (energy auditors; building inspectors; system installers - HVAC, telecommunications, security/fire, solar, etc.; maintenance technicians; hazardous materials removers; environmental engineers)."}
        },
        {
            "competencyText": {"en-us": "Explain educational and training pathways necessary for careers in the maintenance/operations career pathway."}
        },
        {
            "competencyText": {"en-us": "Research and present information on a career in the maintenance/operations career pathway including roles and responsibilities, opportunities for employment and the requirements for education and training."}
        },
        {
            "competencyText": {"en-us": "Analyze the impact of design decisions on building operations and maintenance."}
        },
        {
            "competencyText": {"en-us": "Compare life-cycle costs for various building materials and/or systems within the built environment."}
        },
        {
            "competencyText": {"en-us": "Explain maintenance procedures for specific products or materials."}
        }
    ]
}