{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://www.cpalms.org/Public/ims/case/v1p0/CFDocuments/25a98ac7-8878-4212-a321-94b9890bca02.json",
        "name": {"en-us": "Mathematics"},
        "description": {"en-us": "Mathematics Standards"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "Grade K-12"}
        },
        {
            "competencyText": {"en-us": "Mathematical Practice"}
        },
        {
            "competencyText": {"en-us": "Make sense of problems and persevere in solving them."}
        },
        {
            "competencyText": {"en-us": "<p><b>Make sense of problems and persevere in solving them. <\/b><\/p><p>Mathematically proficient students start by explaining to themselves the meaning of a problem and looking for entry points to its solution. They analyze givens, constraints, relationships, and goals. They make conjectures about the form and meaning of the solution and plan a solution pathway rather than simply jumping into a solution attempt. They consider analogous problems, and try special cases and simpler forms of the original problem in order to gain insight into its solution. They monitor and evaluate their progress and change course if necessary. Older students might, depending on the context of the problem, transform algebraic expressions or change the viewing window on their graphing calculator to get the information they need. Mathematically proficient students can explain correspondences between equations, verbal descriptions, tables, and graphs or draw diagrams of important features and relationships, graph data, and search for regularity or trends. Younger students might rely on using concrete objects or pictures to help conceptualize and solve a problem. Mathematically proficient students check their answers to problems using a different method, and they continually ask themselves, &ldquo;Does this make sense?&rdquo; They can understand the approaches of others to solving complex problems and identify correspondences between different approaches.<\/p>"}
        },
        {
            "competencyText": {"en-us": "Reason abstractly and quantitatively."}
        },
        {
            "competencyText": {"en-us": "<p><b>Reason abstractly and quantitatively<\/b>.\r\n\r\n<\/p><p>Mathematically proficient students make sense of quantities and their relationships in problem situations. They bring two complementary abilities to bear on problems involving quantitative relationships: the ability to decontextualize&mdash;to abstract a given situation and represent it symbolically and manipulate the representing symbols as if they have a life of their own, without necessarily attending to their referents&mdash;and the ability to contextualize, to pause as needed during the manipulation process in order to probe into the referents for the symbols involved. Quantitative reasoning entails habits of creating a coherent representation of the problem at hand; considering the units involved; attending to the meaning of quantities, not just how to compute them; and knowing and flexibly using different properties of operations and objects.<\/p>"}
        },
        {
            "competencyText": {"en-us": "Construct viable arguments and critique the reasoning of others."}
        },
        {
            "competencyText": {"en-us": "<p><b>Construct viable arguments and critique the reasoning of others.\r\n\r\n<\/b><\/p><p>Mathematically proficient students understand and use stated assumptions, definitions, and previously established results in constructing arguments. They make conjectures and build a logical progression of statements to explore the truth of their conjectures. They are able to analyze situations by breaking them into cases, and can recognize and use counterexamples. They justify their conclusions, communicate them to others, and respond to the arguments of others. They reason inductively about data, making plausible arguments that take into account the context from which the data arose. Mathematically proficient students are also able to compare the effectiveness of two plausible arguments, distinguish correct logic or reasoning from that which is flawed, and&mdash;if there is a flaw in an argument&mdash;explain what it is. Elementary students can construct arguments using concrete referents such as objects, drawings, diagrams, and actions. Such arguments can make sense and be correct, even though they are not generalized or made formal until later grades. Later, students learn to determine domains to which an argument applies. Students at all grades can listen or read the arguments of others, decide whether they make sense, and ask useful questions to clarify or improve the arguments.<\/p>"}
        },
        {
            "competencyText": {"en-us": "Model with mathematics."}
        },
        {
            "competencyText": {"en-us": "<p><b>Model with mathematics.<\/b>\r\n\r\n<\/p><p>Mathematically proficient students can apply the mathematics they know to solve problems arising in everyday life, society, and the workplace. In early grades, this might be as simple as writing an addition equation to describe a situation. In middle grades, a student might apply proportional reasoning to plan a school event or analyze a problem in the community. By high school, a student might use geometry to solve a design problem or use a function to describe how one quantity of interest depends on another. Mathematically proficient students who can apply what they know are comfortable making assumptions and approximations to simplify a complicated situation, realizing that these may need revision later. They are able to identify important quantities in a practical situation and map their relationships using such tools as diagrams, two-way tables, graphs, flowcharts and formulas. They can analyze those relationships mathematically to draw conclusions. They routinely interpret their mathematical results in the context of the situation and reflect on whether the results make sense, possibly improving the model if it has not served its purpose.<\/p>"}
        },
        {
            "competencyText": {"en-us": "Use appropriate tools strategically."}
        },
        {
            "competencyText": {"en-us": "<b>Use appropriate tools strategically.    <\/b><br><br><span>Mathematically proficient students consider the available tools when solving a mathematical problem. These tools might include pencil and paper, concrete models, a ruler, a protractor, a calculator, a spreadsheet, a computer algebra system, a statistical package, or dynamic geometry software. Proficient students are sufficiently familiar with tools appropriate for their grade or course to make sound decisions about when each of these tools might be helpful, recognizing both the insight to be gained and their limitations. For example, mathematically proficient high school students analyze graphs of functions and solutions generated using a graphing calculator. They detect possible errors by strategically using estimation and other mathematical knowledge. When making mathematical models, they know that technology can enable them to visualize the results of varying assumptions, explore consequences, and compare predictions with data. Mathematically proficient students at various grade levels are able to identify relevant external mathematical resources, such as digital content located on a website, and use them to pose or solve problems. They are able to use technological tools to explore and deepen their understanding of concepts.<br>"}
        },
        {
            "competencyText": {"en-us": "Attend to precision."}
        },
        {
            "competencyText": {"en-us": "<p><b>Attend to precision.\r\n\r\n<\/b><\/p><p>Mathematically proficient students try to communicate precisely to others. They try to use clear definitions in discussion with others and in their own reasoning. They state the meaning of the symbols they choose, including using the equal sign consistently and appropriately. They are careful about specifying units of measure, and labeling axes to clarify the correspondence with quantities in a problem. They calculate accurately and efficiently, express numerical answers with a degree of precision appropriate for the problem context. In the elementary grades, students give carefully formulated explanations to each other. By the time they reach high school they have learned to examine claims and make explicit use of definitions. <\/p>"}
        },
        {
            "competencyText": {"en-us": "Look for and make use of structure."}
        },
        {
            "competencyText": {"en-us": "<p><b>Look for and make use of structure.\r\n\r\n<\/b><\/p><p>Mathematically proficient students look closely to discern a pattern or structure. Young students, for example, might notice that three and seven more is the same amount as seven and three more, or they may sort a collection of shapes according to how many sides the shapes have. Later, students will see 7 &times; 8 equals the well remembered 7 &times; 5 + 7 &times; 3, in preparation for learning about the distributive property. In the expression x&sup2; + 9x + 14, older students can see the 14 as 2 &times; 7 and the 9 as 2 + 7. They recognize the significance of an existing line in a geometric figure and can use the strategy of drawing an auxiliary line for solving problems. They also can step back for an overview and shift perspective. They can see complicated things, such as some algebraic expressions, as single objects or as being composed of several objects. For example, they can see 5 &ndash; 3(x &ndash; y)&sup2; as 5 minus a positive number times a square and use that to realize that its value cannot be more than 5 for any real numbers x and y.<\/p>"}
        },
        {
            "competencyText": {"en-us": "Look for and express regularity in repeated reasoning."}
        },
        {
            "competencyText": {"en-us": "<p><b>Look for and express regularity in repeated reasoning. <\/b><\/p><p>Mathematically proficient students notice if calculations are repeated, and look both for general methods and for shortcuts. Upper elementary students might notice when dividing 25 by 11 that they are repeating the same calculations over and over again, and conclude they have a repeating decimal. By paying attention to the calculation of slope as they repeatedly check whether points are on the line through (1, 2) with slope 3, middle school students might abstract the equation (y &ndash; 2)/(x &ndash; 1) = 3. Noticing the regularity in the way terms cancel when expanding (x &ndash; 1)(x + 1), (x &ndash; 1)(x&sup2; + x + 1), and (x &ndash; 1)(x&sup3; + x&sup2; + x + 1) might lead them to the general formula for the sum of a geometric series. As they work to solve a problem, mathematically proficient students maintain oversight of the process, while attending to the details. They continually evaluate the reasonableness of their intermediate results.<\/p>"}
        },
        {
            "competencyText": {"en-us": "Kindergarten"}
        },
        {
            "competencyText": {"en-us": "Counting and Cardinality"}
        },
        {
            "competencyText": {"en-us": "Know number names and the count sequence. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Count to 100 by ones and by tens."}
        },
        {
            "competencyText": {"en-us": "Count forward beginning from a given number within the known sequence (instead of having to begin at 1)."}
        },
        {
            "competencyText": {"en-us": "Read and write numerals from 0 to 20. Represent a number of objects with a written numeral 0&ndash;20 (with 0 representing a count of no objects)."}
        },
        {
            "competencyText": {"en-us": "Count to tell the number of objects. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand the relationship between numbers and quantities; connect counting to cardinality.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>When counting objects, say the number names in the standard order, pairing each object with one and only one number name and each number name with one and only one object.<\/li><li>Understand that the last number name said tells the number of objects counted. The number of objects is the same regardless of their arrangement or the order in which they were counted.<\/li><li>Understand that each successive number name refers to a quantity that is one larger.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Count to answer &ldquo;how many?&rdquo; questions about as many as 20 things arranged in a line, a rectangular array, or a circle, or as many as 10 things in a scattered configuration; given a number from 1&ndash;20, count out that many objects."}
        },
        {
            "competencyText": {"en-us": "Compare numbers. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Identify whether the number of objects in one group is greater than, less than, or equal to the number of objects in another group, e.g., by using matching and counting strategies."}
        },
        {
            "competencyText": {"en-us": "Compare two numbers between 1 and 10 presented as written numerals."}
        },
        {
            "competencyText": {"en-us": "Operations and Algebraic Thinking"}
        },
        {
            "competencyText": {"en-us": "Understand addition as putting together and adding to, and understand subtraction as taking apart and taking from. (Major Cluster) "}
        },
        {
            "competencyText": {"en-us": "Represent addition and subtraction with objects, fingers, mental images, drawings, sounds (e.g., claps), acting out situations, verbal explanations, expressions, or equations."}
        },
        {
            "competencyText": {"en-us": "Solve addition and subtraction word problems<sup>1<\/sup>, and add and subtract within 10, e.g., by using objects or drawings to represent the problem (<sup>1<\/sup>Students are not required to independently read the word problems.)"}
        },
        {
            "competencyText": {"en-us": "For any number from 1 to 9, find the number that makes 10 when added to the given number, e.g., by using objects or drawings, and record the answer with a drawing or equation."}
        },
        {
            "competencyText": {"en-us": "Fluently add and subtract within 5."}
        },
        {
            "competencyText": {"en-us": "Use addition and subtraction within 10 to solve word problems involving both addends unknown, e.g., by using objects, drawings, and equations with symbols for the unknown numbers to represent the problem. (Students are not required to independently read the word problems.)"}
        },
        {
            "competencyText": {"en-us": "Number and Operations in Base Ten"}
        },
        {
            "competencyText": {"en-us": "Work with numbers 11–19 to gain foundations for place value. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Compose and decompose numbers from 11 to 19 into ten ones and\r\nsome further ones, e.g., by using objects or drawings, and record each\r\ncomposition or decomposition by a drawing or equation (e.g., 18 = 10 +\r\n8); understand that these numbers are composed of ten ones and one,\r\ntwo, three, four, five, six, seven, eight, or nine ones."}
        },
        {
            "competencyText": {"en-us": "Measurement and Data"}
        },
        {
            "competencyText": {"en-us": "Describe and compare measurable attributes. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Describe measurable attributes of objects, such as length or weight.\r\nDescribe several measurable attributes of a single object."}
        },
        {
            "competencyText": {"en-us": "Directly compare two objects with a measurable attribute in common,\r\nto see which object has &ldquo;more of&rdquo;/&ldquo;less of&rdquo; the attribute, and describe\r\nthe difference. <i>For example, directly compare the heights of two\r\nchildren and describe one child as taller/shorter.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Express the length of an object as a whole number of length units, by laying multiple copies of a shorter object (the length unit) end to end; understand that the length measurement of an object is the number of same-size length units that span it with no gaps or overlaps. <em>Limit to contexts where the object being measured is spanned by a whole number of length units with no gaps or overlaps.<\/em>"}
        },
        {
            "competencyText": {"en-us": "Classify objects and count the number of objects in each category. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Classify objects into given categories; count the numbers of objects in\r\neach category and sort the categories by count."}
        },
        {
            "competencyText": {"en-us": "Geometry"}
        },
        {
            "competencyText": {"en-us": "Identify and describe shapes (squares, circles, triangles, rectangles, hexagons, cubes, cones, cylinders, and spheres). (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Describe objects in the environment using names of shapes, and\r\ndescribe the relative positions of these objects using terms such as<i>\r\nabove, below, beside, in front of, behind, and next to.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Correctly name shapes regardless of their orientations or overall size."}
        },
        {
            "competencyText": {"en-us": "Identify shapes as two-dimensional (lying in a plane, &ldquo;flat&rdquo;) or three-dimensional\r\n(&ldquo;solid&rdquo;)."}
        },
        {
            "competencyText": {"en-us": "Analyze, compare, create, and compose shapes. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Analyze and compare two- and three-dimensional shapes, in\r\ndifferent sizes and orientations, using informal language to describe\r\ntheir similarities, differences, parts (e.g., number of sides and\r\nvertices/&ldquo;corners&rdquo;) and other attributes (e.g., having sides of equal\r\nlength)."}
        },
        {
            "competencyText": {"en-us": "Model shapes in the world by building shapes from components (e.g.,\r\nsticks and clay balls) and drawing shapes."}
        },
        {
            "competencyText": {"en-us": "Compose simple shapes to form larger shapes.<i> For example, &ldquo;Can you\r\njoin these two triangles with full sides touching to make a rectangle?&rdquo; <br /><\/i>"}
        },
        {
            "competencyText": {"en-us": "Grade 1"}
        },
        {
            "competencyText": {"en-us": "Operations and Algebraic Thinking"}
        },
        {
            "competencyText": {"en-us": "Represent and solve problems involving addition and subtraction. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use addition and subtraction within 20 to solve word problems<sup>1<\/sup> involving situations of adding to, taking from, putting together, taking apart, and comparing, with unknowns in all positions, e.g., by using objects, drawings, and equations with a symbol for the unknown number to represent the problem (<sup>1<\/sup>Students are not required to independently read the word problems.)"}
        },
        {
            "competencyText": {"en-us": "Solve word problems that call for addition of three whole numbers\r\nwhose sum is less than or equal to 20, e.g., by using objects, drawings,\r\nand equations with a symbol for the unknown number to represent the\r\nproblem."}
        },
        {
            "competencyText": {"en-us": "Understand and apply properties of operations and the relationship between addition and subtraction. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Apply properties of operations as strategies to add and subtract.<i> Examples:\r\nIf 8 + 3 = 11 is known, then 3 + 8 = 11 is also known. (Commutative property of\r\naddition.) To add 2 + 6 + 4, the second two numbers can be added to make\r\na ten, so 2 + 6 + 4 = 2 + 10 = 12. (Associative property of addition.)<\/i>"}
        },
        {
            "competencyText": {"en-us": "Understand subtraction as an unknown-addend problem.<i> For example,\r\nsubtract 10 &ndash; 8 by finding the number that makes 10 when added to 8.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Add and subtract within 20. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Relate counting to addition and subtraction (e.g., by counting on 2 to\r\nadd 2)."}
        },
        {
            "competencyText": {"en-us": "Add and subtract within 20, demonstrating fluency for addition and\r\nsubtraction within 10. Use strategies such as counting on; making ten\r\n(e.g., 8 + 6 = 8 + 2 + 4 = 10 + 4 = 14); decomposing a number leading to\r\na ten (e.g., 13 &ndash; 4 = 13 &ndash; 3 &ndash; 1 = 10 &ndash; 1 = 9); using the relationship between\r\naddition and subtraction (e.g., knowing that 8 + 4 = 12, one knows 12 &ndash; 8\r\n= 4); and creating equivalent but easier or known sums (e.g., adding 6 +\r\n7 by creating the known equivalent 6 + 6 + 1 = 12 + 1 = 13)."}
        },
        {
            "competencyText": {"en-us": "Work with addition and subtraction equations. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand the meaning of the equal sign, and determine if equations\r\ninvolving addition and subtraction are true or false.<i> For example, which\r\nof the following equations are true and which are false? 6 = 6, 7 = 8 &ndash; 1,\r\n5 + 2 = 2 + 5, 4 + 1 = 5 + 2.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Determine the unknown whole number in an addition or subtraction\r\nequation relating to three whole numbers.<i> For example, determine the\r\nunknown number that makes the equation true in each of the equations 8 +\r\n? = 11, 5 = [] &ndash; 3, 6 + 6 = [].<\/i>"}
        },
        {
            "competencyText": {"en-us": "Number and Operations in Base Ten"}
        },
        {
            "competencyText": {"en-us": "Extend the counting sequence. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Count to 120, starting at any number less than 120. In this range, read\r\nand write numerals and represent a number of objects with a written\r\nnumeral."}
        },
        {
            "competencyText": {"en-us": "Understand place value. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that the two digits of a two-digit number represent amounts of tens and ones. <ol style=\"list-style-type: lower-alpha;\"><li>10 can be thought of as a bundle of ten ones &mdash; called a &ldquo;ten.&rdquo; <\/li><li>The numbers from 11 to 19 are composed of a ten and one, two, three, four, five, six, seven, eight, or nine ones. <\/li><li>The numbers 10, 20, 30, 40, 50, 60, 70, 80, 90 refer to one, two, three, four, five, six, seven, eight, or nine tens (and 0 ones). <\/li><li>Decompose two-digit numbers in multiple ways (e.g., 64 can be decomposed into 6 tens and 4 ones or into 5 tens and 14 ones).<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Compare two two-digit numbers based on meanings of the tens and ones\r\ndigits, recording the results of comparisons with the symbols &gt;, =, and &lt;."}
        },
        {
            "competencyText": {"en-us": "Use place value understanding and properties of operations to add and subtract. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Add within 100, including adding a two-digit number and a one-digit\r\nnumber, and adding a two-digit number and a multiple of 10, using concrete\r\nmodels or drawings and strategies based on place value, properties of\r\noperations, and/or the relationship between addition and subtraction;\r\nrelate the strategy to a written method and explain the reasoning used.\r\nUnderstand that in adding two-digit numbers, one adds tens and tens, ones\r\nand ones; and sometimes it is necessary to compose a ten."}
        },
        {
            "competencyText": {"en-us": "Given a two-digit number, mentally find 10 more or 10 less than the\r\nnumber, without having to count; explain the reasoning used."}
        },
        {
            "competencyText": {"en-us": "Subtract multiples of 10 in the range 10-90 from multiples of 10 in the\r\nrange 10-90 (positive or zero differences), using concrete models or\r\ndrawings and strategies based on place value, properties of operations,\r\nand/or the relationship between addition and subtraction; relate the\r\nstrategy to a written method and explain the reasoning used."}
        },
        {
            "competencyText": {"en-us": "Measurement and Data"}
        },
        {
            "competencyText": {"en-us": "Measure lengths indirectly and by iterating length units. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Order three objects by length; compare the lengths of two objects\r\nindirectly by using a third object."}
        },
        {
            "competencyText": {"en-us": "Understand how to use a ruler to measure length to the nearest inch. <\/p><ol style=\"list-style-type: lower-alpha;\"><li>Recognize that the ruler is a tool that can be used to measure the attribute of length. <\/li><li>Understand the importance of the zero point and end point and that the length measure is the span between two points. <\/li><li>Recognize that the units marked on a ruler have equal length intervals and fit together with no gaps or overlaps. These equal interval distances can be counted to determine the overall length of an object.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Work with time and money. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Tell and write time in hours and half-hours using analog and digital\r\nclocks."}
        },
        {
            "competencyText": {"en-us": "Identify and combine values of money in cents up to one dollar working with a single unit of currency<sup>1<\/sup>. <\/p><ol style=\"list-style-type: lower-alpha;\"><li>Identify the value of coins (pennies, nickels, dimes, quarters). <\/li><li>Compute the value of combinations of coins (pennies and/or dimes). <\/li><li>Relate the value of pennies, dimes, and quarters to the dollar (e.g., There are 100 pennies <i>or<\/i> ten dimes <i>or<\/i> four quarters in one dollar.) (<sup>1<\/sup>Students are not expected to understand the decimal notation for combinations of dollars and cents.)<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Represent and interpret data. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Organize, represent, and interpret data with up to three categories; ask\r\nand answer questions about the total number of data points, how many\r\nin each category, and how many more or less are in one category than in\r\nanother."}
        },
        {
            "competencyText": {"en-us": "Geometry"}
        },
        {
            "competencyText": {"en-us": "Reason with shapes and their attributes. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Distinguish between defining attributes (e.g., triangles are closed and\r\nthree-sided) versus non-defining attributes (e.g., color, orientation,\r\noverall size); build and draw shapes to possess defining attributes."}
        },
        {
            "competencyText": {"en-us": "Compose two-dimensional shapes (rectangles, squares, trapezoids,\r\ntriangles, half-circles, and quarter-circles) or three-dimensional shapes\r\n(cubes, right rectangular prisms, right circular cones, and right circular\r\ncylinders) to create a composite shape, and compose new shapes from\r\nthe composite shape."}
        },
        {
            "competencyText": {"en-us": "Partition circles and rectangles into two and four equal shares, describe\r\nthe shares using the words <i>halves<\/i>, <i>fourths<\/i>, and <i>quarters<\/i>, and use the\r\nphrases <i>half of<\/i>, <i>fourth of<\/i>, and <i>quarter of<\/i>. Describe the whole as two of,\r\nor four of the shares. Understand for these examples that decomposing\r\ninto more equal shares creates smaller shares."}
        },
        {
            "competencyText": {"en-us": "Grade 2"}
        },
        {
            "competencyText": {"en-us": "Operations and Algebraic Thinking"}
        },
        {
            "competencyText": {"en-us": "Represent and solve problems involving addition and subtraction. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use addition and subtraction within 100 to solve one- and two-step\r\nword problems involving situations of adding to, taking from, putting\r\ntogether, taking apart, and comparing, with unknowns in all positions,\r\ne.g., by using drawings and equations with a symbol for the unknown\r\nnumber to represent the problem."}
        },
        {
            "competencyText": {"en-us": "Determine the unknown whole number in an equation relating four or more whole numbers. For example, determine the unknown number that makes the equation true in the equations 37 + 10 + 10 = ______ + 18, ? &ndash; 6 = 13 &ndash; 4, and 15 &ndash; 9 = 6 + <img src=\"http://www.cpalms.org/Uploads/Benchmark/8468/img/square.png\" alt=\"square box\" />."}
        },
        {
            "competencyText": {"en-us": "Add and subtract within 20. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Fluently add and subtract within 20 using mental strategies. By end of\r\nGrade 2, know from memory all sums of two one-digit numbers."}
        },
        {
            "competencyText": {"en-us": "Work with equal groups of objects to gain foundations for multiplication. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Determine whether a group of objects (up to 20) has an odd or even\r\nnumber of members, e.g., by pairing objects or counting them by 2s;\r\nwrite an equation to express an even number as a sum of two equal\r\naddends."}
        },
        {
            "competencyText": {"en-us": "Use addition to find the total number of objects arranged in\r\nrectangular arrays with up to 5 rows and up to 5 columns; write an\r\nequation to express the total as a sum of equal addends."}
        },
        {
            "competencyText": {"en-us": "Number and Operations in Base Ten"}
        },
        {
            "competencyText": {"en-us": "Understand place value. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that the three digits of a three-digit number represent amounts of hundreds, tens, and ones; e.g., 706 equals 7 hundreds, 0 tens, and 6 ones. Understand the following as special cases:\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>100 can be thought of as a bundle of ten tens &mdash; called a &ldquo;hundred.&rdquo;<\/li><li>The numbers 100, 200, 300, 400, 500, 600, 700, 800, 900 refer to one, two, three, four, five, six, seven, eight, or nine hundreds (and 0 tens and 0 ones).<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Count within 1000; skip-count by 5s, 10s, and 100s."}
        },
        {
            "competencyText": {"en-us": "Read and write numbers to 1000 using base-ten numerals, number\r\nnames, and expanded form."}
        },
        {
            "competencyText": {"en-us": "Compare two three-digit numbers based on meanings of the hundreds,\r\ntens, and ones digits, using &gt;, =, and &lt; symbols to record the results of\r\ncomparisons."}
        },
        {
            "competencyText": {"en-us": "Use place value understanding and properties of operations to add and subtract. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Fluently add and subtract within 100 using strategies based on place\r\nvalue, properties of operations, and/or the relationship between\r\naddition and subtraction."}
        },
        {
            "competencyText": {"en-us": "Add up to four two-digit numbers using strategies based on place\r\nvalue and properties of operations."}
        },
        {
            "competencyText": {"en-us": "Add and subtract within 1000, using concrete models or drawings\r\nand strategies based on place value, properties of operations, and/or\r\nthe relationship between addition and subtraction; relate the strategy\r\nto a written method. Understand that in adding or subtracting three digit\r\nnumbers, one adds or subtracts hundreds and hundreds, tens\r\nand tens, ones and ones; and sometimes it is necessary to compose or\r\ndecompose tens or hundreds."}
        },
        {
            "competencyText": {"en-us": "Mentally add 10 or 100 to a given number 100&ndash;900, and mentally\r\nsubtract 10 or 100 from a given number 100&ndash;900."}
        },
        {
            "competencyText": {"en-us": "Explain why addition and subtraction strategies work, using place value\r\nand the properties of operations."}
        },
        {
            "competencyText": {"en-us": "Measurement and Data"}
        },
        {
            "competencyText": {"en-us": "Measure and estimate lengths in standard units. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Measure the length of an object to the nearest inch, foot, centimeter, or meter by selecting and using appropriate tools such as rulers, yardsticks, meter sticks, and measuring tapes."}
        },
        {
            "competencyText": {"en-us": "Describe the inverse relationship between the size of a unit and number of units needed to measure a given object. <i>Example: Suppose the perimeter of a room is lined with one-foot rulers. Now, suppose we want to line it with yardsticks instead of rulers. Will we need more or fewer yardsticks than rulers to do the job? Explain your answer.\r\n<\/i>"}
        },
        {
            "competencyText": {"en-us": "Estimate lengths using units of inches, feet, yards,  centimeters, and meters."}
        },
        {
            "competencyText": {"en-us": "Measure to determine how much longer one object is than another,\r\nexpressing the length difference in terms of a standard length unit."}
        },
        {
            "competencyText": {"en-us": "Relate addition and subtraction to length. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use addition and subtraction within 100 to solve word problems\r\ninvolving lengths that are given in the same units, e.g., by using\r\ndrawings (such as drawings of rulers) and equations with a symbol for\r\nthe unknown number to represent the problem."}
        },
        {
            "competencyText": {"en-us": "Represent whole numbers as lengths from 0 on a number line diagram\r\nwith equally spaced points corresponding to the numbers 0, 1, 2, ..., and\r\nrepresent whole-number sums and differences within 100 on a number\r\nline diagram."}
        },
        {
            "competencyText": {"en-us": "Work with time and money. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Tell and write time from analog and digital clocks to the nearest five minutes."}
        },
        {
            "competencyText": {"en-us": "Solve one- and two-step word problems involving dollar bills (singles, fives, tens, twenties, and hundreds) or coins (quarters, dimes, nickels, and pennies) using $ and &cent; symbols appropriately. Word problems may involve addition, subtraction, and equal groups situations<sup>1<\/sup>. <i>Example: The cash register shows that the total for your purchase is 59&cent;. You gave the cashier three quarters. How much change should you receive from the cashier?<\/i> <\/p><ol style=\"list-style-type: lower-alpha;\"><li>Identify the value of coins and paper currency. <\/li><li>Compute the value of any combination of coins within one dollar.&nbsp; <\/li><li>Compute the value of any combinations of dollars (e.g., If you have three ten-dollar bills, one five-dollar bill, and two one-dollar bills, how much money do you have?). <\/li><li>Relate the value of pennies, nickels, dimes, and quarters to other coins and to the dollar (e.g., There are five nickels in one quarter. There are two nickels in one dime. There are two and a half dimes in one quarter. There are twenty nickels in one dollar).<\/li><\/ol>(<sup>1<\/sup>See glossary <a href=\"http://www.cpalms.org/uploads/docs/standards/mafs_table1.pdf\" target=\"_blank\">Table 1<\/a>)"}
        },
        {
            "competencyText": {"en-us": "Represent and interpret data. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Generate measurement data by measuring lengths of several objects\r\nto the nearest whole unit, or by making repeated measurements of the\r\nsame object. Show the measurements by making a line plot, where the\r\nhorizontal scale is marked off in whole-number units."}
        },
        {
            "competencyText": {"en-us": "Draw a picture graph and a bar graph (with single-unit scale) to\r\nrepresent a data set with up to four categories. Solve simple put-together,\r\ntake-apart, and compare problems using information\r\npresented in a bar graph."}
        },
        {
            "competencyText": {"en-us": "Geometry"}
        },
        {
            "competencyText": {"en-us": "Reason with shapes and their attributes. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Recognize and draw shapes having specified attributes, such as a given\r\nnumber of angles or a given number of equal faces. Identify triangles,\r\nquadrilaterals, pentagons, hexagons, and cubes."}
        },
        {
            "competencyText": {"en-us": "Partition a rectangle into rows and columns of same-size squares and\r\ncount to find the total number of them."}
        },
        {
            "competencyText": {"en-us": "Partition circles and rectangles into two, three, or four equal shares,\r\ndescribe the shares using the words<i> halves, thirds, half of, a third of,<\/i>\r\netc., and describe the whole as two halves, three thirds, four fourths.\r\nRecognize that equal shares of identical wholes need not have the\r\nsame shape."}
        },
        {
            "competencyText": {"en-us": "Grade 3"}
        },
        {
            "competencyText": {"en-us": "Operations and Algebraic Thinking"}
        },
        {
            "competencyText": {"en-us": "Represent and solve problems involving multiplication and division. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Interpret products of whole numbers, e.g., interpret 5 &times; 7 as the total\r\nnumber of objects in 5 groups of 7 objects each.<i> For example, describe\r\na context in which a total number of objects can be expressed as 5 &times; 7.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Interpret whole-number quotients of whole numbers, e.g., interpret\r\n56 &divide; 8 as the number of objects in each share when 56 objects are\r\npartitioned equally into 8 shares, or as a number of shares when\r\n56 objects are partitioned into equal shares of 8 objects each. <i>For\r\nexample, describe a context in which a number of shares or a number of\r\ngroups can be expressed as 56 &divide; 8.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Use multiplication and division within 100 to solve word problems in\r\nsituations involving equal groups, arrays, and measurement quantities,\r\ne.g., by using drawings and equations with a symbol for the unknown\r\nnumber to represent the problem."}
        },
        {
            "competencyText": {"en-us": "Determine the unknown whole number in a multiplication or division\r\nequation relating three whole numbers.<i> For example, determine the\r\nunknown number that makes the equation true in each of the equations<\/i> 8\r\n&times; ? = 48, 5 = [] &divide; 3, 6 &times; 6 = ?."}
        },
        {
            "competencyText": {"en-us": "Understand properties of multiplication and the relationship between multiplication and division.  (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Apply properties of operations as strategies to multiply and\r\ndivide. <i>Examples: If 6 &times; 4 = 24 is known, then 4 &times; 6 = 24 is also known.\r\n(Commutative property of multiplication.) 3 &times; 5 &times; 2 can be found by 3\r\n&times; 5 = 15, then 15 &times; 2 = 30, or by 5 &times; 2 = 10, then 3 &times; 10 = 30. (Associative\r\nproperty of multiplication.) Knowing that 8 &times; 5 = 40 and 8 &times; 2 = 16, one\r\ncan find 8 &times; 7 as 8 &times; (5 + 2) = (8 &times; 5) + (8 &times; 2) = 40 + 16 = 56. (Distributive\r\nproperty.)<\/i>"}
        },
        {
            "competencyText": {"en-us": "Understand division as an unknown-factor problem.<i> For example, find\r\n32 &divide; 8 by finding the number that makes 32 when multiplied by 8.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Multiply and divide within 100. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Fluently multiply and divide within 100, using strategies such as the relationship between multiplication and division (e.g., knowing that 8 &times; 5 = 40, one knows 40 &divide; 5 = 8) or properties of operations. By the end of Grade 3, know from memory all products of two one-digit numbers."}
        },
        {
            "competencyText": {"en-us": "Solve problems involving the four operations, and identify and explain patterns in arithmetic. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Solve two-step word problems using the four operations. Represent\r\nthese problems using equations with a letter standing for the\r\nunknown quantity. Assess the reasonableness of answers using mental\r\ncomputation and estimation strategies including rounding."}
        },
        {
            "competencyText": {"en-us": "Identify arithmetic patterns (including patterns in the addition table or\r\nmultiplication table), and explain them using properties of operations.\r\n<i>For example, observe that 4 times a number is always even, and explain\r\nwhy 4 times a number can be decomposed into two equal addends.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Number and Operations in Base Ten"}
        },
        {
            "competencyText": {"en-us": "Use place value understanding and properties of operations to perform multi-digit arithmetic. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use place value understanding to round whole numbers to the nearest\r\n10 or 100."}
        },
        {
            "competencyText": {"en-us": "Fluently add and subtract within 1000 using strategies and algorithms based on place value, properties of operations, and/or the relationship between addition and subtraction."}
        },
        {
            "competencyText": {"en-us": "Multiply one-digit whole numbers by multiples of 10 in the range\r\n10&ndash;90 (e.g., 9 &times; 80, 5 &times; 60) using strategies based on place value and\r\nproperties of operations."}
        },
        {
            "competencyText": {"en-us": "Number and Operations - Fractions"}
        },
        {
            "competencyText": {"en-us": "Develop understanding of fractions as numbers. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand a fraction 1/b as the quantity formed by 1 part when a\r\nwhole is partitioned into b equal parts; understand a fraction a/b as\r\nthe quantity formed by a parts of size 1/b."}
        },
        {
            "competencyText": {"en-us": "Understand a fraction as a number on the number line; represent fractions on a number line diagram.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Represent a fraction 1/b on a number line diagram by defining the interval from 0 to 1 as the whole and partitioning it into<i> b<\/i> equal parts. Recognize that each part has size 1/b and that the endpoint of the part based at 0 locates the number 1/b on the number line.<\/li><li>Represent a fraction <i>a/b<\/i> on a number line diagram by marking off <i>a<\/i> lengths <i>1/b<\/i> from 0. Recognize that the resulting interval has size\r\n<i>a/b<\/i> and that its endpoint locates the number <i>a/b<\/i> on the number line.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Explain equivalence of fractions in special cases, and compare fractions by reasoning about their size.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Understand two fractions as equivalent (equal) if they are the same size, or the same point on a number line.<\/li><li>Recognize and generate simple equivalent fractions, e.g., 1/2 = 2/4, 4/6 = 2/3). Explain why the fractions are equivalent, e.g., by using a visual fraction model.<\/li><li>Express whole numbers as fractions, and recognize fractions that are equivalent to whole numbers. <i>Examples: Express 3 in the form 3 = 3/1; recognize that 6/1 = 6; locate 4/4 and 1 at the same point of a number line diagram.<\/i><\/li><li>Compare two fractions with the same numerator or the same denominator by reasoning about their size. Recognize that comparisons are valid only when the two fractions refer to the same whole. Record the results of comparisons with the symbols &gt;, =, or &lt;, and justify the conclusions, e.g., by using a visual fraction model.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Measurement and Data"}
        },
        {
            "competencyText": {"en-us": "Solve problems involving measurement and estimation of intervals of time, liquid volumes, and masses of objects. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Tell and write time to the nearest minute and measure time intervals\r\nin minutes. Solve word problems involving addition and subtraction\r\nof time intervals in minutes, e.g., by representing the problem on a\r\nnumber line diagram."}
        },
        {
            "competencyText": {"en-us": "Measure and estimate liquid volumes and masses of objects using standard units of grams (g), kilograms (kg), and liters (l). Add, subtract, multiply, or divide to solve one-step word problems involving masses or volumes that are given in the same units."}
        },
        {
            "competencyText": {"en-us": "Represent and interpret data. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Draw a scaled picture graph and a scaled bar graph to represent a\r\ndata set with several categories. Solve one- and two-step &ldquo;how many\r\nmore&rdquo; and &ldquo;how many less&rdquo; problems using information presented in\r\nscaled bar graphs. <i>For example, draw a bar graph in which each square in\r\nthe bar graph might represent 5 pets.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Generate measurement data by measuring lengths using rulers marked\r\nwith halves and fourths of an inch. Show the data by making a line\r\nplot, where the horizontal scale is marked off in appropriate units&mdash;\r\nwhole numbers, halves, or quarters."}
        },
        {
            "competencyText": {"en-us": "Geometric measurement: understand concepts of area and relate area to multiplication and to addition. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Recognize area as an attribute of plane figures and understand concepts of area measurement.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>A square with side length 1 unit, called &ldquo;a unit square,&rdquo; is said to have &ldquo;one square unit&rdquo; of area, and can be used to measure area.<\/li><li>A plane figure which can be covered without gaps or overlaps by<i> n<\/i> unit squares is said to have an area of <i>n<\/i> square units.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Measure areas by counting unit squares (square cm, square m, square\r\nin, square ft, and improvised units)."}
        },
        {
            "competencyText": {"en-us": "Relate area to the operations of multiplication and addition.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Find the area of a rectangle with whole-number side lengths by tiling it, and show that the area is the same as would be found by multiplying the side lengths.<\/li><li>Multiply side lengths to find areas of rectangles with whole-number side lengths in the context of solving real world and mathematical problems, and represent whole-number products as rectangular areas in mathematical reasoning.<\/li><li>Use tiling to show in a concrete case that the area of a rectangle with whole-number side lengths a and b + c is the sum of a &times; b and a &times; c. Use area models to represent the distributive property in mathematical reasoning.<\/li><li>Recognize area as additive. Find areas of rectilinear figures by\r\ndecomposing them into non-overlapping rectangles and adding the areas of the non-overlapping parts, applying this technique to solve real world problems.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Geometric measurement: recognize perimeter as an attribute of plane figures and distinguish between linear and area measures. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Solve real world and mathematical problems involving perimeters\r\nof polygons, including finding the perimeter given the side lengths,\r\nfinding an unknown side length, and exhibiting rectangles with the\r\nsame perimeter and different areas or with the same area and different\r\nperimeters."}
        },
        {
            "competencyText": {"en-us": "Geometry"}
        },
        {
            "competencyText": {"en-us": "Reason with shapes and their attributes. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that shapes in different categories (e.g., rhombuses,\r\nrectangles, and others) may share attributes (e.g., having four sides),\r\nand that the shared attributes can define a larger category (e.g.,\r\nquadrilaterals). Recognize rhombuses, rectangles, and squares as\r\nexamples of quadrilaterals, and draw examples of quadrilaterals that\r\ndo not belong to any of these subcategories."}
        },
        {
            "competencyText": {"en-us": "Partition shapes into parts with equal areas. Express the area of each\r\npart as a unit fraction of the whole.<i> For example, partition a shape into 4\r\nparts with equal area, and describe the area of each part as 1/4 of the area\r\nof the shape.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Grade 4"}
        },
        {
            "competencyText": {"en-us": "Operations and Algebraic Thinking"}
        },
        {
            "competencyText": {"en-us": "Use the four operations with whole numbers to solve problems. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Interpret a multiplication equation as a comparison, e.g., interpret 35\r\n= 5 &times; 7 as a statement that 35 is 5 times as many as 7 and 7 times as\r\nmany as 5. Represent verbal statements of multiplicative comparisons\r\nas multiplication equations."}
        },
        {
            "competencyText": {"en-us": "Multiply or divide to solve word problems involving multiplicative\r\ncomparison, e.g., by using drawings and equations with a symbol\r\nfor the unknown number to represent the problem, distinguishing\r\nmultiplicative comparison from additive comparison."}
        },
        {
            "competencyText": {"en-us": "Solve multistep word problems posed with whole numbers and having\r\nwhole-number answers using the four operations, including problems\r\nin which remainders must be interpreted. Represent these problems\r\nusing equations with a letter standing for the unknown quantity.\r\nAssess the reasonableness of answers using mental computation and\r\nestimation strategies including rounding."}
        },
        {
            "competencyText": {"en-us": "Determine whether an equation is true or false by using comparative relational thinking. <i>For example, without adding 60 and 24, determine whether the equation 60 + 24 = 57 + 27 is true or false.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Determine the unknown whole number in an equation relating four whole numbers using comparative relational thinking. <i>For example, solve 76 + 9 = n + 5 for n by arguing that nine is four more than five, so the unknown number must be four greater than 76.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Gain familiarity with factors and multiples. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Investigate factors and multiples.<p><\/p><ol style=\"list-style-type: lower-alpha;\"><li>Find all factor pairs for a whole number in the range 1&ndash;100.<\/li><li>Recognize that a whole number is a multiple of each of its factors. Determine whether a given whole number in the range 1&ndash;100 is a multiple of a given one-digit number.\r\n<\/li><li>Determine whether a given whole number in the range 1&ndash;100 is prime or composite.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Generate and analyze patterns. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Generate a number or shape pattern that follows a given rule. Identify\r\napparent features of the pattern that were not explicit in the rule itself.<i>\r\nFor example, given the rule &ldquo;Add 3&rdquo; and the starting number 1, generate\r\nterms in the resulting sequence and observe that the terms appear to\r\nalternate between odd and even numbers. Explain informally why the\r\nnumbers will continue to alternate in this way.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Number and Operations in Base Ten"}
        },
        {
            "competencyText": {"en-us": "Generalize place value understanding for multi-digit whole numbers. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Recognize that in a multi-digit whole number, a digit in one place\r\nrepresents ten times what it represents in the place to its right.<i> For\r\nexample, recognize that 700 &divide; 70 = 10 by applying concepts of place value\r\nand division.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Read and write multi-digit whole numbers using base-ten numerals,\r\nnumber names, and expanded form. Compare two multi-digit numbers\r\nbased on meanings of the digits in each place, using &gt;, =, and &lt;\r\nsymbols to record the results of comparisons."}
        },
        {
            "competencyText": {"en-us": "Use place value understanding to round multi-digit whole numbers to\r\nany place."}
        },
        {
            "competencyText": {"en-us": "Use place value understanding and properties of operations to perform multi-digit arithmetic. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Fluently add and subtract multi-digit whole numbers using the\r\nstandard algorithm."}
        },
        {
            "competencyText": {"en-us": "Multiply a whole number of up to four digits by a one-digit whole\r\nnumber, and multiply two two-digit numbers, using strategies based\r\non place value and the properties of operations. Illustrate and explain\r\nthe calculation by using equations, rectangular arrays, and/or area\r\nmodels."}
        },
        {
            "competencyText": {"en-us": "Find whole-number quotients and remainders with up to four-digit\r\ndividends and one-digit divisors, using strategies based on place\r\nvalue, the properties of operations, and/or the relationship between\r\nmultiplication and division. Illustrate and explain the calculation by\r\nusing equations, rectangular arrays, and/or area models."}
        },
        {
            "competencyText": {"en-us": "Number and Operations - Fractions"}
        },
        {
            "competencyText": {"en-us": "Extend understanding of fraction equivalence and ordering. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Explain why a fraction a/b is equivalent to a fraction (n &times; a)/(n &times; b)\r\nby using visual fraction models, with attention to how the number and\r\nsize of the parts differ even though the two fractions themselves are\r\nthe same size. Use this principle to recognize and generate equivalent\r\nfractions."}
        },
        {
            "competencyText": {"en-us": "Compare two fractions with different numerators and different\r\ndenominators, e.g., by creating common denominators or numerators,\r\nor by comparing to a benchmark fraction such as 1/2. Recognize that\r\ncomparisons are valid only when the two fractions refer to the same\r\nwhole. Record the results of comparisons with symbols &gt;, =, or &lt;, and\r\njustify the conclusions, e.g., by using a visual fraction model."}
        },
        {
            "competencyText": {"en-us": "Build fractions from unit fractions by applying and extending previous understandings of operations on whole numbers. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand a fraction a/b with a > 1 as a sum of fractions 1/b.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Understand addition and subtraction of fractions as joining and separating parts referring to the same whole.<\/li><li>Decompose a fraction into a sum of fractions with the same denominator in more than one way, recording each decomposition by an equation. Justify decompositions, e.g., by using a visual fraction model.<i> Examples: 3/8 = 1/8 + 1/8 + 1/8 ; 3/8 = 1/8 + 2/8 ; 2 1/8 = 1 + 1 + 1/8 = 8/8 + 8/8 + 1/8.<\/i><\/li><li>Add and subtract mixed numbers with like denominators, e.g., by replacing each mixed number with an equivalent fraction, and/or by using properties of operations and the relationship between addition and subtraction.<\/li><li>Solve word problems involving addition and subtraction of fractions referring to the same whole and having like denominators, e.g., by using visual fraction models and equations to represent the problem.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of multiplication to multiply a fraction by a whole number.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Understand a fraction a/b as a multiple of 1/b. <i>For example, use a visual fraction model to represent 5/4 as the product 5 &times; (1/4), recording the conclusion by the equation 5/4 = 5 &times; (1/4).<\/i><\/li><li>Understand a multiple of a/b as a multiple of 1/b, and use this understanding to multiply a fraction by a whole number.<i> For example, use a visual fraction model to express 3 &times; (2/5) as 6 &times; (1/5), recognizing this product as 6/5. (In general, n &times; (a/b) = (n &times; a)/b.)<\/i><\/li><li>Solve word problems involving multiplication of a fraction by a whole number, e.g., by using visual fraction models and equations to represent the problem.<i> For example, if each person at a party will eat 3/8 of a pound of roast beef, and there will be 5 people at the party, how many pounds of roast beef will be needed? Between what two whole numbers does your answer lie?<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Understand decimal notation for fractions, and compare decimal fractions. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Express a fraction with denominator 10 as an equivalent fraction with\r\ndenominator 100, and use this technique to add two fractions with\r\nrespective denominators 10 and 100.<i> For example, express 3/10 as\r\n30/100, and add 3/10 + 4/100 = 34/100.<\/i>\r\n<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Use decimal notation for fractions with denominators 10 or 100. <i>For\r\nexample, rewrite 0.62 as 62/100; describe a length as 0.62 meters; locate\r\n0.62 on a number line diagram.<\/i>\r\n<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Compare two decimals to hundredths by reasoning about their size.\r\nRecognize that comparisons are valid only when the two decimals\r\nrefer to the same whole. Record the results of comparisons with the\r\nsymbols &gt;, =, or &lt;, and justify the conclusions, e.g., by using a visual\r\nmodel.\r\n<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Measurement and Data"}
        },
        {
            "competencyText": {"en-us": "Solve problems involving measurement and conversion of measurements from a larger unit to a smaller unit. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Know relative sizes of measurement units within one system of units including km, m, cm; kg, g; lb, oz.; l, ml; hr, min, sec. Within a single system of measurement, express measurements in a larger unit in terms of a smaller unit. Record measurement equivalents in a two-column table.<i> For example, know that 1 ft is 12 times as long as 1 in. Express the length of a 4 ft snake as 48 in. Generate a conversion table for feet and inches listing the number pairs (1, 12), (2, 24), (3, 36), ...<\/i>"}
        },
        {
            "competencyText": {"en-us": "Use the four operations to solve word problems<sup>1<\/sup> involving distances, intervals of time, and money, including problems involving simple fractions or decimals<sup>2<\/sup>. Represent fractional quantities of distance and intervals of time using linear models. (<sup>1<\/sup>See glossary <a href=\"http://www.cpalms.org/uploads/docs/standards/mafs_table1.pdf\" target=\"_blank\">Table 1<\/a> and <a href=\"http://www.cpalms.org/uploads/docs/standards/mafs_table2.pdf\" target=\"_blank\">Table 2<\/a>) (<sup>2<\/sup>Computational fluency with fractions and decimals is not the goal for students at this grade level.)"}
        },
        {
            "competencyText": {"en-us": "Apply the area and perimeter formulas for rectangles in real world and\r\nmathematical problems.<i> For example, find the width of a rectangular\r\nroom given the area of the flooring and the length, by viewing the area\r\nformula as a multiplication equation with an unknown factor.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Represent and interpret data. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Make a line plot to display a data set of measurements in fractions of\r\na unit (1/2, 1/4, 1/8). Solve problems involving addition and subtraction\r\nof fractions by using information presented in line plots.<i> For example,\r\nfrom a line plot find and interpret the difference in length between the\r\nlongest and shortest specimens in an insect collection.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Geometric measurement: understand concepts of angle and measure angles. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Recognize angles as geometric shapes that are formed wherever two rays share a common endpoint, and understand concepts of angle measurement:\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>An angle is measured with reference to a circle with its center at the common endpoint of the rays, by considering the fraction of the circular arc between the points where the two rays intersect the circle. An angle that turns through 1/360 of a circle is called a &ldquo;one-degree angle,&rdquo; and can be used to measure angles.<\/li><li>An angle that turns through <i>n<\/i> one-degree angles is said to have an angle measure of<i> n<\/i> degrees.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Measure angles in whole-number degrees using a protractor. Sketch\r\nangles of specified measure."}
        },
        {
            "competencyText": {"en-us": "<p>Recognize angle measure as additive. When an angle is decomposed\r\ninto non-overlapping parts, the angle measure of the whole is the sum\r\nof the angle measures of the parts. Solve addition and subtraction\r\nproblems to find unknown angles on a diagram in real world and\r\nmathematical problems, e.g., by using an equation with a symbol for\r\nthe unknown angle measure.<\/p><br />"}
        },
        {
            "competencyText": {"en-us": "Geometry"}
        },
        {
            "competencyText": {"en-us": "Draw and identify lines and angles, and classify shapes by properties of their lines and angles. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Draw points, lines, line segments, rays, angles (right, acute, obtuse),\r\nand perpendicular and parallel lines. Identify these in two-dimensional\r\nfigures."}
        },
        {
            "competencyText": {"en-us": "Classify two-dimensional figures based on the presence or absence of\r\nparallel or perpendicular lines, or the presence or absence of angles of\r\na specified size. Recognize right triangles as a category, and identify\r\nright triangles."}
        },
        {
            "competencyText": {"en-us": "Recognize a line of symmetry for a two-dimensional figure as a line\r\nacross the figure such that the figure can be folded along the line\r\ninto matching parts. Identify line-symmetric figures and draw lines of\r\nsymmetry."}
        },
        {
            "competencyText": {"en-us": "Grade 5"}
        },
        {
            "competencyText": {"en-us": "Operations and Algebraic Thinking"}
        },
        {
            "competencyText": {"en-us": "Write and interpret numerical expressions. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use parentheses, brackets, or braces in numerical expressions, and\r\nevaluate expressions with these symbols."}
        },
        {
            "competencyText": {"en-us": "Write simple expressions that record calculations with numbers, and\r\ninterpret numerical expressions without evaluating them.<i> For example,\r\nexpress the calculation &ldquo;add 8 and 7, then multiply by 2&rdquo; as 2 &times; (8 + 7).\r\nRecognize that 3 &times; (18932 + 921) is three times as large as 18932 + 921,\r\nwithout having to calculate the indicated sum or product.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Analyze patterns and relationships. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Generate two numerical patterns using two given rules. Identify\r\napparent relationships between corresponding terms. Form ordered\r\npairs consisting of corresponding terms from the two patterns, and\r\ngraph the ordered pairs on a coordinate plane.<i> For example, given the\r\nrule &ldquo;Add 3&rdquo; and the starting number 0, and given the rule &ldquo;Add 6&rdquo; and the\r\nstarting number 0, generate terms in the resulting sequences, and observe\r\nthat the terms in one sequence are twice the corresponding terms in the\r\nother sequence. Explain informally why this is so.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Number and Operations in Base Ten"}
        },
        {
            "competencyText": {"en-us": "Understand the place value system. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "<p>Recognize that in a multi-digit number, a digit in one place represents\r\n10 times as much as it represents in the place to its right and 1/10 of\r\nwhat it represents in the place to its left.<\/p><p><\/p><br />"}
        },
        {
            "competencyText": {"en-us": "Explain patterns in the number of zeros of the product when\r\nmultiplying a number by powers of 10, and explain patterns in the\r\nplacement of the decimal point when a decimal is multiplied or\r\ndivided by a power of 10. Use whole-number exponents to denote\r\npowers of 10."}
        },
        {
            "competencyText": {"en-us": "Read, write, and compare decimals to thousandths.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Read and write decimals to thousandths using base-ten numerals, number names, and expanded form, e.g., 347.392 = 3 &times; 100 + 4 &times; 10 + 7 &times; 1 + 3 &times; (1/10) + 9 &times; (1/100) + 2 &times; (1/1000).<\/li><li>Compare two decimals to thousandths based on meanings of the digits in each place, using &gt;, =, and &lt; symbols to record the results of comparisons.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Use place value understanding to round decimals to any place."}
        },
        {
            "competencyText": {"en-us": "Perform operations with multi-digit whole numbers and with decimals to hundredths. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Fluently multiply multi-digit whole numbers using the standard\r\nalgorithm."}
        },
        {
            "competencyText": {"en-us": "Find whole-number quotients of whole numbers with up to four-digit\r\ndividends and two-digit divisors, using strategies based on place\r\nvalue, the properties of operations, and/or the relationship between\r\nmultiplication and division. Illustrate and explain the calculation by\r\nusing equations, rectangular arrays, and/or area models.\r\n<br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Add, subtract, multiply, and divide decimals to hundredths, using\r\nconcrete models or drawings and strategies based on place value,\r\nproperties of operations, and/or the relationship between addition and\r\nsubtraction; relate the strategy to a written method and explain the\r\nreasoning used."}
        },
        {
            "competencyText": {"en-us": "Number and Operations - Fractions"}
        },
        {
            "competencyText": {"en-us": "Use equivalent fractions as a strategy to add and subtract fractions. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Add and subtract fractions with unlike denominators (including mixed\r\nnumbers) by replacing given fractions with equivalent fractions in\r\nsuch a way as to produce an equivalent sum or difference of fractions\r\nwith like denominators.<i> For example, 2/3 + 5/4 = 8/12 + 15/12 = 23/12. (In\r\ngeneral, a/b + c/d = (ad + bc)/bd.)<\/i>"}
        },
        {
            "competencyText": {"en-us": "Solve word problems involving addition and subtraction of fractions\r\nreferring to the same whole, including cases of unlike denominators,\r\ne.g., by using visual fraction models or equations to represent the\r\nproblem. Use benchmark fractions and number sense of fractions\r\nto estimate mentally and assess the reasonableness of answers.<i> For\r\nexample, recognize an incorrect result 2/5 + 1/2 = 3/7, by observing that\r\n3/7 &lt; 1/2.<\/i><br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of multiplication and division to multiply and divide fractions. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Interpret a fraction as division of the numerator by the denominator\r\n(a/b = a &divide; b). Solve word problems involving division of whole\r\nnumbers leading to answers in the form of fractions or mixed numbers,\r\ne.g., by using visual fraction models or equations to represent the\r\nproblem.<i> For example, interpret 3/4 as the result of dividing 3 by 4, noting\r\nthat 3/4 multiplied by 4 equals 3, and that when 3 wholes are shared\r\nequally among 4 people each person has a share of size 3/4. If 9 people\r\nwant to share a 50-pound sack of rice equally by weight, how many\r\npounds of rice should each person get? Between what two whole numbers\r\ndoes your answer lie?<\/i>"}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of multiplication to multiply a fraction or whole number by a fraction.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Interpret the product<i> (a/b) <\/i>&times; <i>q <\/i>as a parts of a partition of <i>q<\/i> into <i>b<\/i> equal parts; equivalently, as the result of a sequence of operations <i>a &times; q &divide; b<\/i>. <i>For example, use a visual fraction model to show (2/3) &times; 4 = 8/3, and create a story context for this equation. Do the same with (2/3) &times; (4/5) = 8/15. (In general, (a/b) &times; (c/d) = ac/bd.)<\/i><\/li><li>Find the area of a rectangle with fractional side lengths by tiling it with unit squares of the appropriate unit fraction side lengths, and show that the area is the same as would be found by multiplying the side lengths. Multiply fractional side lengths to find areas of rectangles, and represent fraction products as rectangular areas.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Interpret multiplication as scaling (resizing), by:\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Comparing the size of a product to the size of one factor on the basis of the size of the other factor, without performing the indicated multiplication.<\/li><li>Explaining why multiplying a given number by a fraction greater than 1 results in a product greater than the given number (recognizing multiplication by whole numbers greater than 1 as a familiar case); explaining why multiplying a given number by a fraction less than 1 results in a product smaller than the given number; and relating the principle of fraction equivalence <i>a/b = (n&times;a)/(n&times;b)<\/i> to the effect of multiplying <i>a/b<\/i> by 1.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Solve real world problems involving multiplication of fractions and\r\nmixed numbers, e.g., by using visual fraction models or equations to\r\nrepresent the problem."}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of division to divide unit fractions by whole numbers and whole numbers by unit fractions.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Interpret division of a unit fraction by a non-zero whole number, and compute such quotients.<i> For example, create a story context for (1/3) &divide; 4, and use a visual fraction model to show the quotient. Use the relationship between multiplication and division to explain that (1/3) &divide; 4 = 1/12 because (1/12) &times; 4 = 1/3.<\/i><\/li><li>Interpret division of a whole number by a unit fraction, and compute such quotients. <i>For example, create a story context for 4 &divide; (1/5), and use a visual fraction model to show the quotient. Use the relationship between multiplication and division to explain that 4 &divide; (1/5) = 20 because 20 &times; (1/5) = 4.<\/i><\/li><li>Solve real world problems involving division of unit fractions by non-zero whole numbers and division of whole numbers by unit fractions, e.g., by using visual fraction models and equations to represent the problem.<i> For example, how much chocolate will each person get if 3 people share 1/2 lb of chocolate equally? How many 1/3-cup servings are in 2 cups of raisins?\r\n<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Measurement and Data"}
        },
        {
            "competencyText": {"en-us": "Convert like measurement units within a given measurement system. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Convert among different-sized standard measurement units (i.e., km, m, cm; kg, g; lb, oz.; l, ml; hr, min, sec) within a given measurement system (e.g., convert 5 cm to 0.05 m), and use these conversions in solving multi-step, real world problems."}
        },
        {
            "competencyText": {"en-us": "Represent and interpret data. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Make a line plot to display a data set of measurements in fractions of\r\na unit (1/2, 1/4, 1/8). Use operations on fractions for this grade to solve\r\nproblems involving information presented in line plots. <i>For example,\r\ngiven different measurements of liquid in identical beakers, find the\r\namount of liquid each beaker would contain if the total amount in all the\r\nbeakers were redistributed equally.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Geometric measurement: understand concepts of volume and relate volume to multiplication and to addition. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Recognize volume as an attribute of solid figures and understand concepts of volume measurement.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>A cube with side length 1 unit, called a &ldquo;unit cube,&rdquo; is said to have &ldquo;one cubic unit&rdquo; of volume, and can be used to measure volume.<\/li><li>A solid figure which can be packed without gaps or overlaps using n unit cubes is said to have a volume of n cubic units.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Measure volumes by counting unit cubes, using cubic cm, cubic in,\r\ncubic ft, and improvised units."}
        },
        {
            "competencyText": {"en-us": "Relate volume to the operations of multiplication and addition and solve real world and mathematical problems involving volume.<p><\/p>\r\n\r\n<ol style=\"list-style-type: lower-alpha;\"><li>Find the volume of a right rectangular prism with whole-number side lengths by packing it with unit cubes, and show that the volume is the same as would be found by multiplying the edge lengths, equivalently by multiplying the height by the area of the base. Represent threefold whole-number products as volumes, e.g., to represent the associative property of multiplication. <\/li><li>Apply the formulas V = l &times; w &times; h and V = B &times; h for rectangular prisms to find volumes of right rectangular prisms with whole-number edge lengths in the context of solving real world and mathematical problems.\r\n<\/li><li>Recognize volume as additive. Find volumes of solid figures composed of two non-overlapping right rectangular prisms by adding the volumes of the non-overlapping parts, applying this technique to solve real world problems.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Geometry"}
        },
        {
            "competencyText": {"en-us": "Graph points on the coordinate plane to solve real-world and mathematical problems. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use a pair of perpendicular number lines, called axes, to define a\r\ncoordinate system, with the intersection of the lines (the origin)\r\narranged to coincide with the 0 on each line and a given point in\r\nthe plane located by using an ordered pair of numbers, called its\r\ncoordinates. Understand that the first number indicates how far to\r\ntravel from the origin in the direction of one axis, and the second\r\nnumber indicates how far to travel in the direction of the second\r\naxis, with the convention that the names of the two axes and the\r\ncoordinates correspond (e.g., x-axis and x-coordinate, y-axis and\r\ny-coordinate)."}
        },
        {
            "competencyText": {"en-us": "Represent real world and mathematical problems by graphing points\r\nin the first quadrant of the coordinate plane, and interpret coordinate\r\nvalues of points in the context of the situation."}
        },
        {
            "competencyText": {"en-us": "Classify two-dimensional figures into categories based on their properties. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that attributes belonging to a category of two-dimensional\r\nfigures also belong to all subcategories of that category.<i>\r\nFor example, all rectangles have four right angles and squares are\r\nrectangles, so all squares have four right angles.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Classify and organize two-dimensional figures into Venn diagrams based on the attributes of the figures."}
        },
        {
            "competencyText": {"en-us": "Grade 6"}
        },
        {
            "competencyText": {"en-us": "Ratios &amp; Proportional Relationships"}
        },
        {
            "competencyText": {"en-us": "Understand ratio concepts and use ratio reasoning to solve problems. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand the concept of a ratio and use ratio language to describe\r\na ratio relationship between two quantities. <i>For example, &ldquo;The ratio\r\nof wings to beaks in the bird house at the zoo was 2:1, because for\r\nevery 2 wings there was 1 beak.&rdquo; &ldquo;For every vote candidate A received,\r\ncandidate C received nearly three votes.&rdquo;<\/i>"}
        },
        {
            "competencyText": {"en-us": "Understand the concept of a unit rate a/b associated with a ratio a:b\r\nwith b &ne; 0, and use rate language in the context of a ratio relationship.<i>\r\nFor example, &ldquo;This recipe has a ratio of 3 cups of flour to 4 cups of sugar,\r\nso there is 3/4 cup of flour for each cup of sugar.&rdquo; &ldquo;We paid $75 for 15\r\nhamburgers, which is a rate of $5 per hamburger.&rdquo;<\/i>"}
        },
        {
            "competencyText": {"en-us": "Use ratio and rate reasoning to solve real-world and mathematical problems, e.g., by reasoning about tables of equivalent ratios, tape diagrams, double number line diagrams, or equations.<p><\/p> <ol style=\"list-style-type: lower-alpha;\"><li>Make tables of equivalent ratios relating quantities with whole-number measurements, find missing values in the tables, and plot the pairs of values on the coordinate plane. Use tables to compare ratios. <\/li><li>Solve unit rate problems including those involving unit pricing and constant speed.<i> For example, if it took 7 hours to mow 4 lawns, then at that rate, how many lawns could be mowed in 35 hours? At what rate were lawns being mowed?&nbsp;<\/i><\/li><li>Find a percent of a quantity as a rate per 100 (e.g., 30% of a quantity means 30/100 times the quantity); solve problems involving finding the whole, given a part and the percent.&nbsp;<\/li><li>Use ratio reasoning to convert measurement units; manipulate and transform units appropriately when multiplying or dividing quantities.<\/li><li>Understand the concept of Pi as the ratio of the circumference of a circle to its diameter.<\/li><\/ol>(<sup>1<\/sup>See <a href=\"http://www.cpalms.org/uploads/docs/standards/mafs_table2.pdf\" target=\"_blank\">Table 2 Common Multiplication and Division Situations<\/a>)"}
        },
        {
            "competencyText": {"en-us": "The Number System"}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of multiplication and division to divide fractions by fractions. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Interpret and compute quotients of fractions, and solve word\r\nproblems involving division of fractions by fractions, e.g., by using\r\nvisual fraction models and equations to represent the problem. <i>For\r\nexample, create a story context for (2/3) &divide; (3/4) and use a visual fraction\r\nmodel to show the quotient; use the relationship between multiplication\r\nand division to explain that (2/3) &divide; (3/4) = 8/9 because 3/4 of 8/9 is 2/3.\r\n(In general, (a/b) &divide; (c/d) = ad/bc.) How much chocolate will each person\r\nget if 3 people share 1/2 lb of chocolate equally? How many 3/4-cup\r\nservings are in 2/3 of a cup of yogurt? How wide is a rectangular strip of\r\nland with length 3/4 mi and area 1/2 square mi?<\/i><br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Compute fluently with multi-digit numbers and find common factors and multiples. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Fluently divide multi-digit numbers using the standard algorithm.<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Fluently add, subtract, multiply, and divide multi-digit decimals using\r\nthe standard algorithm for each operation.<br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Find the greatest common factor of two whole numbers less than or\r\nequal to 100 and the least common multiple of two whole numbers\r\nless than or equal to 12. Use the distributive property to express a\r\nsum of two whole numbers 1&ndash;100 with a common factor as a multiple\r\nof a sum of two whole numbers with no common factor.<i> For example,\r\nexpress 36 + 8 as 4 (9 + 2).<\/i>"}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of numbers to the system of rational numbers. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that positive and negative numbers are used together\r\nto describe quantities having opposite directions or values (e.g.,\r\ntemperature above/below zero, elevation above/below sea level,\r\ncredits/debits, positive/negative electric charge); use positive and\r\nnegative numbers to represent quantities in real-world contexts,\r\nexplaining the meaning of 0 in each situation."}
        },
        {
            "competencyText": {"en-us": "Understand a rational number as a point on the number line. Extend number line diagrams and coordinate axes familiar from previous grades to represent points on the line and in the plane with negative number coordinates.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Recognize opposite signs of numbers as indicating locations on opposite sides of 0 on the number line; recognize that the opposite of the opposite of a number is the number itself, e.g., &ndash;(&ndash;3) = 3, and that 0 is its own opposite.<\/li><li>Understand signs of numbers in ordered pairs as indicating locations in quadrants of the coordinate plane; recognize that when two ordered pairs differ only by signs, the locations of the points are related by reflections across one or both axes.<\/li><li>Find and position integers and other rational numbers on a horizontal or vertical number line diagram; find and position pairs of integers and other rational numbers on a coordinate plane.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Understand ordering and absolute value of rational numbers.<br /><ol style=\"list-style-type: lower-alpha;\"><li>Interpret statements of inequality as statements about the relative position of two numbers on a number line diagram.<i> For example, interpret -3 &gt; -7 as a statement that -3 is located to the right of -7 on a number line oriented from left to right.<\/i><\/li><br /><li>Write, interpret, and explain statements of order for rational numbers in real-world contexts. <i>For example, write -3 <sup>o<\/sup>C &gt; -7 <sup>o<\/sup>C to express the fact that -3 <sup>o<\/sup>C is warmer than -7 <sup>o<\/sup>C.<\/i><\/li><br /><li>Understand the absolute value of a rational number as its distance from 0 on the number line; interpret absolute value as magnitude for a positive or negative quantity in a real-world situation.<i> For example, for an account balance of -30 dollars, write |-30| = 30 to describe the size of the debt in dollars.<\/i><\/li><br /><li>Distinguish comparisons of absolute value from statements about order. <i>For example, recognize that an account balance less than -30 dollars represents a debt greater than 30 dollars.<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Solve real-world and mathematical problems by graphing points in all\r\nfour quadrants of the coordinate plane. Include use of coordinates and\r\nabsolute value to find distances between points with the same first\r\ncoordinate or the same second coordinate.<br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Expressions &amp; Equations"}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of arithmetic to algebraic expressions. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Write and evaluate numerical expressions involving whole-number\r\nexponents."}
        },
        {
            "competencyText": {"en-us": "Write, read, and evaluate expressions in which letters stand for numbers.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Write expressions that record operations with numbers and with letters standing for numbers.<i> For example, express the calculation &ldquo;Subtract y from 5&rdquo; as 5 &ndash; y.<\/i><\/li><li>Identify parts of an expression using mathematical terms (sum, term, product, factor, quotient, coefficient); view one or more parts of an expression as a single entity.<i> For example, describe the expression 2 (8 + 7) as a product of two factors; view (8 + 7) as both a single entity and a sum of two terms.<\/i><\/li><li>Evaluate expressions at specific values of their variables. Include expressions that arise from formulas used in real-world problems. Perform arithmetic operations, including those involving whole-number exponents, in the conventional order when there are no parentheses to specify a particular order (Order of Operations). <i>For example, use the formulas V = s&sup3; and A = 6 s&sup2; to find the volume and surface area of a cube with sides of length s = 1/2.<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Apply the properties of operations to generate equivalent expressions.<i>\r\nFor example, apply the distributive property to the expression 3 (2 + x) to\r\nproduce the equivalent expression 6 + 3x; apply the distributive property\r\nto the expression 24x + 18y to produce the equivalent expression\r\n6 (4x + 3y); apply properties of operations to y + y + y to produce the\r\nequivalent expression 3y.<\/i><br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Identify when two expressions are equivalent (i.e., when the two\r\nexpressions name the same number regardless of which value is\r\nsubstituted into them).<i> For example, the expressions y + y + y and 3y\r\nare equivalent because they name the same number regardless of which\r\nnumber y stands for.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Reason about and solve one-variable equations and inequalities. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand solving an equation or inequality as a process of\r\nanswering a question: which values from a specified set, if any, make\r\nthe equation or inequality true? Use substitution to determine whether\r\na given number in a specified set makes an equation or inequality true."}
        },
        {
            "competencyText": {"en-us": "Use variables to represent numbers and write expressions when\r\nsolving a real-world or mathematical problem; understand that a\r\nvariable can represent an unknown number, or, depending on the\r\npurpose at hand, any number in a specified set."}
        },
        {
            "competencyText": {"en-us": "Solve real-world and mathematical problems by writing and solving\r\nequations of the form x + p = q and px = q for cases in which p, q and\r\nx are all non-negative rational numbers.\r\n<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Write an inequality of the form x &gt; c or x &lt; c to represent a constraint\r\nor condition in a real-world or mathematical problem. Recognize that\r\ninequalities of the form x &gt; c or x &lt; c have infinitely many solutions;\r\nrepresent solutions of such inequalities on number line diagrams."}
        },
        {
            "competencyText": {"en-us": "Represent and analyze quantitative relationships between dependent and independent variables. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use variables to represent two quantities in a real-world problem that\r\nchange in relationship to one another; write an equation to express\r\none quantity, thought of as the dependent variable, in terms of the\r\nother quantity, thought of as the independent variable. Analyze the\r\nrelationship between the dependent and independent variables using\r\ngraphs and tables, and relate these to the equation.<i> For example, in a\r\nproblem involving motion at constant speed, list and graph ordered pairs\r\nof distances and times, and write the equation d = 65t to represent the\r\nrelationship between distance and time.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Geometry"}
        },
        {
            "competencyText": {"en-us": "Solve real-world and mathematical problems involving area, surface area, and volume. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Find the area of right triangles, other triangles, special quadrilaterals,\r\nand polygons by composing into rectangles or decomposing into\r\ntriangles and other shapes; apply these techniques in the context of\r\nsolving real-world and mathematical problems."}
        },
        {
            "competencyText": {"en-us": "Find the volume of a right rectangular prism with fractional edge lengths by packing it with unit cubes of the appropriate unit fraction edge lengths, and show that the volume is the same as would be found by multiplying the edge lengths of the prism. Apply the formulas <i>V = l w h<\/i> and <i>V = B h<\/i> to find volumes of right rectangular prisms with fractional edge lengths in the context of solving real-world and mathematical problems."}
        },
        {
            "competencyText": {"en-us": "Draw polygons in the coordinate plane given coordinates for the\r\nvertices; use coordinates to find the length of a side joining points with\r\nthe same first coordinate or the same second coordinate. Apply these\r\ntechniques in the context of solving real-world and mathematical\r\nproblems."}
        },
        {
            "competencyText": {"en-us": "Represent three-dimensional figures using nets made up of rectangles\r\nand triangles, and use the nets to find the surface area of these\r\nfigures. Apply these techniques in the context of solving real-world\r\nand mathematical problems."}
        },
        {
            "competencyText": {"en-us": "Statistics &amp; Probability"}
        },
        {
            "competencyText": {"en-us": "Develop understanding of statistical variability. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Recognize a statistical question as one that anticipates variability in\r\nthe data related to the question and accounts for it in the answers.<i> For\r\nexample, &ldquo;How old am I?&rdquo; is not a statistical question, but &ldquo;How old are the\r\nstudents in my school?&rdquo; is a statistical question because one anticipates\r\nvariability in students&rsquo; ages.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Understand that a set of data collected to answer a statistical question\r\nhas a distribution which can be described by its center, spread, and\r\noverall shape."}
        },
        {
            "competencyText": {"en-us": "Recognize that a measure of center for a numerical data set\r\nsummarizes all of its values with a single number, while a measure of\r\nvariation describes how its values vary with a single number."}
        },
        {
            "competencyText": {"en-us": "Summarize and describe distributions. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Display numerical data in plots on a number line, including dot plots,\r\nhistograms, and box plots."}
        },
        {
            "competencyText": {"en-us": "Summarize numerical data sets in relation to their context, such as by:\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Reporting the number of observations.<\/li><li>Describing the nature of the attribute under investigation, including how it was measured and its units of measurement.<\/li><li>Giving quantitative measures of center (median and/or mean) and variability (interquartile range and/or mean absolute deviation), as well as describing any overall pattern and any striking deviations from the overall pattern with reference to the context in which the data were gathered.<\/li><li>Relating the choice of measures of center and variability to the\r\nshape of the data distribution and the context in which the data were gathered.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Grade 7"}
        },
        {
            "competencyText": {"en-us": "Ratios &amp; Proportional Relationships"}
        },
        {
            "competencyText": {"en-us": "Analyze proportional relationships and use them to solve real-world and mathematical problems. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Compute unit rates associated with ratios of fractions, including ratios\r\nof lengths, areas and other quantities measured in like or different\r\nunits.<i> For example, if a person walks 1/2 mile in each 1/4 hour, compute\r\nthe unit rate as the complex fraction 1/2/1/4 miles per hour, equivalently 2\r\nmiles per hour.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Recognize and represent proportional relationships between quantities.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Decide whether two quantities are in a proportional relationship, e.g., by testing for equivalent ratios in a table or graphing on a coordinate plane and observing whether the graph is a straight line through the origin.<\/li><li>Identify the constant of proportionality (unit rate) in tables, graphs, equations, diagrams, and verbal descriptions of proportional relationships.<\/li><li>Represent proportional relationships by equations.<i> For example, if total cost t is proportional to the number n of items purchased at a constant price p, the relationship between the total cost and the number of items can be expressed as t = pn.<\/i><\/li><li>Explain what a point (x, y) on the graph of a proportional relationship means in terms of the situation, with special attention to the points (0, 0) and (1, r) where r is the unit rate.<\/li><\/ol><br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Use proportional relationships to solve multistep ratio and percent\r\nproblems.<i> Examples: simple interest, tax, markups and markdowns,\r\ngratuities and commissions, fees, percent increase and decrease, percent\r\nerror.<\/i>"}
        },
        {
            "competencyText": {"en-us": "The Number System"}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of addition and subtraction to add and subtract rational numbers; represent addition and subtraction on a horizontal or vertical number line diagram.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Describe situations in which opposite quantities combine to make 0.<i> For example, a hydrogen atom has 0 charge because its two constituents are oppositely charged.<\/i><\/li><li>Understand p + q as the number located a distance |q| from p, in the positive or negative direction depending on whether q is positive or negative. Show that a number and its opposite have a sum of 0 (are additive inverses). Interpret sums of rational numbers by describing real-world contexts.<\/li><li>Understand subtraction of rational numbers as adding the additive inverse, p &ndash; q = p + (&ndash;q). Show that the distance between two rational numbers on the number line is the absolute value of their difference, and apply this principle in real-world contexts.<\/li><li>Apply properties of operations as strategies to add and subtract rational numbers.<\/li><\/ol>\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Apply and extend previous understandings of multiplication and division and of fractions to multiply and divide rational numbers.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Understand that multiplication is extended from fractions to rational numbers by requiring that operations continue to satisfy the properties of operations, particularly the distributive property, leading to products such as (&ndash;1)(&ndash;1) = 1 and the rules for multiplying signed numbers. Interpret products of rational numbers by describing real-world contexts.<\/li><li>Understand that integers can be divided, provided that the divisor is not zero, and every quotient of integers (with non-zero divisor) is a rational number. If p and q are integers, then &ndash;(p/q) = (&ndash;p)/q = p/(&ndash;q). Interpret quotients of rational numbers by describing real-world contexts.<\/li><li>Apply properties of operations as strategies to multiply and divide rational numbers.<\/li><li>Convert a rational number to a decimal using long division; know that the decimal form of a rational number terminates in 0s or eventually repeats.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Solve real-world and mathematical problems involving the four\r\noperations with rational numbers.<br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Expressions &amp; Equations"}
        },
        {
            "competencyText": {"en-us": "Use properties of operations to generate equivalent expressions. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Apply properties of operations as strategies to add, subtract, factor,\r\nand expand linear expressions with rational coefficients."}
        },
        {
            "competencyText": {"en-us": "Understand that rewriting an expression in different forms in a\r\nproblem context can shed light on the problem and how the quantities\r\nin it are related.<i> For example, a + 0.05a = 1.05a means that &ldquo;increase by\r\n5%&rdquo; is the same as &ldquo;multiply by 1.05.&rdquo;<\/i>"}
        },
        {
            "competencyText": {"en-us": "Solve real-life and mathematical problems using numerical and algebraic expressions and equations. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Solve multi-step real-life and mathematical problems posed with\r\npositive and negative rational numbers in any form (whole numbers,\r\nfractions, and decimals), using tools strategically. Apply properties of\r\noperations to calculate with numbers in any form; convert between\r\nforms as appropriate; and assess the reasonableness of answers using\r\nmental computation and estimation strategies.<i> For example: If a woman\r\nmaking $25 an hour gets a 10% raise, she will make an additional 1/10 of\r\nher salary an hour, or $2.50, for a new salary of $27.50. If you want to place\r\na towel bar 9 3/4 inches long in the center of a door that is 27 1/2 inches\r\nwide, you will need to place the bar about 9 inches from each edge; this\r\nestimate can be used as a check on the exact computation.<\/i><br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Use variables to represent quantities in a real-world or mathematical problem, and construct simple equations and inequalities to solve problems by reasoning about the quantities.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Solve word problems leading to equations of the form px + q = r and p(x + q) = r, where p, q, and r are specific rational numbers. Solve equations of these forms fluently. Compare an algebraic solution to an arithmetic solution, identifying the sequence of the operations used in each approach. <i>For example, the perimeter of a rectangle is 54 cm. Its length is 6 cm. What is its width?<\/i><\/li><li>Solve word problems leading to inequalities of the form px + q &gt; r or px + q &lt; r, where p, q, and r are specific rational numbers. Graph the solution set of the inequality and interpret it in the context of the problem.<i> For example: As a salesperson, you are paid $50 per week plus $3 per sale. This week you want your pay to be at least $100. Write an inequality for the number of sales you need to make, and describe the solutions.<\/i><\/li><\/ol>\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Geometry"}
        },
        {
            "competencyText": {"en-us": "Draw, construct, and describe geometrical figures and describe the relationships between them. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Solve problems involving scale drawings of geometric figures,\r\nincluding computing actual lengths and areas from a scale drawing\r\nand reproducing a scale drawing at a different scale."}
        },
        {
            "competencyText": {"en-us": "Draw (freehand, with ruler and protractor, and with technology)\r\ngeometric shapes with given conditions. Focus on constructing\r\ntriangles from three measures of angles or sides, noticing when the\r\nconditions determine a unique triangle, more than one triangle, or no\r\ntriangle."}
        },
        {
            "competencyText": {"en-us": "Describe the two-dimensional figures that result from slicing three-dimensional\r\nfigures, as in plane sections of right rectangular prisms\r\nand right rectangular pyramids."}
        },
        {
            "competencyText": {"en-us": "Solve real-life and mathematical problems involving angle measure, area, surface area, and volume. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Know the formulas for the area and circumference of a circle and use\r\nthem to solve problems; give an informal derivation of the relationship\r\nbetween the circumference and area of a circle."}
        },
        {
            "competencyText": {"en-us": "Use facts about supplementary, complementary, vertical, and adjacent\r\nangles in a multi-step problem to write and solve simple equations for\r\nan unknown angle in a figure."}
        },
        {
            "competencyText": {"en-us": "Solve real-world and mathematical problems involving area, volume\r\nand surface area of two- and three-dimensional objects composed of\r\ntriangles, quadrilaterals, polygons, cubes, and right prisms.<br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Statistics &amp; Probability"}
        },
        {
            "competencyText": {"en-us": "Use random sampling to draw inferences about a population. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that statistics can be used to gain information about a\r\npopulation by examining a sample of the population; generalizations\r\nabout a population from a sample are valid only if the sample is\r\nrepresentative of that population. Understand that random sampling\r\ntends to produce representative samples and support valid inferences."}
        },
        {
            "competencyText": {"en-us": "Use data from a random sample to draw inferences about a population\r\nwith an unknown characteristic of interest. Generate multiple samples\r\n(or simulated samples) of the same size to gauge the variation in\r\nestimates or predictions.<i> For example, estimate the mean word length in\r\na book by randomly sampling words from the book; predict the winner of\r\na school election based on randomly sampled survey data. Gauge how far\r\noff the estimate or prediction might be.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Draw informal comparative inferences about two populations. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Informally assess the degree of visual overlap of two numerical\r\ndata distributions with similar variabilities, measuring the difference\r\nbetween the centers by expressing it as a multiple of a measure of\r\nvariability.<i> For example, the mean height of players on the basketball\r\nteam is 10 cm greater than the mean height of players on the soccer team,\r\nabout twice the variability (mean absolute deviation) on either team; on\r\na dot plot, the separation between the two distributions of heights is\r\nnoticeable.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Use measures of center and measures of variability for numerical data\r\nfrom random samples to draw informal comparative inferences about\r\ntwo populations.<i> For example, decide whether the words in a chapter\r\nof a seventh-grade science book are generally longer than the words in a\r\nchapter of a fourth-grade science book.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Investigate chance processes and develop, use, and evaluate probability models. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that the probability of a chance event is a number\r\nbetween 0 and 1 that expresses the likelihood of the event occurring.\r\nLarger numbers indicate greater likelihood. A probability near 0\r\nindicates an unlikely event, a probability around 1/2 indicates an event\r\nthat is neither unlikely nor likely, and a probability near 1 indicates a\r\nlikely event."}
        },
        {
            "competencyText": {"en-us": "Approximate the probability of a chance event by collecting data on\r\nthe chance process that produces it and observing its long-run relative\r\nfrequency, and predict the approximate relative frequency given the\r\nprobability. <i>For example, when rolling a number cube 600 times, predict\r\nthat a 3 or 6 would be rolled roughly 200 times, but probably not exactly\r\n200 times.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Develop a probability model and use it to find probabilities of events. Compare probabilities from a model to observed frequencies; if the\r\nagreement is not good, explain possible sources of the discrepancy.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Develop a uniform probability model by assigning equal probability to all outcomes, and use the model to determine probabilities of events. <i>For example, if a student is selected at random from a class, find the probability that Jane will be selected and the probability that a girl will be selected.<\/i><\/li><li>Develop a probability model (which may not be uniform) by observing frequencies in data generated from a chance process.<i> For example, find the approximate probability that a spinning penny will land heads up or that a tossed paper cup will land open-end down. Do the outcomes for the spinning penny appear to be equally likely based on the observed frequencies?<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Find probabilities of compound events using organized lists, tables, tree diagrams, and simulation.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Understand that, just as with simple events, the probability of a compound event is the fraction of outcomes in the sample space for which the compound event occurs.<\/li><li>Represent sample spaces for compound events using methods such as organized lists, tables and tree diagrams. For an event described in everyday language (e.g., &ldquo;rolling double sixes&rdquo;), identify the outcomes in the sample space which compose the event.<\/li><li>Design and use a simulation to generate frequencies for compound events.<i> For example, use random digits as a simulation tool to approximate the answer to the question: If 40% of donors have type A blood, what is the probability that it will take at least 4 donors to find one with type A blood?<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Grade 8"}
        },
        {
            "competencyText": {"en-us": "The Number System"}
        },
        {
            "competencyText": {"en-us": "Know that there are numbers that are not rational, and approximate them by rational numbers. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Know that numbers that are not rational are called irrational.\r\nUnderstand informally that every number has a decimal expansion; for\r\nrational numbers show that the decimal expansion repeats eventually,\r\nand convert a decimal expansion which repeats eventually into a\r\nrational number."}
        },
        {
            "competencyText": {"en-us": "Use rational approximations of irrational numbers to compare the size\r\nof irrational numbers, locate them approximately on a number line\r\ndiagram, and estimate the value of expressions (e.g., &pi;&sup2;). <i>For example,\r\nby truncating the decimal expansion of &radic;2, show that &radic;2 is between 1 and\r\n2, then between 1.4 and 1.5, and explain how to continue on to get better\r\napproximations.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Expressions &amp; Equations"}
        },
        {
            "competencyText": {"en-us": "Work with radicals and integer exponents. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Know and apply the properties of integer exponents to generate\r\nequivalent numerical expressions. <i>For example, 3&sup2; &times;<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5490/img/Capture1.PNG\" />=<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5490/img/Capture2.PNG\" />=1/3&sup3;=1/27.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Use square root and cube root symbols to represent solutions to\r\nequations of the form x&sup2; = p and x&sup3; = p, where p is a positive rational\r\nnumber. Evaluate square roots of small perfect squares and cube roots\r\nof small perfect cubes. Know that &radic;2 is irrational."}
        },
        {
            "competencyText": {"en-us": "Use numbers expressed in the form of a single digit times an integer\r\npower of 10 to estimate very large or very small quantities, and to\r\nexpress how many times as much one is than the other.<i> For example,\r\nestimate the population of the United States as 3 &times; <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5492/img/Capture1.PNG\" /> and the population\r\nof the world as 7 &times; <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5492/img/Capture2.PNG\" />, and determine that the world population is more\r\nthan 20 times larger.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Perform operations with numbers expressed in scientific notation,\r\nincluding problems where both decimal and scientific notation are\r\nused. Use scientific notation and choose units of appropriate size\r\nfor measurements of very large or very small quantities (e.g., use\r\nmillimeters per year for seafloor spreading). Interpret scientific\r\nnotation that has been generated by technology."}
        },
        {
            "competencyText": {"en-us": "Understand the connections between proportional relationships, lines, and linear equations. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Graph proportional relationships, interpreting the unit rate as the\r\nslope of the graph. Compare two different proportional relationships\r\nrepresented in different ways.<i> For example, compare a distance-time\r\ngraph to a distance-time equation to determine which of two moving\r\nobjects has greater speed.<\/i><br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Use similar triangles to explain why the slope m is the same between\r\nany two distinct points on a non-vertical line in the coordinate plane;\r\nderive the equation y = mx for a line through the origin and the\r\nequation y = mx + b for a line intercepting the vertical axis at b."}
        },
        {
            "competencyText": {"en-us": "Analyze and solve linear equations and pairs of simultaneous linear equations. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Solve linear equations in one variable.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Give examples of linear equations in one variable with one solution, infinitely many solutions, or no solutions. Show which of these possibilities is the case by successively transforming the given equation into simpler forms, until an equivalent equation of the form x = a, a = a, or a = b results (where a and b are different numbers).<\/li><li>Solve linear equations with rational number coefficients, including equations whose solutions require expanding expressions using the distributive property and collecting like terms.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Analyze and solve pairs of simultaneous linear equations.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Understand that solutions to a system of two linear equations in two variables correspond to points of intersection of their graphs, because points of intersection satisfy both equations simultaneously.<\/li><li>Solve systems of two linear equations in two variables algebraically, and estimate solutions by graphing the equations. Solve simple cases by inspection. <i>For example, 3x + 2y = 5 and 3x + 2y = 6 have no solution because 3x + 2y cannot simultaneously be 5 and 6.<\/i><\/li><li>Solve real-world and mathematical problems leading to two linear\r\nequations in two variables. <i>For example, given coordinates for two pairs of points, determine whether the line through the first pair of points intersects the line through the second pair.<\/i><\/li><\/ol>\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Functions"}
        },
        {
            "competencyText": {"en-us": "Define, evaluate, and compare functions. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that a function is a rule that assigns to each input exactly\r\none output. The graph of a function is the set of ordered pairs\r\nconsisting of an input and the corresponding output."}
        },
        {
            "competencyText": {"en-us": "Compare properties of two functions each represented in a different\r\nway (algebraically, graphically, numerically in tables, or by verbal\r\ndescriptions).<i> For example, given a linear function represented by a table\r\nof values and a linear function represented by an algebraic expression,\r\ndetermine which function has the greater rate of change.<\/i><br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Interpret the equation y = mx + b as defining a linear function, whose\r\ngraph is a straight line; give examples of functions that are not linear.<i>\r\nFor example, the function A = s&sup2; giving the area of a square as a function\r\nof its side length is not linear because its graph contains the points (1,1),\r\n(2,4) and (3,9), which are not on a straight line.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Use functions to model relationships between quantities. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Construct a function to model a linear relationship between two\r\nquantities. Determine the rate of change and initial value of the\r\nfunction from a description of a relationship or from two (x, y) values,\r\nincluding reading these from a table or from a graph. Interpret the rate\r\nof change and initial value of a linear function in terms of the situation\r\nit models, and in terms of its graph or a table of values."}
        },
        {
            "competencyText": {"en-us": "Describe qualitatively the functional relationship between two\r\nquantities by analyzing a graph (e.g., where the function is increasing\r\nor decreasing, linear or nonlinear). Sketch a graph that exhibits the\r\nqualitative features of a function that has been described verbally."}
        },
        {
            "competencyText": {"en-us": "Geometry"}
        },
        {
            "competencyText": {"en-us": "Understand congruence and similarity using physical models, transparencies, or geometry software. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Verify experimentally the properties of rotations, reflections, and translations:\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Lines are taken to lines, and line segments to line segments of the same length.<\/li><li>Angles are taken to angles of the same measure.<\/li><li>Parallel lines are taken to parallel lines.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Understand that a two-dimensional figure is congruent to another if\r\nthe second can be obtained from the first by a sequence of rotations,\r\nreflections, and translations; given two congruent figures, describe a\r\nsequence that exhibits the congruence between them."}
        },
        {
            "competencyText": {"en-us": "Describe the effect of dilations, translations, rotations, and reflections\r\non two-dimensional figures using coordinates."}
        },
        {
            "competencyText": {"en-us": "Understand that a two-dimensional figure is similar to another if the second can be obtained from the first by a sequence of rotations, reflections, translations, and dilations; given two similar two-dimensional figures, describe a sequence that exhibits the similarity between them."}
        },
        {
            "competencyText": {"en-us": "Use informal arguments to establish facts about the angle sum and\r\nexterior angle of triangles, about the angles created when parallel lines\r\nare cut by a transversal, and the angle-angle criterion for similarity of\r\ntriangles.<i> For example, arrange three copies of the same triangle so that\r\nthe sum of the three angles appears to form a line, and give an argument\r\nin terms of transversals why this is so.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Understand and apply the Pythagorean Theorem. (Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Explain a proof of the Pythagorean Theorem and its converse."}
        },
        {
            "competencyText": {"en-us": "Apply the Pythagorean Theorem to determine unknown side lengths\r\nin right triangles in real-world and mathematical problems in two and\r\nthree dimensions.<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Apply the Pythagorean Theorem to find the distance between two\r\npoints in a coordinate system."}
        },
        {
            "competencyText": {"en-us": "Solve real-world and mathematical problems involving volume of cylinders, cones, and spheres. (Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Know the formulas for the volumes of cones, cylinders, and spheres\r\nand use them to solve real-world and mathematical problems.<br />"}
        },
        {
            "competencyText": {"en-us": "Statistics &amp; Probability"}
        },
        {
            "competencyText": {"en-us": "Investigate patterns of association in bivariate data. (Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Construct and interpret scatter plots for bivariate measurement\r\ndata to investigate patterns of association between two quantities.\r\nDescribe patterns such as clustering, outliers, positive or negative\r\nassociation, linear association, and nonlinear association."}
        },
        {
            "competencyText": {"en-us": "Know that straight lines are widely used to model relationships\r\nbetween two quantitative variables. For scatter plots that suggest a\r\nlinear association, informally fit a straight line, and informally assess\r\nthe model fit by judging the closeness of the data points to the line."}
        },
        {
            "competencyText": {"en-us": "Use the equation of a linear model to solve problems in the context\r\nof bivariate measurement data, interpreting the slope and intercept.\r\n<i>For example, in a linear model for a biology experiment, interpret a slope\r\nof 1.5 cm/hr as meaning that an additional hour of sunlight each day is\r\nassociated with an additional 1.5 cm in mature plant height.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Understand that patterns of association can also be seen in bivariate\r\ncategorical data by displaying frequencies and relative frequencies in\r\na two-way table. Construct and interpret a two-way table summarizing\r\ndata on two categorical variables collected from the same subjects.\r\nUse relative frequencies calculated for rows or columns to describe\r\npossible association between the two variables.<i> For example, collect\r\ndata from students in your class on whether or not they have a curfew on\r\nschool nights and whether or not they have assigned chores at home. Is\r\nthere evidence that those who have a curfew also tend to have chores?<\/i>"}
        },
        {
            "competencyText": {"en-us": "Grade 9-12"}
        },
        {
            "competencyText": {"en-us": "Number &amp; Quantity: The Real Number System"}
        },
        {
            "competencyText": {"en-us": "Extend the properties of exponents to rational exponents. (Algebra 1 - Major Cluster) (Algebra 2 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Explain how the definition of the meaning of rational exponents\r\nfollows from extending the properties of integer exponents to\r\nthose values, allowing for a notation for radicals in terms of rational\r\nexponents.<i> For example, we define&nbsp;<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5516/img/Capture2.PNG\" /> to be the cube root of 5\r\nbecause we want&nbsp;<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5516/img/Capture1.PNG\" /> = <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5516/img/Capture3.PNG\" /> to hold, so <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5516/img/Capture1.PNG\" /> must equal 5.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Rewrite expressions involving radicals and rational exponents using\r\nthe properties of exponents."}
        },
        {
            "competencyText": {"en-us": "Use properties of rational and irrational numbers.  (Algebra 1 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Explain why the sum or product of two rational numbers is rational;\r\nthat the sum of a rational number and an irrational number is irrational;\r\nand that the product of a nonzero rational number and an irrational\r\nnumber is irrational."}
        },
        {
            "competencyText": {"en-us": "Number &amp; Quantity: Quantities"}
        },
        {
            "competencyText": {"en-us": "Reason quantitatively and use units to solve problems. (Algebra 1 - Supporting Cluster) (Algebra 2 - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use units as a way to understand problems and to guide the solution\r\nof multi-step problems; choose and interpret units consistently in\r\nformulas; choose and interpret the scale and the origin in graphs and\r\ndata displays. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration: none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Define appropriate quantities for the purpose of descriptive modeling. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration: none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Choose a level of accuracy appropriate to limitations on measurement\r\nwhen reporting quantities. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration: none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Number &amp; Quantity: The Complex Number System"}
        },
        {
            "competencyText": {"en-us": "Perform arithmetic operations with complex numbers. (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Know there is a complex number i such that i&sup2; = &ndash;1, and every complex\r\nnumber has the form a + bi with a and b real."}
        },
        {
            "competencyText": {"en-us": "Use the relation i&sup2; = &ndash;1 and the commutative, associative, and\r\ndistributive properties to add, subtract, and multiply complex\r\nnumbers."}
        },
        {
            "competencyText": {"en-us": "Find the conjugate of a complex number; use conjugates to find\r\nmoduli and quotients of complex numbers."}
        },
        {
            "competencyText": {"en-us": "Represent complex numbers and their operations on the complex plane."}
        },
        {
            "competencyText": {"en-us": "Represent complex numbers on the complex plane in rectangular\r\nand polar form (including real and imaginary numbers), and explain\r\nwhy the rectangular and polar forms of a given complex number\r\nrepresent the same number."}
        },
        {
            "competencyText": {"en-us": "Represent addition, subtraction, multiplication, and conjugation of\r\ncomplex numbers geometrically on the complex plane; use properties\r\nof this representation for computation. For example, (&ndash;1 + &radic;3 i)&sup3; = 8\r\nbecause (&ndash;1 + &radic;3 i) has modulus 2 and argument 120&deg;."}
        },
        {
            "competencyText": {"en-us": "Calculate the distance between numbers in the complex plane as\r\nthe modulus of the difference, and the midpoint of a segment as the\r\naverage of the numbers at its endpoints."}
        },
        {
            "competencyText": {"en-us": "Use complex numbers in polynomial identities and equations. (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Solve quadratic equations with real coefficients that have complex\r\nsolutions."}
        },
        {
            "competencyText": {"en-us": "Extend polynomial identities to the complex numbers.<i> For example,\r\nrewrite x&sup2; + 4 as (x + 2i)(x &ndash; 2i).<\/i>"}
        },
        {
            "competencyText": {"en-us": "Know the Fundamental Theorem of Algebra; show that it is true for\r\nquadratic polynomials."}
        },
        {
            "competencyText": {"en-us": "Number &amp; Quantity: Vector &amp; Matrix Quantities"}
        },
        {
            "competencyText": {"en-us": "Represent and model with vector quantities."}
        },
        {
            "competencyText": {"en-us": "Recognize vector quantities as having both magnitude and\r\ndirection. Represent vector quantities by directed line segments, and\r\nuse appropriate symbols for vectors and their magnitudes (e.g., <em><strong>v<\/strong><\/em>, <strong><em>|v|<\/em><\/strong>,\r\n<strong>||v||<\/strong>, <strong><em>v<\/em><\/strong>)."}
        },
        {
            "competencyText": {"en-us": "Find the components of a vector by subtracting the coordinates of\r\nan initial point from the coordinates of a terminal point."}
        },
        {
            "competencyText": {"en-us": "Solve problems involving velocity and other quantities that can be\r\nrepresented by vectors."}
        },
        {
            "competencyText": {"en-us": "Perform operations on vectors."}
        },
        {
            "competencyText": {"en-us": "Add and subtract vectors.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Add vectors end-to-end, component-wise, and by the parallelogram rule. Understand that the magnitude of a sum of two vectors is typically not the sum of the magnitudes.<\/li><li>Given two vectors in magnitude and direction form, determine the magnitude and direction of their sum.<\/li><li>Understand vector subtraction <b>v<\/b> &ndash; <b>w<\/b> as <b>v<\/b> + (&ndash;<b>w<\/b>), where &ndash;<b>w<\/b> is the additive inverse of<b> w<\/b>, with the same magnitude as <b>w<\/b> and pointing in the opposite direction. Represent vector subtraction graphically by connecting the tips in the appropriate order, and perform vector subtraction component-wise.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Multiply a vector by a scalar.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Represent scalar multiplication graphically by scaling vectors and possibly reversing their direction; perform scalar multiplication component-wise, e.g., as c<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5535/img/Capture1.PNG\" /> = <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5535/img/Capture2.PNG\" />.<\/li><li>Compute the magnitude of a scalar multiple c<b>v<\/b> using ||c<b>v<\/b>|| = |c|v. Compute the direction of c<b>v<\/b> knowing that when |c|v &ne; 0, the direction of c<b>v<\/b> is either along <b>v<\/b> (for c &gt; 0) or against<b> v<\/b> (for c &lt; 0).<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Perform operations on matrices and use matrices in applications."}
        },
        {
            "competencyText": {"en-us": "Use matrices to represent and manipulate data, e.g., to represent\r\npayoffs or incidence relationships in a network."}
        },
        {
            "competencyText": {"en-us": "Multiply matrices by scalars to produce new matrices, e.g., as when\r\nall of the payoffs in a game are doubled."}
        },
        {
            "competencyText": {"en-us": "Add, subtract, and multiply matrices of appropriate dimensions."}
        },
        {
            "competencyText": {"en-us": "Understand that, unlike multiplication of numbers, matrix\r\nmultiplication for square matrices is not a commutative operation, but\r\nstill satisfies the associative and distributive properties."}
        },
        {
            "competencyText": {"en-us": "Understand that the zero and identity matrices play a role in matrix\r\naddition and multiplication similar to the role of 0 and 1 in the real\r\nnumbers. The determinant of a square matrix is nonzero if and only if\r\nthe matrix has a multiplicative inverse."}
        },
        {
            "competencyText": {"en-us": "Multiply a vector (regarded as a matrix with one column) by a\r\nmatrix of suitable dimensions to produce another vector. Work with\r\nmatrices as transformations of vectors."}
        },
        {
            "competencyText": {"en-us": "Work with 2 &times; 2 matrices as transformations of the plane, and\r\ninterpret the absolute value of the determinant in terms of area."}
        },
        {
            "competencyText": {"en-us": "Algebra: Seeing Structure in Expressions"}
        },
        {
            "competencyText": {"en-us": "Interpret the structure of expressions. (Algebra 1 - Major Cluster) (Algebra 2 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Interpret expressions that represent a quantity in terms of its context. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration: none;\">&#9733;<\/a>\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Interpret parts of an expression, such as terms, factors, and coefficients.<\/li><li>Interpret complicated expressions by viewing one or more of their parts as a single entity. <i>For example, interpret <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5543/img/Capture1.PNG\" /> as the product of P and a factor not depending on P.<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Use the structure of an expression to identify ways to rewrite it.<i> For\r\nexample, see x<sup>4<\/sup>- y<sup>4<\/sup> as (x&sup2;)&sup2; &ndash; (y&sup2;)&sup2;, thus recognizing it as a difference of\r\nsquares that can be factored as (x&sup2; &ndash; y&sup2;)(x&sup2; + y&sup2;).<\/i><br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Write expressions in equivalent forms to solve problems. (Algebra 1 - Supporting Cluster) (Algebra 2 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "<p>Choose and produce an equivalent form of an expression to reveal and explain properties of the quantity represented by the expression.<a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\">&#9733;<\/a><\/p><ol style=\"list-style-type: lower-alpha;\">\r\n<li>Factor a quadratic expression to reveal the zeros of the function it defines.<\/li><li>Complete the square in a quadratic expression to reveal the maximum or minimum value of the function it defines.<\/li><li>Use the properties of exponents to transform expressions for exponential functions.<i> For example the expression <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5545/img/Capture1.PNG\" /> can be rewritten as <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5545/img/Capture2.PNG\" /> &asymp; <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5545/img/Capture3.PNG\" /> to reveal the approximate equivalent monthly interest rate if the annual rate is 15%.<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Derive the formula for the sum of a finite geometric series (when the\r\ncommon ratio is not 1), and use the formula to solve problems.<i> For\r\n example, calculate mortgage payments.<\/i> <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Algebra: Arithmetic with Polynomials &amp; Rational Expressions"}
        },
        {
            "competencyText": {"en-us": "Perform arithmetic operations on polynomials. (Algebra 1 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that polynomials form a system analogous to the integers,\r\nnamely, they are closed under the operations of addition, subtraction,\r\nand multiplication; add, subtract, and multiply polynomials."}
        },
        {
            "competencyText": {"en-us": "Understand the relationship between zeros and factors of polynomials.  (Algebra 1 - Supporting Cluster) (Algebra 2 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Know and apply the Remainder Theorem: For a polynomial p(x) and a\r\nnumber a, the remainder on division by x &ndash; a is p(a), so p(a) = 0 if and\r\nonly if (x &ndash; a) is a factor of p(x)."}
        },
        {
            "competencyText": {"en-us": "Identify zeros of polynomials when suitable factorizations are available, and use the zeros to construct a rough graph of the function\r\ndefined by the polynomial.<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Use polynomial identities to solve problems. (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Prove polynomial identities and use them to describe numerical\r\nrelationships. For example, the polynomial identity (x&sup2; + y&sup2;)&sup2; = (x&sup2; &ndash; y&sup2;)&sup2; +\r\n(2xy)&sup2; can be used to generate Pythagorean triples."}
        },
        {
            "competencyText": {"en-us": "Know and apply the Binomial Theorem for the expansion of (x<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5551/img/Capture1.PNG\" /> in powers of x and y for a positive integer n, where x and y are\r\nany numbers, with coefficients determined for example by Pascal&rsquo;s\r\nTriangle."}
        },
        {
            "competencyText": {"en-us": "Rewrite rational expressions. (Algebra 2 - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Rewrite simple rational expressions in different forms; write a(x)/b(x)\r\nin the form q(x) + r(x)/b(x), where a(x), b(x), q(x), and r(x) are\r\npolynomials with the degree of r(x) less than the degree of b(x), using\r\ninspection, long division, or, for the more complicated examples, a\r\ncomputer algebra system.<br />"}
        },
        {
            "competencyText": {"en-us": "Understand that rational expressions form a system analogous\r\nto the rational numbers, closed under addition, subtraction,\r\nmultiplication, and division by a nonzero rational expression; add,\r\nsubtract, multiply, and divide rational expressions."}
        },
        {
            "competencyText": {"en-us": "Algebra: Creating Equations"}
        },
        {
            "competencyText": {"en-us": "Create equations that describe numbers or relationships. (Algebra 1 - Major Cluster) (Algebra 2 - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Create equations and inequalities in one variable and use them to solve problems. Include equations arising from linear and quadratic functions, and simple rational, absolute, and exponential functions. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Create equations in two or more variables to represent relationships\r\nbetween quantities; graph equations on coordinate axes with labels\r\nand scales. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Represent constraints by equations or inequalities, and by systems of\r\nequations and/or inequalities, and interpret solutions as viable or non-viable\r\noptions in a modeling context.<i> For example, represent inequalities\r\ndescribing nutritional and cost constraints on combinations of different\r\nfoods.<\/i> <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration: none;\"><\/a><a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration-line: none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Rearrange formulas to highlight a quantity of interest, using the same\r\nreasoning as in solving equations.<i> For example, rearrange Ohm&rsquo;s law V =\r\nIR to highlight resistance R.<\/i> <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Algebra: Reasoning with Equations &amp; Inequalities"}
        },
        {
            "competencyText": {"en-us": "Understand solving equations as a process of reasoning and explain the reasoning.  (Algebra 1 - Major Cluster) (Algebra 2 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Explain each step in solving a simple equation as following from the\r\nequality of numbers asserted at the previous step, starting from the\r\nassumption that the original equation has a solution. Construct a\r\nviable argument to justify a solution method. <br /><br />"}
        },
        {
            "competencyText": {"en-us": "Solve simple rational and radical equations in one variable, and give\r\nexamples showing how extraneous solutions may arise."}
        },
        {
            "competencyText": {"en-us": "Solve equations and inequalities in one variable. (Algebra 1 - Major Cluster) (Algebra 2 - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "<p>Solve linear equations and inequalities in one variable, including\r\nequations with coefficients represented by letters. <\/p>"}
        },
        {
            "competencyText": {"en-us": "Solve quadratic equations in one variable.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Use the method of completing the square to transform any quadratic equation in x into an equation of the form (x &ndash; p)&sup2; = q that has the same solutions. Derive the quadratic formula from this form.<\/li><li>Solve quadratic equations by inspection (e.g., for x&sup2; = 49), taking\r\nsquare roots, completing the square, the quadratic formula and factoring, as appropriate to the initial form of the equation. Recognize when the quadratic formula gives complex solutions and write them as<i> a &plusmn; bi<\/i> for real numbers a and b.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Solve systems of equations. (Algebra 1 - Additional Cluster) (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Prove that, given a system of two equations in two variables, replacing\r\none equation by the sum of that equation and a multiple of the other\r\nproduces a system with the same solutions."}
        },
        {
            "competencyText": {"en-us": "Solve systems of linear equations exactly and approximately (e.g., with graphs), focusing on pairs of linear equations in two variables.<br /><br />\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Solve a simple system consisting of a linear equation and a quadratic\r\nequation in two variables algebraically and graphically.<i> For example,\r\nfind the points of intersection between the line y = &ndash;3x and the circle x&sup2; +\r\ny&sup2; = 3.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Represent a system of linear equations as a single matrix equation\r\nin a vector variable."}
        },
        {
            "competencyText": {"en-us": "Find the inverse of a matrix if it exists and use it to solve systems\r\nof linear equations (using technology for matrices of dimension 3 &times; 3\r\nor greater)."}
        },
        {
            "competencyText": {"en-us": "Represent and solve equations and inequalities graphically. (Algebra 1 - Major Cluster) (Algebra 2 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that the graph of an equation in two variables is the set of\r\nall its solutions plotted in the coordinate plane, often forming a curve\r\n(which could be a line)."}
        },
        {
            "competencyText": {"en-us": "Explain why the x-coordinates of the points where the graphs of\r\nthe equations y = f(x) and y = g(x) intersect are the solutions of the\r\nequation f(x) = g(x); find the solutions approximately, e.g., using\r\ntechnology to graph the functions, make tables of values, or find\r\nsuccessive approximations. Include cases where f(x) and/or g(x)\r\nare linear, polynomial, rational, absolute value, exponential, and\r\nlogarithmic functions. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Graph the solutions to a linear inequality in two variables as a half-plane\r\n(excluding the boundary in the case of a strict inequality), and\r\ngraph the solution set to a system of linear inequalities in two variables\r\nas the intersection of the corresponding half-planes."}
        },
        {
            "competencyText": {"en-us": "Functions: Interpreting Functions"}
        },
        {
            "competencyText": {"en-us": "Understand the concept of a function and use function notation. (Algebra 1 - Major Cluster) (Algebra 2 - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that a function from one set (called the domain) to\r\nanother set (called the range) assigns to each element of the domain\r\nexactly one element of the range. If f is a function and x is an element\r\nof its domain, then f(x) denotes the output of f corresponding to the\r\ninput x. The graph of f is the graph of the equation y = f(x)."}
        },
        {
            "competencyText": {"en-us": "Use function notation, evaluate functions for inputs in their domains,\r\nand interpret statements that use function notation in terms of a\r\ncontext."}
        },
        {
            "competencyText": {"en-us": "Recognize that sequences are functions, sometimes defined\r\nrecursively, whose domain is a subset of the integers. For example, the\r\nFibonacci sequence is defined recursively by f(0) = f(1) = 1, f(n+1) = f(n) +\r\nf(n-1) for n &ge; 1.<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Interpret functions that arise in applications in terms of the context. (Algebra 1 - Major Cluster) (Algebra 2 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "For a function that models a relationship between two quantities,\r\ninterpret key features of graphs and tables in terms of the quantities,\r\nand sketch graphs showing key features given a verbal description\r\nof the relationship. <i>Key features include: intercepts; intervals where the\r\nfunction is increasing, decreasing, positive, or negative; relative maximums\r\nand minimums; symmetries; end behavior; and periodicity.<\/i> <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Relate the domain of a function to its graph and, where applicable, to\r\nthe quantitative relationship it describes. <i>For example, if the function\r\nh(n) gives the number of person-hours it takes to assemble engines in a\r\n factory, then the positive integers would be an appropriate domain for the\r\nfunction.<\/i> <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Calculate and interpret the average rate of change of a function\r\n(presented symbolically or as a table) over a specified interval.\r\nEstimate the rate of change from a graph. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Analyze functions using different representations. (Algebra 1 - Supporting Cluster) (Algebra 2 - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Graph functions expressed symbolically and show key features of the graph, by hand in simple cases and using technology for more complicated cases. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a><p><\/p><ol style=\"list-style-type: lower-alpha;\"><li>Graph linear and quadratic functions and show intercepts, maxima, and minima.<\/li><li>Graph square root, cube root, and piecewise-defined functions, including step functions and absolute value functions. <\/li><li>Graph polynomial functions, identifying zeros when suitable factorizations are available, and showing end behavior.&nbsp;<\/li><li>Graph rational functions, identifying zeros and asymptotes when suitable factorizations are available, and showing end behavior.&nbsp;<\/li><li>Graph exponential and logarithmic functions, showing intercepts and end behavior, and trigonometric functions, showing period, midline, and amplitude, and using phase shift.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Write a function defined by an expression in different but equivalent forms to reveal and explain different properties of the function.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Use the process of factoring and completing the square in a quadratic function to show zeros, extreme values, and symmetry of the graph, and interpret these in terms of a context.<\/li><li>Use the properties of exponents to interpret expressions for exponential functions. <i>For example, identify percent rate of change in functions such as y = <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5577/img/Capture.PNG\" />, y = <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5577/img/Capture1.PNG\" />, y = <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5577/img/Capture4.PNG\" />, y = <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5577/img/Capture3.PNG\" />, and classify them as representing exponential growth or decay.<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Compare properties of two functions each represented in a different\r\nway (algebraically, graphically, numerically in tables, or by verbal\r\ndescriptions)<i>. For example, given a graph of one quadratic function and\r\nan algebraic expression for another, say which has the larger maximum.<\/i><br /><br />"}
        },
        {
            "competencyText": {"en-us": "Functions: Building Functions"}
        },
        {
            "competencyText": {"en-us": "Build a function that models a relationship between two quantities. (Algebra 1 - Supporting Cluster) (Algebra 2 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Write a function that describes a relationship between two quantities. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a><ol style=\"list-style-type: lower-alpha;\">\r\n<li>Determine an explicit expression, a recursive process, or steps for calculation from a context.<\/li><li>Combine standard function types using arithmetic operations.<i> For example, build a function that models the temperature of a cooling body by adding a constant function to a decaying exponential, and relate these functions to the model.<\/i><\/li><li>Compose functions.<i> For example, if T(y) is the temperature in the atmosphere as a function of height, and h(t) is the height of a weather balloon as a function of time, then T(h(t)) is the temperature at the location of the weather balloon as a function of time.<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Write arithmetic and geometric sequences both recursively and\r\nwith an explicit formula, use them to model situations, and translate\r\nbetween the two forms. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Build new functions from existing functions. (Algebra 1 - Additional Cluster) (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Identify the effect on the graph of replacing f(x) by f(x) + k, k f(x),\r\nf(kx), and f(x + k) for specific values of k (both positive and negative);\r\nfind the value of k given the graphs. Experiment with cases and\r\nillustrate an explanation of the effects on the graph using technology.\r\n<i>Include recognizing even and odd functions from their graphs and\r\nalgebraic expressions for them.<\/i><br /><br />"}
        },
        {
            "competencyText": {"en-us": "Find inverse functions.\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Solve an equation of the form f(x) = c for a simple function f that has an inverse and write an expression for the inverse.<i> For example, f(x) =2 x&sup3; or f(x) = (x+1)/(x&ndash;1) for x &ne; 1.<\/i><\/li><li>Verify by composition that one function is the inverse of another.<\/li><li>Read values of an inverse function from a graph or a table, given that the function has an inverse.<\/li><li>Produce an invertible function from a non-invertible function by restricting the domain.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Understand the inverse relationship between exponents and\r\nlogarithms and use this relationship to solve problems involving\r\nlogarithms and exponents."}
        },
        {
            "competencyText": {"en-us": "Use the change of base formula."}
        },
        {
            "competencyText": {"en-us": "Functions: Linear, Quadratic, &amp; Exponential Models"}
        },
        {
            "competencyText": {"en-us": "Construct and compare linear, quadratic, and exponential models and solve problems. (Algebra 1 - Supporting Cluster) (Algebra 2 - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Distinguish between situations that can be modeled with linear functions and with exponential functions. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a><ol style=\"list-style-type: lower-alpha;\">\r\n<li>Prove that linear functions grow by equal differences over equal intervals, and that exponential functions grow by equal factors over equal intervals.<\/li><li>Recognize situations in which one quantity changes at a constant rate per unit interval relative to another.<\/li><li>Recognize situations in which a quantity grows or decays by a constant percent rate per unit interval relative to another.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Construct linear and exponential functions, including arithmetic and\r\ngeometric sequences, given a graph, a description of a relationship, or\r\ntwo input-output pairs (include reading these from a table). <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Observe using graphs and tables that a quantity increasing\r\nexponentially eventually exceeds a quantity increasing linearly,\r\nquadratically, or (more generally) as a polynomial function. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "For exponential models, express as a logarithm the solution to <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/5587/img/Capture1.PNG\" /> = d where a, c, and d are numbers and the base b is 2, 10, or e;\r\nevaluate the logarithm using technology. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Interpret expressions for functions in terms of the situation they model. (Algebra 1 - Supporting Cluster) (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Interpret the parameters in a linear or exponential function in terms of\r\na context. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Functions: Trigonometric Functions"}
        },
        {
            "competencyText": {"en-us": "Extend the domain of trigonometric functions using the unit circle. (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand radian measure of an angle as the length of the arc on the unit circle subtended by the angle; Convert between degrees and radians."}
        },
        {
            "competencyText": {"en-us": "Explain how the unit circle in the coordinate plane enables the\r\nextension of trigonometric functions to all real numbers, interpreted as\r\nradian measures of angles traversed counterclockwise around the unit\r\ncircle."}
        },
        {
            "competencyText": {"en-us": "Use special triangles to determine geometrically the values of sine,\r\ncosine, tangent for &pi;/3, &pi;/4 and &pi;/6, and use the unit circle to express\r\nthe values of sine, cosine, and tangent for &pi;&ndash;x, &pi;+x, and 2&pi;&ndash;x in terms\r\nof their values for x, where x is any real number."}
        },
        {
            "competencyText": {"en-us": "Use the unit circle to explain symmetry (odd and even) and\r\nperiodicity of trigonometric functions."}
        },
        {
            "competencyText": {"en-us": "Model periodic phenomena with trigonometric functions. (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Choose trigonometric functions to model periodic phenomena with\r\nspecified amplitude, frequency, and midline. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Understand that restricting a trigonometric function to a domain\r\non which it is always increasing or always decreasing allows its inverse\r\nto be constructed."}
        },
        {
            "competencyText": {"en-us": "Use inverse functions to solve trigonometric equations that arise\r\nin modeling contexts; evaluate the solutions using technology, and\r\ninterpret them in terms of the context. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Prove and apply trigonometric identities. (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Prove the Pythagorean identity sin&sup2;(&theta;) + cos&sup2;(&theta;) = 1 and use it to calculate trigonometric ratios."}
        },
        {
            "competencyText": {"en-us": "Prove the addition and subtraction, half-angle, and double-angle formulas for sine, cosine, and tangent and use these formulas to solve problems."}
        },
        {
            "competencyText": {"en-us": "Geometry: Congruence"}
        },
        {
            "competencyText": {"en-us": "Experiment with transformations in the plane. (Geometry - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Know precise definitions of angle, circle, perpendicular line, parallel\r\nline, and line segment, based on the undefined notions of point, line,\r\ndistance along a line, and distance around a circular arc."}
        },
        {
            "competencyText": {"en-us": "Represent transformations in the plane using, e.g., transparencies\r\nand geometry software; describe transformations as functions that\r\ntake points in the plane as inputs and give other points as outputs.\r\nCompare transformations that preserve distance and angle to those\r\nthat do not (e.g., translation versus horizontal stretch)."}
        },
        {
            "competencyText": {"en-us": "Given a rectangle, parallelogram, trapezoid, or regular polygon,\r\ndescribe the rotations and reflections that carry it onto itself."}
        },
        {
            "competencyText": {"en-us": "Develop definitions of rotations, reflections, and translations in terms\r\nof angles, circles, perpendicular lines, parallel lines, and line segments."}
        },
        {
            "competencyText": {"en-us": "Given a geometric figure and a rotation, reflection, or translation,\r\ndraw the transformed figure using, e.g., graph paper, tracing paper, or\r\ngeometry software. Specify a sequence of transformations that will\r\ncarry a given figure onto another."}
        },
        {
            "competencyText": {"en-us": "Understand congruence in terms of rigid motions. (Geometry - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use geometric descriptions of rigid motions to transform figures and\r\nto predict the effect of a given rigid motion on a given figure; given\r\ntwo figures, use the definition of congruence in terms of rigid motions\r\nto decide if they are congruent."}
        },
        {
            "competencyText": {"en-us": "Use the definition of congruence in terms of rigid motions to show\r\nthat two triangles are congruent if and only if corresponding pairs of\r\nsides and corresponding pairs of angles are congruent."}
        },
        {
            "competencyText": {"en-us": "Explain how the criteria for triangle congruence (ASA, SAS, SSS, and Hypotenuse-Leg) follow from the definition of congruence in terms of rigid motions."}
        },
        {
            "competencyText": {"en-us": "Prove geometric theorems. (Geometry - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Prove theorems about lines and angles; use theorems about lines and angles to solve problems. <i>Theorems include: vertical angles are congruent; when a transversal crosses parallel lines, alternate interior angles are congruent and corresponding angles are congruent; points on a perpendicular bisector of a line segment are exactly those equidistant from the segment&rsquo;s endpoints.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Prove theorems about triangles; use theorems about triangles to solve problems. <i>Theorems include: measures of interior angles of a triangle sum to 180&deg;; triangle inequality theorem; base angles of isosceles triangles are congruent; the segment joining midpoints of two sides of a triangle is parallel to the third side and half the length; the medians of a triangle meet at a point.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Prove theorems about parallelograms; use theorems about parallelograms to solve problems. <i>Theorems include: opposite sides are congruent, opposite angles are congruent, the diagonals of a parallelogram bisect each other, and conversely, rectangles are parallelograms with congruent diagonals.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Make geometric constructions. (Geometry - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Make formal geometric constructions with a variety of tools and\r\nmethods (compass and straightedge, string, reflective devices,\r\npaper folding, dynamic geometric software, etc.).<i> Copying a segment;\r\ncopying an angle; bisecting a segment; bisecting an angle; constructing\r\nperpendicular lines, including the perpendicular bisector of a line segment;\r\nand constructing a line parallel to a given line through a point not on the\r\nline.<\/i>\r\n<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Construct an equilateral triangle, a square, and a regular hexagon\r\ninscribed in a circle."}
        },
        {
            "competencyText": {"en-us": "Geometry: Similarity, Right Triangles, &amp; Trigonometry"}
        },
        {
            "competencyText": {"en-us": "Understand similarity in terms of similarity transformations. (Geometry - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Verify experimentally the properties of dilations given by a center and a scale factor:\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>A dilation takes a line not passing through the center of the dilation to a parallel line, and leaves a line passing through the center unchanged.<\/li><li>The dilation of a line segment is longer or shorter in the ratio given by the scale factor.<\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Given two figures, use the definition of similarity in terms of similarity\r\ntransformations to decide if they are similar; explain using similarity\r\ntransformations the meaning of similarity for triangles as the equality\r\nof all corresponding pairs of angles and the proportionality of all\r\ncorresponding pairs of sides."}
        },
        {
            "competencyText": {"en-us": "Use the properties of similarity transformations to establish the AA\r\ncriterion for two triangles to be similar."}
        },
        {
            "competencyText": {"en-us": "Prove theorems involving similarity. (Geometry - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Prove theorems about triangles. <i>Theorems include: a line parallel to one\r\nside of a triangle divides the other two proportionally, and conversely; the\r\nPythagorean Theorem proved using triangle similarity.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Use congruence and similarity criteria for triangles to solve problems\r\nand to prove relationships in geometric figures.<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Define trigonometric ratios and solve problems involving right triangles. (Geometry - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand that by similarity, side ratios in right triangles are\r\nproperties of the angles in the triangle, leading to definitions of\r\ntrigonometric ratios for acute angles."}
        },
        {
            "competencyText": {"en-us": "Explain and use the relationship between the sine and cosine of\r\ncomplementary angles."}
        },
        {
            "competencyText": {"en-us": "Use trigonometric ratios and the Pythagorean Theorem to solve right\r\ntriangles in applied problems. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Apply trigonometry to general triangles"}
        },
        {
            "competencyText": {"en-us": "Derive the formula A = 1/2 ab sin(C) for the area of a triangle by\r\ndrawing an auxiliary line from a vertex perpendicular to the opposite\r\nside."}
        },
        {
            "competencyText": {"en-us": "Prove the Laws of Sines and Cosines and use them to solve\r\nproblems."}
        },
        {
            "competencyText": {"en-us": "Understand and apply the Law of Sines and the Law of Cosines\r\nto find unknown measurements in right and non-right triangles (e.g.,\r\nsurveying problems, resultant forces)."}
        },
        {
            "competencyText": {"en-us": "Geometry: Circles"}
        },
        {
            "competencyText": {"en-us": "Understand and apply theorems about circles. (Geometry - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Prove that all circles are similar."}
        },
        {
            "competencyText": {"en-us": "Identify and describe relationships among inscribed angles, radii,\r\nand chords.<i> Include the relationship between central, inscribed, and\r\ncircumscribed angles; inscribed angles on a diameter are right angles;\r\nthe radius of a circle is perpendicular to the tangent where the radius\r\nintersects the circle.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Construct the inscribed and circumscribed circles of a triangle, and\r\nprove properties of angles for a quadrilateral inscribed in a circle."}
        },
        {
            "competencyText": {"en-us": "Construct a tangent line from a point outside a given circle to the\r\ncircle."}
        },
        {
            "competencyText": {"en-us": "Find arc lengths and areas of sectors of circles. (Geometry - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Derive using similarity the fact that the length of the arc intercepted\r\nby an angle is proportional to the radius, and define the radian\r\nmeasure of the angle as the constant of proportionality; derive the\r\nformula for the area of a sector."}
        },
        {
            "competencyText": {"en-us": "Geometry: Expressing Geometric Properties with Equations"}
        },
        {
            "competencyText": {"en-us": "Translate between the geometric description and the equation for a conic section. (Geometry - Additional Cluster) (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Derive the equation of a circle of given center and radius using the\r\nPythagorean Theorem; complete the square to find the center and\r\nradius of a circle given by an equation."}
        },
        {
            "competencyText": {"en-us": "Derive the equation of a parabola given a focus and directrix."}
        },
        {
            "competencyText": {"en-us": "Derive the equations of ellipses and hyperbolas given the foci and directrices."}
        },
        {
            "competencyText": {"en-us": "Use coordinates to prove simple geometric theorems algebraically. (Geometry - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use coordinates to prove simple geometric theorems algebraically.<i> For \r\nexample, prove or disprove that a figure defined by four given points in the\r\ncoordinate plane is a rectangle; prove or disprove that the point (1, &radic;3) lies\r\non the circle centered at the origin and containing the point (0, 2).<\/i>\r\n<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Prove the slope criteria for parallel and perpendicular lines and use\r\nthem to solve geometric problems (e.g., find the equation of a line\r\nparallel or perpendicular to a given line that passes through a given\r\npoint).\r\n<br /><br />"}
        },
        {
            "competencyText": {"en-us": "Find the point on a directed line segment between two given points\r\nthat partitions the segment in a given ratio."}
        },
        {
            "competencyText": {"en-us": "Use coordinates to compute perimeters of polygons and areas of\r\ntriangles and rectangles, e.g., using the distance formula.\r\n<a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Geometry: Geometric Measurement &amp; Dimension"}
        },
        {
            "competencyText": {"en-us": "Explain volume formulas and use them to solve problems. (Geometry - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Give an informal argument for the formulas for the circumference of\r\na circle, area of a circle, volume of a cylinder, pyramid, and cone. <i>Use\r\ndissection arguments, Cavalieri&rsquo;s principle, and informal limit arguments.<\/i>"}
        },
        {
            "competencyText": {"en-us": "Give an informal argument using Cavalieri&rsquo;s principle for the\r\nformulas for the volume of a sphere and other solid figures."}
        },
        {
            "competencyText": {"en-us": "Use volume formulas for cylinders, pyramids, cones, and spheres to\r\nsolve problems. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Visualize relationships between two-dimensional and three-dimensional objects. (Geometry - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Identify the shapes of two-dimensional cross-sections of three-dimensional\r\nobjects, and identify three-dimensional objects generated\r\nby rotations of two-dimensional objects."}
        },
        {
            "competencyText": {"en-us": "Geometry: Modeling with Geometry"}
        },
        {
            "competencyText": {"en-us": "Apply geometric concepts in modeling situations. (Geometry - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Use geometric shapes, their measures, and their properties to describe\r\nobjects (e.g., modeling a tree trunk or a human torso as a cylinder). <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Apply concepts of density based on area and volume in modeling\r\nsituations (e.g., persons per square mile, BTUs per cubic foot). <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Apply geometric methods to solve design problems (e.g., designing\r\nan object or structure to satisfy physical constraints or minimize cost;\r\n working with typographic grid systems based on ratios). <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Statistics &amp; Probability: Interpreting Categorical &amp; Quantitative Data"}
        },
        {
            "competencyText": {"en-us": "Summarize, represent, and interpret data on a single count or measurement variable. (Algebra 1 - Additional Cluster) (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Represent data with plots on the real number line (dot plots,\r\nhistograms, and box plots). <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Use statistics appropriate to the shape of the data distribution to\r\ncompare center (median, mean) and spread (interquartile range,\r\nstandard deviation) of two or more different data sets. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Interpret differences in shape, center, and spread in the context of\r\nthe data sets, accounting for possible effects of extreme data points \r\n(outliers). <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Use the mean and standard deviation of a data set to fit it to a normal \r\ndistribution and to estimate population percentages. Recognize that\r\nthere are data sets for which such a procedure is not appropriate.\r\n Use calculators, spreadsheets, and tables to estimate areas under the\r\nnormal curve. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Summarize, represent, and interpret data on two categorical and quantitative variables. (Algebra 1 - Supporting Cluster) (Algebra 2 - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Summarize categorical data for two categories in two-way frequency\r\ntables. Interpret relative frequencies in the context of the data\r\n(including joint, marginal, and conditional relative frequencies).\r\n Recognize possible associations and trends in the data. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Represent data on two quantitative variables on a scatter plot, and describe how the variables are related. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a><ol style=\"list-style-type: lower-alpha;\">\r\n<li>Fit a function to the data; use functions fitted to data to solve problems in the context of the data.<i> Use given functions or choose a function suggested by the context. Emphasize linear, and exponential models.<\/i><\/li><li>Informally assess the fit of a function by plotting and analyzing residuals.<\/li><li>Fit a linear function for a scatter plot that suggests a linear association.<\/li><\/ol>\r\n<br />"}
        },
        {
            "competencyText": {"en-us": "Interpret linear models. (Algebra 1 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Interpret the slope (rate of change) and the intercept (constant term)\r\nof a linear model in the context of the data. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Compute (using technology) and interpret the correlation coefficient\r\nof a linear fit. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Distinguish between correlation and causation. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Statistics &amp; Probability: Making Inferences &amp; Justifying Conclusions"}
        },
        {
            "competencyText": {"en-us": "Understand and evaluate random processes underlying statistical experiments. (Algebra 2 - Supporting Cluster)"}
        },
        {
            "competencyText": {"en-us": "Understand statistics as a process for making inferences about\r\npopulation parameters based on a random sample from that\r\npopulation. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Decide if a specified model is consistent with results from a given\r\ndata-generating process, e.g., using simulation. <i>For example, a model\r\nsays a spinning coin falls heads up with probability 0.5. Would a result of 5\r\ntails in a row cause you to question the model <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" target=\"_blank\" title=\"Modeling Standards\">&#9733;<\/a><\/i>"}
        },
        {
            "competencyText": {"en-us": "Make inferences and justify conclusions from sample surveys, experiments, and observational studies. (Algebra 2 - Major Cluster)"}
        },
        {
            "competencyText": {"en-us": "Recognize the purposes of and differences among sample surveys,\r\nexperiments, and observational studies; explain how randomization\r\nrelates to each. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Use data from a sample survey to estimate a population mean or\r\nproportion; develop a margin of error through the use of simulation\r\nmodels for random sampling. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Use data from a randomized experiment to compare two treatments;\r\nuse simulations to decide if differences between parameters are\r\nsignificant. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Evaluate reports based on data. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Statistics &amp; Probability: Conditional Probability &amp; the Rules of Probability"}
        },
        {
            "competencyText": {"en-us": "Understand independence and conditional probability and use them to interpret data. (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Describe events as subsets of a sample space (the set of outcomes)\r\nusing characteristics (or categories) of the outcomes, or as unions,\r\nintersections, or complements of other events (&ldquo;or,&rdquo; &ldquo;and,&rdquo; &ldquo;not&rdquo;). <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Understand that two events A and B are independent if the probability\r\nof A and B occurring together is the product of their probabilities, and\r\nuse this characterization to determine if they are independent. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Understand the conditional probability of A given B as P(A and\r\nB)/P(B), and interpret independence of A and B as saying that the\r\nconditional probability of A given B is the same as the probability\r\nof A, and the conditional probability of B given A is the same as the\r\nprobability of B. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Construct and interpret two-way frequency tables of data when two\r\ncategories are associated with each object being classified. Use the\r\ntwo-way table as a sample space to decide if events are independent\r\nand to approximate conditional probabilities. <i>For example, collect\r\ndata from a random sample of students in your school on their favorite\r\nsubject among math, science, and English. Estimate the probability that a\r\nrandomly selected student from your school will favor science given that\r\nthe student is in tenth grade. Do the same for other subjects and compare\r\nthe results.<\/i> <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Recognize and explain the concepts of conditional probability and\r\nindependence in everyday language and everyday situations.<i> For\r\nexample, compare the chance of having lung cancer if you are a smoker\r\nwith the chance of being a smoker if you have lung cancer.<\/i> <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Use the rules of probability to compute probabilities of compound events in a uniform probability model. (Algebra 2 - Additional Cluster)"}
        },
        {
            "competencyText": {"en-us": "Find the conditional probability of A given B as the fraction of B&rsquo;s\r\noutcomes that also belong to A, and interpret the answer in terms of\r\nthe model. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Apply the Addition Rule, P(A or B) = P(A) + P(B) &ndash; P(A and B), and\r\ninterpret the answer in terms of the model. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Apply the general Multiplication Rule in a uniform probability\r\nmodel, P(A and B) = P(A)P(B|A) = P(B)P(A|B), and interpret the answer\r\nin terms of the model. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Use permutations and combinations to compute probabilities of\r\ncompound events and solve problems. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Statistics &amp; Probability: Using Probability to Make Decisions"}
        },
        {
            "competencyText": {"en-us": "Calculate expected values and use them to solve problems"}
        },
        {
            "competencyText": {"en-us": "Define a random variable for a quantity of interest by assigning\r\na numerical value to each event in a sample space; graph the \r\ncorresponding probability distribution using the same graphical\r\ndisplays as for data distributions. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Calculate the expected value of a random variable; interpret it as\r\nthe mean of the probability distribution. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Develop a probability distribution for a random variable defined\r\nfor a sample space in which theoretical probabilities can be calculated;\r\nfind the expected value<i>. For example, find the theoretical probability\r\n distribution for the number of correct answers obtained by guessing on\r\nall five questions of a multiple-choice test where each question has four\r\nchoices, and find the expected grade under various grading schemes.<\/i> <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Develop a probability distribution for a random variable defined\r\nfor a sample space in which probabilities are assigned empirically; find\r\nthe expected value.<i> For example, find a current data distribution on the\r\nnumber of TV sets per household in the United States, and calculate the\r\nexpected number of sets per household. How many TV sets would you\r\nexpect to find in 100 randomly selected households?<\/i> <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Use probability to evaluate outcomes of decisions"}
        },
        {
            "competencyText": {"en-us": "Weigh the possible outcomes of a decision by assigning probabilities to payoff values and finding expected values. <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>\r\n<ol style=\"list-style-type: lower-alpha;\">\r\n<li>Find the expected payoff for a game of chance.<i> For example, find the expected winnings from a state lottery ticket or a game at a fast-food restaurant.<\/i><\/li><li>Evaluate and compare strategies on the basis of expected values.<i> For example, compare a high-deductible versus a low-deductible automobile insurance policy using various, but reasonable, chances of having a minor or a major accident.<\/i><\/li><\/ol>"}
        },
        {
            "competencyText": {"en-us": "Use probabilities to make fair decisions (e.g., drawing by lots, using\r\na random number generator). <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Analyze decisions and strategies using probability concepts (e.g.,\r\nproduct testing, medical testing, pulling a hockey goalie at the end of\r\na game). <a href=\"http://www.cpalms.org/Standards/mafs_modeling_standards.aspx\" title=\"Modeling Standard\" target=\"_blank\" style=\"text-decoration:none;\">&#9733;<\/a>"}
        },
        {
            "competencyText": {"en-us": "Calculus"}
        },
        {
            "competencyText": {"en-us": "Limits and Continuity"}
        },
        {
            "competencyText": {"en-us": "Understand the concept of limit and estimate limits from graphs and tables of values. \r\n"}
        },
        {
            "competencyText": {"en-us": "Find limits by substitution. \r\n"}
        },
        {
            "competencyText": {"en-us": "Find limits of sums, differences, products, and quotients. "}
        },
        {
            "competencyText": {"en-us": "Find limits of rational functions that are undefined at a point. \r\n"}
        },
        {
            "competencyText": {"en-us": "Find one-sided limits. "}
        },
        {
            "competencyText": {"en-us": "Find limits at infinity. "}
        },
        {
            "competencyText": {"en-us": "Decide when a limit is infinite and use limits involving infinity to describe asymptotic behavior. "}
        },
        {
            "competencyText": {"en-us": "Find special limits such as <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/183/img/remarks/1.png\" />"}
        },
        {
            "competencyText": {"en-us": "Understand continuity in terms of limits. "}
        },
        {
            "competencyText": {"en-us": "Decide if a function is continuous at a point. "}
        },
        {
            "competencyText": {"en-us": "Find the types of discontinuities of a function. "}
        },
        {
            "competencyText": {"en-us": "Understand and use the Intermediate Value Theorem on a function over a closed interval. "}
        },
        {
            "competencyText": {"en-us": "Understand and apply the Extreme Value Theorem: If f(x) is continuous over a closed interval, then f has a maximum and a minimum on the interval. "}
        },
        {
            "competencyText": {"en-us": "Differential Calculus"}
        },
        {
            "competencyText": {"en-us": "Understand the concept of derivative geometrically, numerically, and analytically, and interpret the derivative as an instantaneous rate of change or as the slope of the tangent line. \r\n"}
        },
        {
            "competencyText": {"en-us": "State, understand, and apply the definition of derivative. "}
        },
        {
            "competencyText": {"en-us": "Find the derivatives of functions, including algebraic, trigonometric, logarithmic, and exponential functions. "}
        },
        {
            "competencyText": {"en-us": "Find the derivatives of sums, products, and quotients. "}
        },
        {
            "competencyText": {"en-us": "Find the derivatives of composite functions using the Chain Rule. \r\n"}
        },
        {
            "competencyText": {"en-us": "Find the derivatives of implicitly-defined functions. "}
        },
        {
            "competencyText": {"en-us": "Find derivatives of inverse functions."}
        },
        {
            "competencyText": {"en-us": "Find second derivatives and derivatives of higher order. "}
        },
        {
            "competencyText": {"en-us": "Find derivatives using logarithmic differentiation. "}
        },
        {
            "competencyText": {"en-us": "Understand and use the relationship between differentiability and continuity. "}
        },
        {
            "competencyText": {"en-us": "Understand and apply the Mean Value Theorem. "}
        },
        {
            "competencyText": {"en-us": "Applications of Derivatives"}
        },
        {
            "competencyText": {"en-us": "Find the slope of a curve at a point, including points at which there are vertical tangent lines and no tangent lines. "}
        },
        {
            "competencyText": {"en-us": "Find an equation for the tangent line to a curve at a point and a local linear approximation. "}
        },
        {
            "competencyText": {"en-us": "Decide where functions are decreasing and increasing. Understand the relationship between the increasing and decreasing behavior of <em>f<\/em> and the sign of <em>f'<\/em>. "}
        },
        {
            "competencyText": {"en-us": "Find local and absolute maximum and minimum points. "}
        },
        {
            "competencyText": {"en-us": "Find points of inflection of functions. Understand the relationship between the concavity of f and the sign of f\". Understand points of inflection as places where concavity changes. "}
        },
        {
            "competencyText": {"en-us": "Use first and second derivatives to help sketch graphs. Compare the corresponding characteristics of the graphs of f, f', and f\". "}
        },
        {
            "competencyText": {"en-us": "Use implicit differentiation to find the derivative of an inverse function. "}
        },
        {
            "competencyText": {"en-us": "Solve optimization problems. "}
        },
        {
            "competencyText": {"en-us": "Find average and instantaneous rates of change. Understand the instantaneous rate of change as the limit of the average rate of change. Interpret a derivative as a rate of change in applications, including velocity, speed, and acceleration. "}
        },
        {
            "competencyText": {"en-us": "Find the velocity and acceleration of a particle moving in a straight line. "}
        },
        {
            "competencyText": {"en-us": "Model rates of change, including related rates problems. "}
        },
        {
            "competencyText": {"en-us": "Solve problems using the Newton-Raphson method."}
        },
        {
            "competencyText": {"en-us": "Integral Calculus"}
        },
        {
            "competencyText": {"en-us": "Use rectangle approximations to find approximate values of integrals. "}
        },
        {
            "competencyText": {"en-us": "Calculate the values of Riemann Sums over equal subdivisions using left, right, and midpoint evaluation points. "}
        },
        {
            "competencyText": {"en-us": "Interpret a definite integral as a limit of Riemann sums. "}
        },
        {
            "competencyText": {"en-us": "Interpret a definite integral of the rate of change of a quantity over an interval as the change of the quantity over the interval. That is,<img alt=\"integral a of b\" src=\"http://www.cpalms.org/Uploads/Benchmark/214/img/214.png\" complete=\"complete\" /> <i>f'<\/i>(<i>x<\/i>)<i>dx<\/i> = <i>f<\/i>(<i>b<\/i>) - <i>f<\/i>(<i>a<\/i>) (Fundamental Theorem of Calculus). \r\n"}
        },
        {
            "competencyText": {"en-us": "Use the Fundamental Theorem of Calculus to evaluate definite and indefinite integrals and to represent particular antiderivatives. Perform analytical and graphical analysis of functions so defined. "}
        },
        {
            "competencyText": {"en-us": "Use these properties of definite integrals:<br />\r\n<ul>\r\n    <li><img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ba.png\" complete=\"complete\" />[f(x) + g(x)]dx = <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ba.png\" complete=\"complete\" />f(x)dx +<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ba.png\" complete=\"complete\" />g(x)dx <\/li>\r\n    <li><img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ba.png\" complete=\"complete\" />k &#8226; f(x)dx = k<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ba.png\" complete=\"complete\" />f(x)dx <\/li>\r\n    <li><img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/aa.png\" complete=\"complete\" />f(x)dx = 0 <\/li>\r\n    <li><img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ba.png\" complete=\"complete\" />f(x)dx = - <img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ab.png\" complete=\"complete\" />f(x)dx <\/li>\r\n    <li><img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ba.png\" complete=\"complete\" />f(x)dx +<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/cb.png\" complete=\"complete\" />f(x)dx =<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ca.png\" complete=\"complete\" />f(x)dx <\/li>\r\n    <li>If f(x) &#8804; g(x) on [a, b], then<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ba.png\" complete=\"complete\" />f(x)dx &#8804;<img alt=\"\" src=\"http://www.cpalms.org/Uploads/Benchmark/216/img/ba.png\" complete=\"complete\" />g(x)dx <\/li>\r\n<\/ul>\r\n"}
        },
        {
            "competencyText": {"en-us": "Use integration by substitution (or change of variable) to find values of integrals."}
        },
        {
            "competencyText": {"en-us": "Use Riemann Sums, the Trapezoidal Rule, and technology to approximate definite integrals of functions represented algebraically, geometrically, and by tables of values."}
        },
        {
            "competencyText": {"en-us": "Applications of Integration"}
        },
        {
            "competencyText": {"en-us": "Find specific antiderivatives using initial conditions, including finding velocity functions from acceleration functions, finding position functions from velocity functions, and solving applications related to motion along a line. "}
        },
        {
            "competencyText": {"en-us": "Solve separable differential equations, and use them in modeling. \r\n"}
        },
        {
            "competencyText": {"en-us": "Solve differential equations of the form <img alt=\"dy/dt=ky\" src=\"http://www.cpalms.org/Uploads/Benchmark/221/img/221.png\" /> as applied to growth and decay problems. "}
        },
        {
            "competencyText": {"en-us": "Use slope fields to display a graphic representation of the solution to a differential equation, and locate particular solutions to the equation. \r\n"}
        },
        {
            "competencyText": {"en-us": "Use definite integrals to find the area between a curve and the x-axis or between two curves. \r\n"}
        },
        {
            "competencyText": {"en-us": "Use definite integrals to find the average value of a function over a closed interval."}
        },
        {
            "competencyText": {"en-us": "Use definite integrals to find the volume of a solid with known cross-sectional area, including solids of revolution. "}
        },
        {
            "competencyText": {"en-us": "Apply integration to model, and solve problems in physical, biological, and social sciences. \r\n"}
        }
    ]
}