{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://teks-api.texasgateway.org/ims/case/v1p0/CFDocuments/44687590-556c-5aef-9fa5-43368acac253",
        "name": {"en-us": "Chapter 113 Social Studies Subchapter B. Middle School"},
        "description": {"en-us": "Chapter 113 Social Studies Subchapter B. Middle School, Streamlined"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "Social Studies, Grade 6, Adopted 2018."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §113.18 adopted to be effective August 23, 2010, 35 TexReg 7232",
                    " amended to be effective August 1, 2019, 44 TexReg 1988."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Social Studies, Grade 7, Adopted 2018."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §113.19 adopted to be effective August 23, 2010, 35 TexReg 7232",
                    " amended to be effective August 1, 2019, 44 TexReg 1988."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Social Studies, Grade 8, Adopted 2018."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §113.20 adopted to be effective August 23, 2010, 35 TexReg 7232",
                    " amended to be effective August 1, 2019, 44 TexReg 1988."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "In Grade 8, students study the history of the United States from the early colonial period through Reconstruction. The knowledge and skills in subsection (b) of this section comprise the first part of a two-year study of U.S. history. The second part, comprising U.S. history from Reconstruction to the present, is provided in §113.41 of this title (relating to United States History Studies Since 1877 (One Credit), Beginning with School Year 2011-2012). The content in Grade 8 builds upon that from Grade 5 but provides more depth and breadth. Historical content focuses on the political, economic, religious, and social events and issues related to the colonial and revolutionary eras, the creation and ratification of the U.S. Constitution, challenges of the early republic, the Age of Jackson, westward expansion, sectionalism, Civil War, and Reconstruction. Students describe the physical characteristics of the United States and their impact on population distribution and settlement patterns in the past and present. Students analyze the various economic factors that influenced the development of colonial America and the early years of the republic and identify the origins of the free enterprise system. Students examine the American beliefs and principles, including limited government, checks and balances, federalism, separation of powers, and individual rights, reflected in the U.S. Constitution and other historical documents. Students evaluate the impact of Supreme Court cases and major reform movements of the 19th century and examine the rights and responsibilities of citizens of the United States as well as the importance of effective leadership in a constitutional republic. Students evaluate the impact of scientific discoveries and technological innovations on the development of the United States. Students use critical-thinking skills, including the identification of bias in written, oral, and visual material."}
        },
        {
            "competencyText": {"en-us": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary and secondary source material such as the complete text of the U.S. Constitution and the Declaration of Independence, landmark cases of the U.S. Supreme Court, biographies, autobiographies, novels, speeches, letters, diaries, poetry, songs, and artworks is encouraged. Motivating resources are available from museums, historical sites, presidential libraries, and local and state preservation societies."}
        },
        {
            "competencyText": {"en-us": "The eight strands of the essential knowledge and skills for social studies are intended to be integrated for instructional purposes. Skills listed in the social studies skills strand in subsection (b) of this section should be incorporated into the teaching of all essential knowledge and skills for social studies. A greater depth of understanding of complex content material can be attained when integrated social studies content from the various disciplines and critical-thinking skills are taught together. Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Students identify the role of the U.S. free enterprise system within the parameters of this course and understand that this system may also be referenced as capitalism or the free market system."}
        },
        {
            "competencyText": {"en-us": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history; geography; economics; government; citizenship; culture; science, technology, and society; and social studies skills. The content, as appropriate for the grade level or course, enables students to understand the importance of patriotism, function in a free enterprise society, and appreciate the basic democratic values of our state and nation as referenced in the Texas Education Code (TEC), §28.002(h)."}
        },
        {
            "competencyText": {"en-us": "Students understand that a constitutional republic is a representative form of government whose representatives derive their authority from the consent of the governed, serve for an established tenure, and are sworn to uphold the constitution."}
        },
        {
            "competencyText": {"en-us": "State and federal laws mandate a variety of celebrations and observances, including Celebrate Freedom Week."}
        },
        {
            "competencyText": {"en-us": "Each social studies class shall include, during Celebrate Freedom Week as provided under the TEC, §29.907, or during another full school week as determined by the board of trustees of a school district, appropriate instruction concerning the intent, meaning, and importance of the Declaration of Independence and the U.S. Constitution, including the Bill of Rights, in their historical contexts. The study of the Declaration of Independence must include the study of the relationship of the ideas expressed in that document to subsequent American history, including the relationship of its ideas to the rich diversity of our people as a nation of immigrants, the American Revolution, the formulation of the U.S. Constitution, and the abolitionist movement, which led to the Emancipation Proclamation and the women's suffrage movement."}
        },
        {
            "competencyText": {"en-us": "Each school district shall require that, during Celebrate Freedom Week or other week of instruction prescribed under subparagraph (A) of this paragraph, students in Grades 3-12 study and recite the following text from the Declaration of Independence: \"We hold these Truths to be self-evident, that all Men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the Pursuit of Happiness--That to secure these Rights, Governments are instituted among Men, deriving their just Powers from the Consent of the Governed.\""}
        },
        {
            "competencyText": {"en-us": "Students discuss how and whether the actions of U.S. citizens and the local, state, and federal governments have achieved the ideals espoused in the founding documents."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "History. The student understands traditional historical points of reference in U.S. history through 1877. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify the major eras in U.S. history through 1877, including colonization, revolution, creation and ratification of the Constitution, early republic, the Age of Jackson, westward expansion, reform movements, sectionalism, Civil War, and Reconstruction, and describe their causes and effects; and"}
        },
        {
            "competencyText": {"en-us": "explain the significance of the following dates: 1607, founding of Jamestown; 1620, arrival of the Pilgrims and signing of the Mayflower Compact; 1776, adoption of the Declaration of Independence; 1787, writing of the U.S. Constitution; 1803, Louisiana Purchase; and 1861-1865, Civil War."}
        },
        {
            "competencyText": {"en-us": "History. The student understands the causes of exploration and colonization eras. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify reasons for English, Spanish, and French exploration and colonization of North America; and"}
        },
        {
            "competencyText": {"en-us": "compare political, economic, religious, and social reasons for the establishment of the 13 English colonies."}
        },
        {
            "competencyText": {"en-us": "History. The student understands the foundations of representative government in the United States. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the reasons for the growth of representative government and institutions during the colonial period;"}
        },
        {
            "competencyText": {"en-us": "analyze the importance of the Mayflower Compact, the Fundamental Orders of Connecticut, and the Virginia House of Burgesses to the growth of representative government; and"}
        },
        {
            "competencyText": {"en-us": "describe how religion and virtue contributed to the growth of representative government in the American colonies."}
        },
        {
            "competencyText": {"en-us": "History. The student understands significant political and economic issues of the revolutionary and Constitutional eras. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze causes of the American Revolution, including the Proclamation of 1763, the Intolerable Acts, the Stamp Act, mercantilism, lack of representation in Parliament, and British economic policies following the French and Indian War;"}
        },
        {
            "competencyText": {"en-us": "explain the roles played by significant individuals during the American Revolution, including Abigail Adams, John Adams, Wentworth Cheswell, Samuel Adams, Mercy Otis Warren, James Armistead, Benjamin Franklin, Crispus Attucks, King George III, Patrick Henry, Thomas Jefferson, the Marquis de Lafayette, Thomas Paine, and George Washington;"}
        },
        {
            "competencyText": {"en-us": "explain the issues surrounding important events of the American Revolution, including declaring independence; fighting the battles of Lexington and Concord, Saratoga, and Yorktown; enduring the winter at Valley Forge; and signing the Treaty of Paris of 1783; and"}
        },
        {
            "competencyText": {"en-us": "analyze the issues of the Constitutional Convention of 1787, including the Great Compromise and the Three-Fifths Compromise."}
        },
        {
            "competencyText": {"en-us": "History. The student understands the challenges confronted by the government and its leaders in the early years of the republic and the Age of Jackson. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe major domestic problems faced by the leaders of the new republic, including maintaining national security, creating a stable economic system, and setting up the court system;"}
        },
        {
            "competencyText": {"en-us": "summarize arguments regarding protective tariffs, taxation, and the banking system;"}
        },
        {
            "competencyText": {"en-us": "explain the origin and development of American political parties;"}
        },
        {
            "competencyText": {"en-us": "explain the causes, important events, and effects of the War of 1812;"}
        },
        {
            "competencyText": {"en-us": "identify the foreign policies of presidents Washington through Monroe and explain the impact of Washington's Farewell Address and the Monroe Doctrine;"}
        },
        {
            "competencyText": {"en-us": "explain the impact of the election of Andrew Jackson, including expanded suffrage; and"}
        },
        {
            "competencyText": {"en-us": "analyze the reasons for the removal and resettlement of Cherokee Indians during the Jacksonian era, including the Indian Removal Act, Worcester v. Georgia, and the Trail of Tears."}
        },
        {
            "competencyText": {"en-us": "History. The student understands westward expansion and its effects on the political, economic,and social development of the nation. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain how the Northwest Ordinance established principles and procedures for orderly expansion of the United States;"}
        },
        {
            "competencyText": {"en-us": "analyze the westward growth of the nation, including the Louisiana Purchase and Manifest Destiny; and"}
        },
        {
            "competencyText": {"en-us": "explain the causes and effects of the U.S.-Mexican War and their impact on the United States."}
        },
        {
            "competencyText": {"en-us": "History. The student understands how political, economic, and social factors led to the growth of sectionalism and the Civil War. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze the impact of tariff policies on sections of the United States before the Civil War;"}
        },
        {
            "competencyText": {"en-us": "compare the effects of political, economic, and social factors on slaves and free blacks;"}
        },
        {
            "competencyText": {"en-us": "analyze the impact of slavery on different sections of the United States; and"}
        },
        {
            "competencyText": {"en-us": "identify the provisions and compare the effects of congressional conflicts and compromises prior to the Civil War, including the role of John Quincy Adams."}
        },
        {
            "competencyText": {"en-us": "History. The student understands individuals, issues, and events of the Civil War. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the roles played by significant individuals during the Civil War, including Jefferson Davis, Ulysses S. Grant, Robert E. Lee, and Abraham Lincoln, and heroes such as congressional Medal of Honor recipients William Carney and Philip Bazaar;"}
        },
        {
            "competencyText": {"en-us": "explain the central role of the expansion of slavery in causing sectionalism, disagreement over states' rights, and the Civil War;"}
        },
        {
            "competencyText": {"en-us": "explain significant events of the Civil War, including the firing on Fort Sumter; the battles of Antietam, Gettysburg, and Vicksburg; the Emancipation Proclamation; Lee's surrender at Appomattox Court House; and the assassination of Abraham Lincoln; and"}
        },
        {
            "competencyText": {"en-us": "analyze Abraham Lincoln's ideas about liberty, equality, union, and government as contained in his first and second inaugural addresses and the Gettysburg Address and contrast them with the ideas contained in Jefferson Davis's inaugural address."}
        },
        {
            "competencyText": {"en-us": "History. The student understands the effects of Reconstruction on the political, economic, and social life of the nation. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate legislative reform programs of the Radical Reconstruction Congress and reconstructed state governments;"}
        },
        {
            "competencyText": {"en-us": "explain the impact of the election of African Americans from the South such as Hiram Rhodes Revels; and"}
        },
        {
            "competencyText": {"en-us": "explain the economic, political, and social problems during Reconstruction and evaluate their impact on different groups."}
        },
        {
            "competencyText": {"en-us": "Geography. The student understands the location and characteristics of places and regions of the United States, past and present. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "locate places and regions directly related to major eras and turning points in the United States during the 17th, 18th, and 19th centuries;"}
        },
        {
            "competencyText": {"en-us": "compare places and regions of the United States in terms of physical and human characteristics; and"}
        },
        {
            "competencyText": {"en-us": "analyze the effects of physical and human geographic factors such as weather, landforms, waterways, transportation, and communication on major historical events in the United States."}
        },
        {
            "competencyText": {"en-us": "Geography. The student understands the physical characteristics of North America and how humans adapted to and modified the environment through the mid-19th century. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze how physical characteristics of the environment influenced population distribution, settlement patterns, and economic activities in the United States; and"}
        },
        {
            "competencyText": {"en-us": "describe the positive and negative consequences of human modification of the physical environment of the United States."}
        },
        {
            "competencyText": {"en-us": "Economics. The student understands why various sections of the United States developed different patterns of economic activity through 1877. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify economic differences among different regions of the United States;"}
        },
        {
            "competencyText": {"en-us": "explain reasons for the development of the plantation system, the transatlantic slave trade, and the spread of slavery; and"}
        },
        {
            "competencyText": {"en-us": "analyze the causes and effects of economic differences among different regions of the United States at selected times."}
        },
        {
            "competencyText": {"en-us": "Economics. The student understands how various economic forces resulted in the Industrial Revolution in the 19th century. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze the economic effects of the War of 1812; and"}
        },
        {
            "competencyText": {"en-us": "identify the economic factors that brought about rapid industrialization and urbanization."}
        },
        {
            "competencyText": {"en-us": "Economics. The student understands the origins and development of the free enterprise system in the United States. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain why a free enterprise system of economics developed in the new nation, including minimal government regulation, taxation, and property rights; and"}
        },
        {
            "competencyText": {"en-us": "describe the characteristics and the benefits of the U.S. free enterprise system through 1877."}
        },
        {
            "competencyText": {"en-us": "Government. The student understands the American beliefs and principles reflected in the Declaration of Independence, the U.S. Constitution, and other important historic documents. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify the influence of ideas from historic documents, including the Magna Carta, the English Bill of Rights, the Mayflower Compact, and the Federalist Papers, on the U.S. system of government;"}
        },
        {
            "competencyText": {"en-us": "summarize the strengths and weaknesses of the Articles of Confederation;"}
        },
        {
            "competencyText": {"en-us": "identify colonial grievances listed in the Declaration of Independence and explain how those grievances were addressed in the U.S. Constitution and the Bill of Rights;"}
        },
        {
            "competencyText": {"en-us": "analyze how the U.S. Constitution reflects the principles of limited government, republicanism, checks and balances, federalism, separation of powers, popular sovereignty, and individual rights; and"}
        },
        {
            "competencyText": {"en-us": "explain the role of significant individuals such as Thomas Hooker, Charles de Montesquieu, and John Locke in the development of self-government in colonial America."}
        },
        {
            "competencyText": {"en-us": "Government. The student understands the purpose of changing the U.S. Constitution and the impact of amendments on American society. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "summarize the purposes for amending the U.S. Constitution; and"}
        },
        {
            "competencyText": {"en-us": "describe the impact of the 13th, 14th, and 15th amendments."}
        },
        {
            "competencyText": {"en-us": "Government. The student understands the dynamic nature of the powers of the national government and state governments in a federal system. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze the arguments of the Federalists and Anti-Federalists, including those of Alexander Hamilton, Patrick Henry, James Madison, and George Mason; and"}
        },
        {
            "competencyText": {"en-us": "explain constitutional issues arising over the issue of states' rights, including the Nullification Crisis and the Civil War."}
        },
        {
            "competencyText": {"en-us": "Government. The student understands the impact of landmark Supreme Court cases. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify the origin of judicial review;"}
        },
        {
            "competencyText": {"en-us": "summarize the issues, decisions, and significance of landmark Supreme Court cases, including Marbury v. Madison, McCulloch v. Maryland, and Gibbons v. Ogden; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of the landmark Supreme Court decision Dred Scott v. Sandford on life in the United States."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands the rights and responsibilities of citizens of the United States. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define and give examples of unalienable rights;"}
        },
        {
            "competencyText": {"en-us": "summarize rights guaranteed in the Bill of Rights; and"}
        },
        {
            "competencyText": {"en-us": "identify examples of responsible citizenship, including obeying rules and laws, staying informed on public issues, voting, and serving on juries."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands the importance of voluntary individual participation in the democratic process. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate the contributions of the Founding Fathers as models of civic virtue; and"}
        },
        {
            "competencyText": {"en-us": "analyze reasons for and the impact of selected examples of civil disobedience in U.S. history such as the Boston Tea Party and Henry David Thoreau's refusal to pay a tax."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands the importance of the expression of different points of view in a constitutional republic. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify different points of view of political parties and interest groups on important historical issues;"}
        },
        {
            "competencyText": {"en-us": "describe the importance of free speech and press in a constitutional republic; and"}
        },
        {
            "competencyText": {"en-us": "summarize historical events in which compromise resulted in a resolution such as the Missouri Compromise, Compromise of 1850, and Kansas-Nebraska Act."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands the importance of effective leadership in a constitutional republic. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze the leadership qualities of elected and appointed leaders of the United States such as George Washington, John Marshall, and Abraham Lincoln; and"}
        },
        {
            "competencyText": {"en-us": "describe the contributions of significant political, social, and military leaders of the United States such as Frederick Douglass, John Paul Jones, Susan B. Anthony, and Elizabeth Cady Stanton."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands the relationships between and among people from various groups, including racial, ethnic, and religious groups, during the 17th, 18th, and 19th centuries. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify racial, ethnic, and religious groups that settled in the United States and explain their reasons for immigration;"}
        },
        {
            "competencyText": {"en-us": "explain how urbanization contributed to conflicts resulting from differences in religion, social class, and political beliefs;"}
        },
        {
            "competencyText": {"en-us": "identify ways conflicts between people from various racial, ethnic, and religious groups were addressed;"}
        },
        {
            "competencyText": {"en-us": "analyze the contributions of people of various racial, ethnic, and religious groups to our national identity; and"}
        },
        {
            "competencyText": {"en-us": "identify the political, social, and economic contributions of women to American society."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands the major reform movements of the 19th century. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe and evaluate the historical development of the abolitionist movement; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of reform movements, including educational reform, temperance, the women's rights movement, prison reform, the labor reform movement, and care of the disabled."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands the impact of religion on the American way of life. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "trace the development of religious freedom in the United States;"}
        },
        {
            "competencyText": {"en-us": "describe religious influences on social movements, including the impact of the first and second Great Awakenings; and"}
        },
        {
            "competencyText": {"en-us": "analyze the impact of the First Amendment guarantees of religious freedom on the American way of life."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands the relationship between the arts and the times during which they were created. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify examples of American art, music, and literature that reflect society in different eras such as the Hudson River School artists, the \"Battle Hymn of the Republic,\" and transcendental literature; and"}
        },
        {
            "competencyText": {"en-us": "analyze the relationship between the arts and continuity and change in the American way of life."}
        },
        {
            "competencyText": {"en-us": "Science, technology, and society. The student understands the impact of science and technology on the economic development of the United States. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the effects of technological and scientific innovations such as the steamboat, the cotton gin, the telegraph, and interchangeable parts;"}
        },
        {
            "competencyText": {"en-us": "analyze how technological innovations changed the way goods were manufactured and distributed, nationally and internationally; and"}
        },
        {
            "competencyText": {"en-us": "analyze how technological innovations brought about economic growth such as the development of the factory system and the construction of the Transcontinental Railroad."}
        },
        {
            "competencyText": {"en-us": "Science, technology, and society. The student understands the impact of scientific discoveries and technological innovations on daily life in the United States. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare the effects of scientific discoveries and technological innovations that have influenced daily life in different periods in U.S. history; and"}
        },
        {
            "competencyText": {"en-us": "identify examples of how industrialization changed life in the United States."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student applies critical-thinking skills to organize and use information acquired through established research methodologies from a variety of valid sources, including technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "differentiate between, locate, and use valid primary and secondary sources such as media and news services, biographies, interviews, and artifacts to acquire information about the United States;"}
        },
        {
            "competencyText": {"en-us": "analyze information by applying absolute and relative chronology through sequencing, categorizing, identifying cause-and-effect relationships, comparing, contrasting, finding the main idea, summarizing, making generalizations and predictions, and drawing inferences and conclusions;"}
        },
        {
            "competencyText": {"en-us": "organize and interpret information from outlines, reports, databases, and visuals, including graphs, charts, timelines, and maps;"}
        },
        {
            "competencyText": {"en-us": "identify bias and points of view created by the historical context surrounding an event;"}
        },
        {
            "competencyText": {"en-us": "support a point of view on a social studies issue or event;"}
        },
        {
            "competencyText": {"en-us": "evaluate the validity of a source based on corroboration with other sources and information about the author;"}
        },
        {
            "competencyText": {"en-us": "create a visual representation of historical information such as thematic maps, graphs, and charts representing various aspects of the United States; and"}
        },
        {
            "competencyText": {"en-us": "pose and answer questions about geographic distributions and patterns shown on maps, graphs, and charts."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student communicates in written, oral, and visual forms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use social studies terminology correctly;"}
        },
        {
            "competencyText": {"en-us": "use effective written communication skills, including proper citations and avoiding plagiarism; and"}
        },
        {
            "competencyText": {"en-us": "create written, oral, and visual presentations of social studies information."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student uses problem-solving and decision-making skills, working independently and with others. The student is expected to use problem-solving and decision- making processes to identify a problem, gather information, list and consider options, consider advantages and disadvantages, choose and implement a solution, and evaluate the effectiveness of the solution."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "In Grade 7, students study the history of Texas from early times to the present. Content is presented with more depth and breadth than in Grade 4. Students examine the full scope of Texas history, including Natural Texas and its People; Age of Contact; Spanish Colonial; Mexican National; Revolution and Republic; Early Statehood; Texas in the Civil War and Reconstruction; Cotton, Cattle, and Railroads; Age of Oil; Texas in the Great Depression and World War II; Civil Rights and Conservatism; and Contemporary Texas eras. The focus in each era is on key individuals, events, and issues and their impact. Students identify regions of Texas and the distribution of population within and among the regions and explain the factors that caused Texas to change from an agrarian to an urban society. Students describe the structure and functions of municipal, county, and state governments, explain the influence of the U.S. Constitution on the Texas Constitution, and examine the rights and responsibilities of Texas citizens. Students use primary and secondary sources to examine the rich and diverse cultural background of Texas as they identify the different racial and ethnic groups that settled in Texas to build a republic and then a state. Students analyze the impact of scientific discoveries and technological innovations on the development of Texas in various industries such as agricultural, energy, medical, computer, and aerospace. Students use primary and secondary sources to acquire information about Texas."}
        },
        {
            "competencyText": {"en-us": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary and secondary source material such as biographies, autobiographies, novels, speeches, letters, diaries, poetry, songs, and images is encouraged. Motivating resources are available from museums, historical sites, presidential libraries, and local and state preservation societies."}
        },
        {
            "competencyText": {"en-us": "The eight strands of the essential knowledge and skills for social studies are intended to be integrated for instructional purposes. Skills listed in the social studies skills strand in subsection (b) of this section should be incorporated into the teaching of all essential knowledge and skills for social studies. A greater depth of understanding of complex content material can be attained when integrated social studies content from the various disciplines and critical-thinking skills are taught together. Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Students identify the role of the U.S. free enterprise system within the parameters of this course and understand that this system may also be referenced as capitalism or the free market system."}
        },
        {
            "competencyText": {"en-us": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history; geography; economics; government; citizenship; culture; science, technology, and society; and social studies skills. The content, as appropriate for the grade level or course, enables students to understand the importance of patriotism, function in a free enterprise society, and appreciate the basic democratic values of our state and nation as referenced in the Texas Education Code (TEC),§28.002(h)."}
        },
        {
            "competencyText": {"en-us": "Students understand that a constitutional republic is a representative form of government whose representatives derive their authority from the consent of the governed, serve for an established tenure, and are sworn to uphold the constitution."}
        },
        {
            "competencyText": {"en-us": "State and federal laws mandate a variety of celebrations and observances, including Celebrate Freedom Week."}
        },
        {
            "competencyText": {"en-us": "Each social studies class shall include, during Celebrate Freedom Week as provided under the TEC, §29.907, or during another full school week as determined by the board of trustees of a school district, appropriate instruction concerning the intent, meaning, and importance of the Declaration of Independence and the U.S. Constitution, including the Bill of Rights, in their historical contexts. The study of the Declaration of Independence must include the study of the relationship of the ideas expressed in that document to subsequent American history, including the relationship of its ideas to the rich diversity of our people as a nation of immigrants, the American Revolution, the formulation of theU.S. Constitution, and the abolitionist movement, which led to the Emancipation Proclamation and the women's suffrage movement."}
        },
        {
            "competencyText": {"en-us": "Each school district shall require that, during Celebrate Freedom Week or other week of instruction prescribed under subparagraph (A) of this paragraph, students in Grades 3-12 study and recite the following text from the Declaration of Independence: \"We hold these Truths to be self-evident, that all Men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the Pursuit of Happiness--That to secure these Rights, Governments are instituted among Men, deriving their just Powers from the Consent of the Governed.\""}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "History. The student understands traditional historical points of reference in Texas history. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify the major eras in Texas history, describe their defining characteristics, and explain the purpose of dividing the past into eras, including Natural Texas and its People; Age of Contact; Spanish Colonial; Mexican National; Revolution and Republic; Early Statehood; Texas in the Civil War and Reconstruction; Cotton, Cattle, and Railroads; Age of Oil; Texas in the Great Depression and World War II; Civil Rights; and Contemporary Texas; and"}
        },
        {
            "competencyText": {"en-us": "explain the significance of the following dates: 1519, mapping of the Texas coast and first mainland Spanish settlement; 1718, founding of San Antonio; 1821, independence from Spain; 1836, Texas independence; 1845, annexation; 1861, Civil War begins; 1876, adoption of current state constitution; and 1901, discovery of oil at Spindletop."}
        },
        {
            "competencyText": {"en-us": "History. The student understands how individuals, events, and issues through the Mexican National Era shaped the history of Texas. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare the cultures of American Indians in Texas prior to European colonization such as Gulf, Plains, Puebloan, and Southeastern;"}
        },
        {
            "competencyText": {"en-us": "identify important individuals, events, and issues related to European exploration of Texas such as Alonso Álvarez de Pineda, Álvar Núñez Cabeza de Vaca, the search for gold, and the conflicting territorial claims between France and Spain;"}
        },
        {
            "competencyText": {"en-us": "identify important individuals, events, and issues related to European colonization of Texas, including the establishment of Catholic missions, towns, and ranches, and the contributions of individuals such as Fray Damián Massanet, Antonio Margil de Jesús, and Francisco Hidalgo;"}
        },
        {
            "competencyText": {"en-us": "identify the individuals, issues, and events related to Mexico becoming an independent nation and its impact on Texas, including Father Miguel Hidalgo, Texas involvement in the fight for independence, José Gutiérrez de Lara, the Battle of Medina, the Mexican federal Constitution of 1824, the merger of Texas and Coahuila as a state, the State Colonization Law of 1825, and slavery;"}
        },
        {
            "competencyText": {"en-us": "identify the contributions of significant individuals, including Moses Austin, Stephen F. Austin, Erasmo Seguín, Martín De León, and Green DeWitt, during the Mexican settlement of Texas; and"}
        },
        {
            "competencyText": {"en-us": "contrast Spanish, Mexican, and Anglo purposes for and methods of settlement in Texas."}
        },
        {
            "competencyText": {"en-us": "History. The student understands how individuals, events, and issues related to the Texas Revolution shaped the history of Texas. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the chain of events that led to the Texas Revolution, including the Fredonian Rebellion, the Mier y Terán Report, the Law of April 6, 1830, the Turtle Bayou Resolutions, and the arrest of Stephen F. Austin;"}
        },
        {
            "competencyText": {"en-us": "explain the roles played by significant individuals during the Texas Revolution, including George Childress, Lorenzo de Zavala, James Fannin, Sam Houston, Antonio López de Santa Anna, Juan N. Seguín, and William B. Travis; and"}
        },
        {
            "competencyText": {"en-us": "explain the issues surrounding significant events of the Texas Revolution, including the Battle of Gonzales; the siege of the Alamo, William B. Travis's letter \"To the People of Texas and All Americans in the World,\" and the heroism of the diverse defenders who gave their lives there; the Constitutional Convention of 1836; Fannin's surrender at Goliad; and the Battle of San Jacinto."}
        },
        {
            "competencyText": {"en-us": "History. The student understands how individuals, events, and issues shaped the history of the Republic of Texas and early Texas statehood. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify individuals, events, and issues during the administrations of Republic of Texas Presidents Houston, Lamar, and Jones such as the Texas Navy, the Texas Rangers, Jack Coffee Hays, Chief Bowles, William Goyens, Mary Maverick, José Antonio Navarro, the Córdova Rebellion, the Council House Fight, the Santa Fe Expedition, slavery, and the roles of racial and ethnic groups;"}
        },
        {
            "competencyText": {"en-us": "analyze the causes of and events leading to Texas annexation such as security and public debt; and"}
        },
        {
            "competencyText": {"en-us": "identify individuals, events, and issues during early Texas statehood, including the U.S.- Mexican War, the Treaty of Guadalupe-Hidalgo, slavery, and the Compromise of 1850."}
        },
        {
            "competencyText": {"en-us": "History. The student understands how events and issues shaped the history of Texas during the Civil War and Reconstruction. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the central role the expansion of slavery played in the involvement of Texas in the Civil War;"}
        },
        {
            "competencyText": {"en-us": "identify significant events concerning Texas and the Civil War such as the Battle of Galveston, the Battle of Sabine Pass, and the Battle of Palmito Ranch; and"}
        },
        {
            "competencyText": {"en-us": "explain the political, economic, and social effects of the Civil War and Reconstruction in Texas."}
        },
        {
            "competencyText": {"en-us": "History. The student understands how individuals, events, and issues shaped the history of Texas from Reconstruction through the beginning of the 20th century. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify significant individuals, events, and issues, including the factors leading to the expansion of the Texas frontier, the effects of westward expansion on American Indians, the buffalo soldiers, and Quanah Parker;"}
        },
        {
            "competencyText": {"en-us": "identify significant individuals, events, and issues, including the development of the cattle industry from its Spanish beginnings and the cowboy way of life;"}
        },
        {
            "competencyText": {"en-us": "identify significant individuals, events, and issues, including the effects of the growth of railroads and the contributions of James Hogg; and"}
        },
        {
            "competencyText": {"en-us": "explain the political, economic, and social impact of the agricultural industry and the development of West Texas resulting from the close of the frontier."}
        },
        {
            "competencyText": {"en-us": "History. The student understands how individuals, events, and issues shaped the history of Texas during the late 19th, 20th, and early 21st centuries. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain how the oil industry led to the industrialization of Texas;"}
        },
        {
            "competencyText": {"en-us": "define and trace the impact of \"boom-and-bust\" cycles of leading Texas industries throughout the 20th and early 21st centuries such as farming, oil and gas production, cotton, ranching, real estate, banking, and computer technology;"}
        },
        {
            "competencyText": {"en-us": "describe and compare the impact of reform movements in Texas in the 19th and 20th centuries such as progressivism, populism, women's suffrage, agrarianism, labor reform, and the conservative movement of the late 20th century;"}
        },
        {
            "competencyText": {"en-us": "describe and compare the civil rights and equal rights movements of various groups in Texas in the 20th century and identify key leaders in these movements such as James L. Farmer Jr., Hector P. Garcia, Oveta Culp Hobby, Lyndon B. Johnson, the League of United Latin American Citizens (LULAC), Jane McCallum, and Lulu Belle Madison White; and"}
        },
        {
            "competencyText": {"en-us": "analyze the political, economic, and social impact of World War I, the Great Depression, World War II, and significant issues in the latter half of the 20th and early 21st centuries such as political and economic controversies, immigration, and migration on the history of Texas."}
        },
        {
            "competencyText": {"en-us": "Geography. The student understands the location and characteristics of places and regions of Texas. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "locate and compare the Mountains and Basins, Great Plains, North Central Plains, and Coastal Plains regions;"}
        },
        {
            "competencyText": {"en-us": "locate and compare places of importance in Texas in terms of physical and human characteristics such as major cities, waterways, natural and historic landmarks, political and cultural regions, and local points of interest; and"}
        },
        {
            "competencyText": {"en-us": "analyze the effects of physical and human factors such as climate, weather, landforms, irrigation, transportation, and communication on major events in Texas."}
        },
        {
            "competencyText": {"en-us": "Geography. The student understands the effects of the interaction between humans and the environment in Texas. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify ways in which Texans have adapted to and modified the environment and explain the positive and negative consequences of the modifications; and"}
        },
        {
            "competencyText": {"en-us": "explain ways in which geographic factors such as the Galveston Hurricane of 1900, the Dust Bowl, limited water resources, and alternative energy sources have affected the political, economic, and social development of Texas."}
        },
        {
            "competencyText": {"en-us": "Geography. The student understands the characteristics, distribution, and migration of population in Texas in the 19th, 20th, and 21st centuries. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify why immigrant groups came to Texas and where they settled;"}
        },
        {
            "competencyText": {"en-us": "describe how immigration and migration to Texas have influenced Texas;"}
        },
        {
            "competencyText": {"en-us": "describe the structure of the population of Texas using demographic concepts such as growth rate and age distribution; and"}
        },
        {
            "competencyText": {"en-us": "analyze the effects of the changing population distribution and growth in Texas and the additional need for education, health care, and transportation."}
        },
        {
            "competencyText": {"en-us": "Economics. The student understands the factors that caused Texas to change from an agrarian to an urban society. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain economic factors and the development of major industries that led to the urbanization of Texas such as transportation, oil and gas, and manufacturing; and"}
        },
        {
            "competencyText": {"en-us": "explain the changes in the types of jobs and occupations that have resulted from the urbanization of Texas."}
        },
        {
            "competencyText": {"en-us": "Economics. The student understands the interdependence of the Texas economy with the United States and the world. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the impact of national and international markets on the production of goods and services in Texas, including agriculture and oil and gas;"}
        },
        {
            "competencyText": {"en-us": "explain the impact of economic concepts within the free enterprise system such as supply and demand, profit, and world competition on the economy of Texas; and"}
        },
        {
            "competencyText": {"en-us": "analyze the impact of significant industries in Texas such as aerospace, medical, and computer technologies on local, national, and international markets."}
        },
        {
            "competencyText": {"en-us": "Government. The student understands the basic principles reflected in the Texas Constitution. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify how the Texas Constitution reflects the principles of limited government, republicanism, checks and balances, federalism, separation of powers, popular sovereignty, and individual rights; and"}
        },
        {
            "competencyText": {"en-us": "compare the principles and concepts of the Texas Constitution to the U.S. Constitution, including the Texas and U.S. Bill of Rights."}
        },
        {
            "competencyText": {"en-us": "Government. The student understands the structure and functions of government created by the Texas Constitution. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the structure and functions of government at municipal, county, and state levels; and"}
        },
        {
            "competencyText": {"en-us": "identify major sources of revenue for state and local governments such as property taxes, sales taxes, bonds, and fees."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands the rights and responsibilities of Texas citizens in a democratic society. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain rights of Texas citizens; and"}
        },
        {
            "competencyText": {"en-us": "explain civic responsibilities of Texas citizens and the importance of civic participation."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands the importance of the expression of different points of view in a democratic society. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify different points of view of political parties and interest groups on important Texas issues, past and present; and"}
        },
        {
            "competencyText": {"en-us": "describe the importance of free speech and press in a democratic society."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands the importance of effective leadership in a democratic society. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify the leadership qualities of elected and appointed leaders of Texas, past and present, including Texans who have been president of the United States; and"}
        },
        {
            "competencyText": {"en-us": "identify the contributions of Texas leaders such as Lawrence Sullivan \"Sul\" Ross, John Nance Garner (\"Cactus Jack\"), James A. Baker III, Henry B. González, Kay Bailey Hutchison, Barbara Jordan, Raymond L. Telles, Sam Rayburn, and Raul A. Gonzalez Jr."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands the concept of diversity within unity in Texas. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain how the diversity of Texas is reflected in a variety of cultural activities and celebrations;"}
        },
        {
            "competencyText": {"en-us": "describe how people from various racial, ethnic, and religious groups attempt to maintain their cultural heritage while adapting to the larger Texas culture;"}
        },
        {
            "competencyText": {"en-us": "identify examples of Spanish influence and the influence of other cultures on Texas such as place names, vocabulary, religion, architecture, food, and the arts; and"}
        },
        {
            "competencyText": {"en-us": "identify contributions to the arts by Texans such as Roy Bedichek, Diane Gonzales Bertrand, J. Frank Dobie, Scott Joplin, Elisabet Ney, Amado Peña Jr., Walter Prescott Webb, and Horton Foote."}
        },
        {
            "competencyText": {"en-us": "Science, technology, and society. The student understands the impact of scientific discoveries and technological innovations on the political, economic, and social development of Texas. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare types and uses of technology, past and present;"}
        },
        {
            "competencyText": {"en-us": "identify Texas leaders in science and technology such as Walter Cunningham, Michael DeBakey, Denton Cooley, Benjy Brooks, Michael Dell, and Howard Hughes Sr.;"}
        },
        {
            "competencyText": {"en-us": "analyze the effects of various scientific discoveries and technological innovations on the development of Texas such as advancements in the agricultural, energy, medical, computer, and aerospace industries;"}
        },
        {
            "competencyText": {"en-us": "evaluate the effects of scientific discoveries and technological innovations on the use of resources such as fossil fuels, water, and land; and"}
        },
        {
            "competencyText": {"en-us": "analyze how scientific discoveries and technological innovations have resulted in an interdependence among Texas, the United States, and the world."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student applies critical-thinking skills to organize and use information acquired through established research methodologies from a variety of valid sources, including technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "differentiate between, locate, and use valid primary and secondary sources such as media and news services, biographies, interviews, and artifacts to acquire information about Texas;"}
        },
        {
            "competencyText": {"en-us": "analyze information by applying absolute and relative chronology through sequencing, categorizing, identifying cause-and-effect relationships, comparing, contrasting, finding the main idea, summarizing, making generalizations and predictions, and drawing inferences and conclusions;"}
        },
        {
            "competencyText": {"en-us": "organize and interpret information from outlines, reports, databases, and visuals, including graphs, charts, timelines, and maps;"}
        },
        {
            "competencyText": {"en-us": "identify bias and points of view from the historical context surrounding an event that influenced the participants;"}
        },
        {
            "competencyText": {"en-us": "support a point of view on a social studies issue or event; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the validity of a source based on corroboration with other sources and information about the author."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student uses geographic tools to collect, analyze, and interpret data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "create and interpret thematic maps, graphs, and charts representing various aspects of Texas during the 19th, 20th, and 21st centuries; and"}
        },
        {
            "competencyText": {"en-us": "analyze and interpret geographic distributions and patterns in Texas during the 19th, 20th, and 21st centuries."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student communicates in written, oral, and visual forms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use social studies terminology correctly;"}
        },
        {
            "competencyText": {"en-us": "use effective written communication skills, including proper citations and avoiding plagiarism; and"}
        },
        {
            "competencyText": {"en-us": "create written, oral, and visual presentations of social studies information."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student uses problem-solving and decision-making skills, working independently and with others. The student is expected to use problem-solving and decision- making processes to identify a problem, gather information, list and consider options, consider advantages and disadvantages, choose and implement a solution, and evaluate the effectiveness of the solution."}
        },
        {
            "competencyText": {"en-us": "Students discuss how and whether the actions of U.S. citizens and the local, state, and federal governments have achieved the ideals espoused in the founding documents."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "In Grade 6, students study people, places, and societies of the contemporary world. Societies for study are from the following regions of the world: Europe, Russia and the Eurasian republics, North America, Central America and the Caribbean, South America, Southwest Asia-North Africa, Sub-Saharan Africa, South Asia, East Asia, Southeast Asia, Australia, and the Pacific realm. Students describe the influence of individuals and groups on historical and contemporary events in those societies and identify the locations and geographic characteristics of various societies. Students identify different ways of organizing economic and governmental systems. The concepts of limited and unlimited government are introduced, and students describe the nature of citizenship in various societies. Students compare institutions common to all societies such as government, education, and religious institutions. Students explain how the level of technology affects the development of the various societies and identify different points of view about events. The concept of frame of reference is introduced as an influence on an individual's point of view."}
        },
        {
            "competencyText": {"en-us": "To support the teaching of the essential knowledge and skills, the use of a variety of rich primary and secondary source material such as biographies, autobiographies, novels, speeches, letters, poetry, songs, and artworks is encouraged. Motivating resources are available from museums, art galleries, and historical sites."}
        },
        {
            "competencyText": {"en-us": "The eight strands of the essential knowledge and skills for social studies are intended to be integrated for instructional purposes. Skills listed in the social studies skills strand in subsection (b) of this section should be incorporated into the teaching of all essential knowledge and skills for social studies. A greater depth of understanding of complex content material can be attained when integrated social studies content from the various disciplines and critical-thinking skills are taught together. Statements that contain the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Students identify the role of the U.S. free enterprise system within the parameters of this course and understand that this system may also be referenced as capitalism or the free market system."}
        },
        {
            "competencyText": {"en-us": "Throughout social studies in Kindergarten-Grade 12, students build a foundation in history; geography; economics; government; citizenship; culture; science, technology, and society; and social studies skills. The content, as appropriate for the grade level or course, enables students to understand the importance of patriotism, function in a free enterprise society, and appreciate the basic democratic values of our state and nation as referenced in the Texas Education Code (TEC),§28.002(h)."}
        },
        {
            "competencyText": {"en-us": "Students understand that a constitutional republic is a representative form of government whose representatives derive their authority from the consent of the governed, serve for an established tenure, and are sworn to uphold the constitution."}
        },
        {
            "competencyText": {"en-us": "State and federal laws mandate a variety of celebrations and observances, including Celebrate Freedom Week."}
        },
        {
            "competencyText": {"en-us": "Each social studies class shall include, during Celebrate Freedom Week as provided under the TEC, §29.907, or during another full school week as determined by the board of trustees of a school district, appropriate instruction concerning the intent, meaning, and importance of the Declaration of Independence and the U.S. Constitution, including the Bill of Rights, in their historical contexts. The study of the Declaration of Independence must include the study of the relationship of the ideas expressed in that document to subsequent American history, including the relationship of its ideas to the rich diversity of our people as a nation of immigrants, the American Revolution, the formulation of theU.S. Constitution, and the abolitionist movement, which led to the Emancipation Proclamation and the women's suffrage movement."}
        },
        {
            "competencyText": {"en-us": "Each school district shall require that, during Celebrate Freedom Week or other week of instruction prescribed under subparagraph (A) of this paragraph, students in Grades 3-12 study and recite the following text from the Declaration of Independence: \"We hold these Truths to be self-evident, that all Men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the Pursuit of Happiness--That to secure these Rights, Governments are instituted among Men, deriving their just Powers from the Consent of the Governed.\""}
        },
        {
            "competencyText": {"en-us": "Students discuss how and whether the actions of U.S. citizens and the local, state, and federal governments have achieved the ideals espoused in the founding documents."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "History. The student understands that historical events influence contemporary events. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "trace characteristics of various contemporary societies in regions that resulted from historical events or factors such as colonization, immigration, and trade; and"}
        },
        {
            "competencyText": {"en-us": "analyze the historical background of various contemporary societies to evaluate relationships between past conflicts and current conditions."}
        },
        {
            "competencyText": {"en-us": "History. The student understands the influences of individuals and groups from various cultures on various historical and contemporary societies. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and describe the historical influence of individuals or groups on various contemporary societies; and"}
        },
        {
            "competencyText": {"en-us": "describe the social, political, economic, and cultural contributions of individuals and groups from various societies, past and present."}
        },
        {
            "competencyText": {"en-us": "Geography. The student understands the factors that influence the locations and characteristics of locations of various contemporary societies on maps and/or globes. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and explain the geographic factors responsible for patterns of population in places and regions;"}
        },
        {
            "competencyText": {"en-us": "explain ways in which human migration influences the character of places and regions;"}
        },
        {
            "competencyText": {"en-us": "identify and locate major physical and human geographic features such as landforms, water bodies, and urban centers of various places and regions; and"}
        },
        {
            "competencyText": {"en-us": "identify the location of major world countries for each of the world regions."}
        },
        {
            "competencyText": {"en-us": "Geography. The student understands how geographic factors influence the economic development and political relationships of societies. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the geographic factors responsible for the location of economic activities in places and regions; and"}
        },
        {
            "competencyText": {"en-us": "identify geographic factors such as location, physical features, transportation corridors and barriers, and distribution of natural resources that influence a society's political relationships."}
        },
        {
            "competencyText": {"en-us": "Geography. The student understands the impact of interactions between people and the physical environment on the development and conditions of places and regions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe ways people have been impacted by physical processes such as earthquakes and climate;"}
        },
        {
            "competencyText": {"en-us": "identify and analyze ways people have adapted to the physical environment in various places and regions; and"}
        },
        {
            "competencyText": {"en-us": "identify and analyze ways people have modified the physical environment such as mining, irrigation, and transportation infrastructure."}
        },
        {
            "competencyText": {"en-us": "Economics. The student understands the factors of production in a society's economy. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe ways in which the factors of production (natural resources, labor, capital, and entrepreneurs) influence the economies of various contemporary societies;"}
        },
        {
            "competencyText": {"en-us": "identify problems that may arise when one or more of the factors of production is in relatively short supply; and"}
        },
        {
            "competencyText": {"en-us": "explain the impact of the distribution of resources on international trade and economic interdependence among and within societies."}
        },
        {
            "competencyText": {"en-us": "Economics. The student understands the various ways in which people organize economic systems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare ways in which various societies organize the production and distribution of goods and services;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast free enterprise, socialist, and communist economies in various contemporary societies, including the benefits of the U.S. free enterprise system; and"}
        },
        {
            "competencyText": {"en-us": "understand the importance of ethics in maintaining a functional free enterprise system."}
        },
        {
            "competencyText": {"en-us": "Economics. The student understands categories of economic activities and the data used to measure a society's economic level. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define and give examples of agricultural, retail, manufacturing (goods), and service industries; and"}
        },
        {
            "competencyText": {"en-us": "describe levels of economic development of various societies using indicators such as life expectancy, gross domestic product (GDP), GDP per capita, and literacy."}
        },
        {
            "competencyText": {"en-us": "Government. The student understands the concepts of limited and unlimited governments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe and compare examples of limited and unlimited governments such as constitutional (limited) and totalitarian (unlimited);"}
        },
        {
            "competencyText": {"en-us": "identify reasons for limiting the power of government; and"}
        },
        {
            "competencyText": {"en-us": "identify and describe examples of human rights abuses by limited or unlimited governments such as the oppression of religious, ethnic, and political groups."}
        },
        {
            "competencyText": {"en-us": "Government. The student understands various ways in which people organize governments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and give examples of governments with rule by one, few, or many;"}
        },
        {
            "competencyText": {"en-us": "compare ways in which various societies such as China, Germany, India, and Russia organize government and how they function; and"}
        },
        {
            "competencyText": {"en-us": "identify historical origins of democratic forms of government such as Ancient Greece."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands that the nature of citizenship varies among societies. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe and compare roles and responsibilities of citizens in various contemporary societies, including the United States; and"}
        },
        {
            "competencyText": {"en-us": "explain how opportunities for citizens to participate in and influence the political process vary among various contemporary societies."}
        },
        {
            "competencyText": {"en-us": "Citizenship. The student understands the relationship among individual rights, responsibilities, duties, and freedoms in societies with representative governments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and explain the duty of civic participation in societies with representative governments; and"}
        },
        {
            "competencyText": {"en-us": "explain relationships among rights, responsibilities, and duties in societies with representative governments."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands the similarities and differences within and among cultures in various world societies. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and describe common traits that define cultures and culture regions;"}
        },
        {
            "competencyText": {"en-us": "define a multicultural society;"}
        },
        {
            "competencyText": {"en-us": "analyze the experiences and contributions of diverse groups to multicultural societies; and"}
        },
        {
            "competencyText": {"en-us": "identify and explain examples of conflict and cooperation between and among cultures."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands that all societies have basic institutions in common even though the characteristics of these institutions may differ. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify institutions basic to all societies, including government, economic, educational, and religious institutions;"}
        },
        {
            "competencyText": {"en-us": "compare characteristics of institutions in various contemporary societies; and"}
        },
        {
            "competencyText": {"en-us": "analyze the efforts and activities institutions use to sustain themselves over time."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands relationships that exist among world cultures. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and describe means of cultural diffusion such as trade, travel, and war;"}
        },
        {
            "competencyText": {"en-us": "identify and describe factors that influence cultural change such as improvements in communication, transportation, and economic development;"}
        },
        {
            "competencyText": {"en-us": "analyze the impact of improved communication technology among cultures; and"}
        },
        {
            "competencyText": {"en-us": "identify the impact of cultural diffusion on individuals and world societies."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands the relationship that exists between the arts and the societies in which they are produced. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the relationships that exist between societies and their architecture, art, music, and literature;"}
        },
        {
            "competencyText": {"en-us": "describe ways in which contemporary issues influence creative expressions; and"}
        },
        {
            "competencyText": {"en-us": "identify examples of art, music, and literature that convey universal themes such as religion, justice, and the passage of time."}
        },
        {
            "competencyText": {"en-us": "Culture. The student understands the relationships among religion, philosophy, and culture. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the relationship among religious ideas, philosophical ideas, and cultures; and"}
        },
        {
            "competencyText": {"en-us": "explain the significance of religious holidays and observances such as Christmas, Easter, Ramadan, the annual hajj, Yom Kippur, Rosh Hashanah, Diwali, and Vaisakhi in various contemporary societies."}
        },
        {
            "competencyText": {"en-us": "Science, technology, and society. The student understands the influences of science and technology on contemporary societies. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify examples of scientific discoveries, technological innovations, and scientists and inventors that have shaped the world;"}
        },
        {
            "competencyText": {"en-us": "explain how resources, economic factors, and political decisions affect the use of technology; and"}
        },
        {
            "competencyText": {"en-us": "make predictions about future social, political, economic, cultural, and environmental impacts that may result from future scientific discoveries and technological innovations."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student applies critical-thinking skills to organize and use information acquired through established research methodologies from a variety of valid sources, including technology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "differentiate between, locate, and use valid primary and secondary sources such as oral, print, and visual material and artifacts to acquire information about various world cultures;"}
        },
        {
            "competencyText": {"en-us": "analyze information by sequencing, categorizing, identifying cause-and-effect relationships, comparing, contrasting, finding the main idea, summarizing, making generalizations and predictions, and drawing inferences and conclusions;"}
        },
        {
            "competencyText": {"en-us": "organize and interpret information from outlines, reports, databases, and visuals, including graphs, charts, timelines, and maps; and"}
        },
        {
            "competencyText": {"en-us": "identify different points of view about an issue or current topic."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student uses geographic tools to collect, analyze, and interpret data. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "answer geographic questions, including: Where is it located? Why is it there? What is significant about its location? How is its location related to the location of other people, places, and environments? Using latitude and longitude, where is it located?;"}
        },
        {
            "competencyText": {"en-us": "pose and answer questions about geographic distributions and patterns for various world regions and countries shown on maps, graphs, and charts;"}
        },
        {
            "competencyText": {"en-us": "compare various world regions and countries using data from maps, graphs, and charts; and"}
        },
        {
            "competencyText": {"en-us": "create and interpret regional sketch maps, thematic maps, graphs, and charts depicting aspects such as population, disease, and economic activities of various world regions and countries."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student communicates in written, oral, and visual forms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use social studies terminology correctly;"}
        },
        {
            "competencyText": {"en-us": "incorporate main and supporting ideas in verbal and written communication based on research;"}
        },
        {
            "competencyText": {"en-us": "express ideas orally based on research and experiences;"}
        },
        {
            "competencyText": {"en-us": "create written and visual material such as journal entries, reports, graphic organizers, outlines, and bibliographies based on research; and"}
        },
        {
            "competencyText": {"en-us": "use effective written communication skills, including proper citations to avoid plagiarism."}
        },
        {
            "competencyText": {"en-us": "Social studies skills. The student uses problem-solving and decision-making skills, working independently and with others. The student is expected to use problem-solving and decision- making processes to identify a problem, gather information, list and consider options, consider advantages and disadvantages, choose and implement a solution, and evaluate the effectiveness of the solution."}
        }
    ]
}