{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://casenetwork.imsglobal.org/uri/6539857c-f5b5-11e9-bebe-0242c0a83003",
        "name": {"en-us": "Montana Workplace Competencies Content Standards"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "WORKPLACE COMPETENCIES CONTENT STANDARD 1\r\n(1) To satisfy the requirements of workplace competencies content standard 1, a student must identify, organize, plan, and allocate workplace resources of time, money, materials, facilities, and human resources."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 1 FOR END OF GRADE 4\r\n(1) The benchmark for workplace competencies content standard 1 for a student at the end of grade 4 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) manage time effectively (e.g., assignment notebook, calendar);"}
        },
        {
            "competencyText": {"en-us": "(b) use basic monetary skills;"}
        },
        {
            "competencyText": {"en-us": "(c) acquire, store, allocate, and use materials or space (e.g., supplies, notebook); and"}
        },
        {
            "competencyText": {"en-us": "(d) manage personal resources."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 1 FOR END OF GRADE 8\r\n(1) The benchmark for workplace competencies content standard 1 for a student at the end of grade 8 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) create and manage plans/schedules with specific timelines that take into account constraints, priorities, and goals;"}
        },
        {
            "competencyText": {"en-us": "(b) practice maintaining personal financial records;"}
        },
        {
            "competencyText": {"en-us": "(c) acquire, store, allocate, and use materials or space; and"}
        },
        {
            "competencyText": {"en-us": "(d) manage personal and team resources to achieve personal and team goals."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 1 UPON GRADUATION\r\n(1) The benchmark for workplace competencies content standard 1 for a student upon graduation is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) select goal-relevant activities, rank them, allocate time, and prepare and follow schedules;"}
        },
        {
            "competencyText": {"en-us": "(b) use or prepare budgets, make forecasts, keep records, make adjustments to meet objectives, and evaluate financial records;"}
        },
        {
            "competencyText": {"en-us": "(c) allocate and evaluate time, materials, facilities, and resources to set and achieve goals; and"}
        },
        {
            "competencyText": {"en-us": "(d) assess skills and distribute work accordingly, evaluate performance, and provide feedback toward the accomplishment of personal and team goals."}
        },
        {
            "competencyText": {"en-us": "WORKPLACE COMPETENCIES CONTENT STANDARD 2\r\n(1) To satisfy the requirements of workplace competencies content standard 2, a student must acquire and demonstrate interpersonal workplace skills."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 2 FOR END OF GRADE 4\r\n(1) The benchmark for workplace competencies content standard 2 for a student at the end of grade 4 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) practice one's role as an active and cooperative team player while recognizing individual differences and cultural diversity (e.g., be accountable for one's actions);"}
        },
        {
            "competencyText": {"en-us": "(b) demonstrate a learned skill to peers (e.g., give a \"how to\" demonstration);"}
        },
        {
            "competencyText": {"en-us": "(c) identify and practice leadership skills (e.g., team leader, class officer, class job);"}
        },
        {
            "competencyText": {"en-us": "(d) identify and practice negotiation skills and conflict resolution in structured situations; and"}
        },
        {
            "competencyText": {"en-us": "(e) practice basic customer and electronic etiquette (e.g., roleplay, order from a menu, appropriate e-mail language)."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 2 FOR END OF GRADE 8\r\n(1) The benchmark for workplace competencies content standard 2 for a student at the end of grade 8 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) use a variety of skills to work as a member of a team while recognizing individual differences and cultural diversity (e.g., listening skills);"}
        },
        {
            "competencyText": {"en-us": "(b) demonstrate a learned skill and teach others;"}
        },
        {
            "competencyText": {"en-us": "(c) demonstrate leadership skills by making positive use of rules, regulations, and policies of schools and community;"}
        },
        {
            "competencyText": {"en-us": "(d) work toward agreements that include exchanging specific resources or resolving divergent interests in structured and unstructured situations; and"}
        },
        {
            "competencyText": {"en-us": "(e) practice positive interpersonal communication skills (e.g., customer service, electronic etiquette, community service project)."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 2 UPON GRADUATION\r\n(1) The benchmark for workplace competencies content standard 2 for a student upon graduation is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) practice various roles required as a member of an effective team while recognizing individual differences and cultural diversity;"}
        },
        {
            "competencyText": {"en-us": "(b) demonstrate and teach a learned skill including performance evaluation of self and others in this process;"}
        },
        {
            "competencyText": {"en-us": "(c) communicate ideas to justify position, persuade and convince others, and responsibly challenge existing procedures and policies;"}
        },
        {
            "competencyText": {"en-us": "(d) practice and evaluate negotiating process including researching, goal setting, presenting, listening, clarifying, adjusting, and compromising; and"}
        },
        {
            "competencyText": {"en-us": "(e) practice and evaluate positive service skills (e.g., resolving misunderstandings, consumer complaints)."}
        },
        {
            "competencyText": {"en-us": "WORKPLACE COMPETENCIES CONTENT STANDARD 3\r\n(1) To satisfy the requirements of workplace competencies content standard 3, a student must acquire and use workplace information."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 3 FOR END OF GRADE 4\r\n(1) The benchmark for workplace competencies content standard 3 for a student at the end of grade 4 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) identify a variety of sources that provide workplace information;"}
        },
        {
            "competencyText": {"en-us": "(b) organize information using systematic methods (e.g., assignment book, alphabetizing, calendar);"}
        },
        {
            "competencyText": {"en-us": "(c) use a variety of methods (e.g., oral, written, graphic, pictorial, multimedia) to complete a task; and"}
        },
        {
            "competencyText": {"en-us": "(d) access and organize information from print and electronic sources."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 3 FOR END OF GRADE 8\r\n(1) The benchmark for workplace competencies content standard 3 for a student at the end of grade 8 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) identify the need for and obtain data in order to make informed decisions in the workplace;"}
        },
        {
            "competencyText": {"en-us": "(b) organize and maintain written or computerized records using systematic methods;"}
        },
        {
            "competencyText": {"en-us": "(c) select and present information using a variety of methods (e.g., oral, written, graphic, pictorial, multimedia); and"}
        },
        {
            "competencyText": {"en-us": "(d) acquire, organize, communicate, process, and analyze information from print and electronic sources."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 3 UPON GRADUATION\r\n(1) The benchmark for workplace competencies content standard 3 for a student upon graduation is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) gather, compile, and analyze data from a variety of sources and evaluate relevance and accuracy in making informed decisions in the workplace;"}
        },
        {
            "competencyText": {"en-us": "(b) organize, process, analyze, and maintain written and computerized records and other forms of information using systematic methods;"}
        },
        {
            "competencyText": {"en-us": "(c) select, analyze, and present information using a variety of methods (e.g., oral, written, graphic, pictorial, multimedia); and"}
        },
        {
            "competencyText": {"en-us": "(d) acquire, organize, communicate, process, analyze, and evaluate information from print and electronic sources."}
        },
        {
            "competencyText": {"en-us": "WORKPLACE COMPETENCIES CONTENT STANDARD 4\r\n(1) To satisfy the requirements of workplace competencies content standard 4, a student must demonstrate an understanding of how social, organizational, and technological systems work."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 4 FOR END OF GRADE 4\r\n(1) The benchmark for workplace competencies content standard 4 for a student at the end of grade 4 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) identify components of family, school, and community systems encountered in daily life;"}
        },
        {
            "competencyText": {"en-us": "(b) identify and model how components of systems interact (e.g., roleplay, class jobs); and"}
        },
        {
            "competencyText": {"en-us": "(c) work within a system (e.g., team, study group, group structure, classroom rules, mechanical model)."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 4 FOR END OF GRADE 8\r\n(1) The benchmark for workplace competencies content standard 4 for a student at the end of grade 8 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) describe and illustrate a system (e.g., relationships among self, family, school, community);"}
        },
        {
            "competencyText": {"en-us": "(b) analyze how a system works (i.e., input, process, output, feedback, performance improvement); and"}
        },
        {
            "competencyText": {"en-us": "(c) design and work within a system (e.g., committees, student council, mock government, simple electrical circuit) to manage, control, and improve performance."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 4 UPON GRADUATION\r\n(1) The benchmark for workplace competencies content standard 4 for a student upon graduation is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) evaluate quality and performance of a variety of systems (e.g., impact of technology on production);"}
        },
        {
            "competencyText": {"en-us": "(b) practice and analyze principles of successful system management considering external factors and planning for uncontrolled variables (e.g., balance professional and personal lives); and"}
        },
        {
            "competencyText": {"en-us": "(c) design, evaluate, and refine a system composed of subsystems (e.g., community service project, peer mediation, web page design)."}
        },
        {
            "competencyText": {"en-us": "WORKPLACE COMPETENCIES CONTENT STANDARD 5\r\n(1) To satisfy the requirements of workplace competencies content standard 5, a student must work safely with a variety of workplace technologies."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 5 FOR END OF GRADE 4\r\n(1) The benchmark for workplace competencies content standard 5 for a student at the end of grade 4 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) identify and select information sources using technology;"}
        },
        {
            "competencyText": {"en-us": "(b) solve problems both individually and with others;"}
        },
        {
            "competencyText": {"en-us": "(c) prevent or identify and solve problems using technology;"}
        },
        {
            "competencyText": {"en-us": "(d) discriminate between responsible and irresponsible use of technology; and"}
        },
        {
            "competencyText": {"en-us": "(e) identify and demonstrate appropriate care of technological tools."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 5 FOR END OF GRADE 8\r\n(1) The benchmark for workplace competencies content standard 5 for a student at the end of grade 8 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) use technology for learning, communications, and productivity;"}
        },
        {
            "competencyText": {"en-us": "(b) use technology to observe, analyze, interpret, and draw conclusions;"}
        },
        {
            "competencyText": {"en-us": "(c) prevent or identify and solve problems using technology;"}
        },
        {
            "competencyText": {"en-us": "(d) acknowledge others' rights and practice responsible use of technology; and"}
        },
        {
            "competencyText": {"en-us": "(e) manage and maintain technological tools and follow troubleshooting protocol."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 5 UPON GRADUATION\r\n(1) The benchmark for workplace competencies content standard 5 for a student upon graduation is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) choose procedures and technology to complete a task;"}
        },
        {
            "competencyText": {"en-us": "(b) create new knowledge by evaluating, combining, and extending information using multiple technologies;"}
        },
        {
            "competencyText": {"en-us": "(c) prevent or identify and solve problems using technology;"}
        },
        {
            "competencyText": {"en-us": "(d) practice and advocate ethical behavior in the use of technology; and"}
        },
        {
            "competencyText": {"en-us": "(e) manage and maintain technological systems and follow troubleshooting protocol."}
        },
        {
            "competencyText": {"en-us": "WORKPLACE COMPETENCIES CONTENT STANDARD 6\r\n(1) To satisfy the requirements of workplace competencies content standard 6, a student must acquire and demonstrate skills in life and career planning and workplace readiness."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 6 FOR END OF GRADE 4\r\n(1) The benchmark for workplace competencies content standard 6 for a student at the end of grade 4 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) describe how current learning relates to life and career development;"}
        },
        {
            "competencyText": {"en-us": "(b) demonstrate positive ways of performing work activities;"}
        },
        {
            "competencyText": {"en-us": "(c) describe how decisions affect self and others;"}
        },
        {
            "competencyText": {"en-us": "(d) describe various lifetime roles (e.g., friend, student, leader, worker, family member);"}
        },
        {
            "competencyText": {"en-us": "(e) explore and discuss a variety of occupational clusters (e.g., health, science) and their contribution to society; and"}
        },
        {
            "competencyText": {"en-us": "(f) describe and demonstrate the importance of personal goal setting and planning."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 6 FOR END OF GRADE 8\r\n(1) The benchmark for workplace competencies content standard 6 for a student at the end of grade 8 is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) identify how the skills taught in school subjects are used in various life roles and occupations;"}
        },
        {
            "competencyText": {"en-us": "(b) demonstrate personal qualities (e.g., dependability, punctuality, cooperation) that are needed to get and keep jobs;"}
        },
        {
            "competencyText": {"en-us": "(c) identify possible outcomes and consequences of decisions;"}
        },
        {
            "competencyText": {"en-us": "(d) recognize and describe the interrelationships of lifetime roles of family, community, work, and leisure roles;"}
        },
        {
            "competencyText": {"en-us": "(e) locate, explore, and evaluate a variety of occupations not limited by stereotypes, bias or traditional roles; and"}
        },
        {
            "competencyText": {"en-us": "(f) explore and identify personal interests, aptitudes, and abilities and develop strategies to achieve tentative life and career goals."}
        },
        {
            "competencyText": {"en-us": "BENCHMARK FOR WORKPLACE COMPETENCIES CONTENT STANDARD 6 UPON GRADUATION\r\n(1) The benchmark for workplace competencies content standard 6 for a student upon graduation is the ability to:"}
        },
        {
            "competencyText": {"en-us": "(a) describe how skills developed in academic and occupational programs relate to life and career planning;"}
        },
        {
            "competencyText": {"en-us": "(b) display workplace readiness skills (e.g., responsibility, sociability, self-management, job-seeking skills);"}
        },
        {
            "competencyText": {"en-us": "(c) demonstrate decision making and problem-solving skills;"}
        },
        {
            "competencyText": {"en-us": "(d) describe and evaluate life and career choices and the effect on family and lifestyle;"}
        },
        {
            "competencyText": {"en-us": "(e) discuss and demonstrate strategies to overcome bias and stereotyping in the workplace; and"}
        },
        {
            "competencyText": {"en-us": "(f) develop, evaluate, and adjust life and career plans."}
        }
    ]
}