{
    "directory": {
        "directoryID": "aeee9bee-bb73-483c-9450-bb2825a65210",
        "name": {"en-us": "IMS CASE Directory"},
        "dateCreated": "2020-09-08"
    },
    "framework": {
        "frameworkURL": "https://teks-api.texasgateway.org/ims/case/v1p0/CFDocuments/2ccca18f-b9cf-5710-8e66-13be2b1b71ba",
        "name": {"en-us": "Chapter 112. Science"},
        "description": {"en-us": "Chapter 112. Science"},
        "attributionName": "IMS Global",
        "attributionURL": "https://www.imsglobal.org",
        "providerMetaModel": "https://ocf-collab.org/concepts/f63b9a67-543a-49ab-b5ed-8296545c1db5",
        "beneficiaryRights": "https://www.imsglobal.org/terms-and-conditions",
        "registryRights": "https://ocf-collab.org/rights/adf0b9bd-e7eb-4b97-b080-d8b265639138"
    },
    "competencies": [
        {
            "competencyText": {"en-us": "Subchapter A. Elementary"}
        },
        {
            "competencyText": {"en-us": "Science, Kindergarten, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.11 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\""}
        },
        {
            "competencyText": {"en-us": "Recurring themes are pervasive in sciences, mathematics, and technology. These ideas transcend disciplinary boundaries and include patterns, cycles, systems, models, and change and constancy."}
        },
        {
            "competencyText": {"en-us": "The study of elementary science includes planning and safely implementing classroom and outdoor investigations using scientific processes, including inquiry methods, analyzing information, making informed decisions, and using tools to collect and record information, while addressing the major concepts and vocabulary, in the context of physical, earth, and life sciences. Districts are encouraged to facilitate classroom and outdoor investigations for at least 80% of instructional time."}
        },
        {
            "competencyText": {"en-us": "In Kindergarten, students observe and describe the natural world using their senses. Students do science as inquiry in order to develop and enrich their abilities to understand scientific concepts and processes. Students develop vocabulary through their experiences investigating properties of common objects, earth materials, and organisms."}
        },
        {
            "competencyText": {"en-us": "A central theme throughout the study of scientific investigation and reasoning; matter and energy; force, motion, and energy; Earth and space; and organisms and environment is active engagement in asking questions, creating a method to answer those questions, answering those questions, communicating ideas, and exploring with scientific tools. Scientific investigation and reasoning involves practicing safe procedures, asking questions about the natural world, and seeking answers to those questions through simple observations used in descriptive investigations."}
        },
        {
            "competencyText": {"en-us": "Matter is described in terms of its physical properties, including relative size, weight, shape, color, and texture. The importance of light, thermal, and sound energy is identified as it relates to the students' everyday life. The location and motion of objects are explored."}
        },
        {
            "competencyText": {"en-us": "Weather is recorded and discussed on a daily basis so students may begin to recognize patterns in the weather. Other patterns are observed in the appearance of objects in the sky."}
        },
        {
            "competencyText": {"en-us": "In life science, students recognize the interdependence of organisms in the natural world. They understand that all organisms have basic needs that can be satisfied through interactions with living and nonliving things. Students will investigate the life cycle of plants and identify likenesses between parents and offspring."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student conducts classroom and outdoor investigations following home and school safety procedures and uses environmentally appropriate and responsible practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify, discuss, and demonstrate safe and healthy practices as outlined in Texas Education Agency-approved safety standards during classroom and outdoor investigations, including wearing safety goggles or chemical splash goggles, as appropriate, washing hands, and using materials appropriately; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate how to use, conserve, and dispose of natural resources and materials such as conserving water and reusing or recycling paper, plastic, and metal."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student develops abilities to ask questions and seek answers in classroom and outdoor investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask questions about organisms, objects, and events observed in the natural world;"}
        },
        {
            "competencyText": {"en-us": "plan and conduct simple descriptive investigations;"}
        },
        {
            "competencyText": {"en-us": "collect data and make observations using simple tools;"}
        },
        {
            "competencyText": {"en-us": "record and organize data and observations using pictures, numbers, and words; and"}
        },
        {
            "competencyText": {"en-us": "communicate observations about simple descriptive investigations."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student knows that information and critical thinking are used in scientific problem solving. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and explain a problem such as the impact of littering and propose a solution;"}
        },
        {
            "competencyText": {"en-us": "make predictions based on observable patterns in nature; and"}
        },
        {
            "competencyText": {"en-us": "explore that scientists investigate different things in the natural world and use tools to help in their investigations."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses age-appropriate tools and models to investigate the natural world. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "collect information using tools, including computing devices, hand lenses, primary balances, cups, bowls, magnets, collecting nets, and notebooks; timing devices; non-standard measuring items; weather instruments such as demonstration thermometers; and materials to support observations of habitats of organisms such as terrariums and aquariums; and"}
        },
        {
            "competencyText": {"en-us": "use the senses as a tool of observation to identify properties and patterns of organisms, objects, and events in the environment."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that objects have properties and patterns. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe and record properties of objects, including bigger or smaller, heavier or lighter, shape, color, and texture; and"}
        },
        {
            "competencyText": {"en-us": "observe, record, and discuss how materials can be changed by heating or cooling."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows that energy, force, and motion are related and are a part of their everyday life. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use the senses to explore different forms of energy such as light, thermal, and sound;"}
        },
        {
            "competencyText": {"en-us": "explore interactions between magnets and various materials;"}
        },
        {
            "competencyText": {"en-us": "observe and describe the location of an object in relation to another such as above, below, behind, in front of, and beside; and"}
        },
        {
            "competencyText": {"en-us": "observe and describe the ways that objects can move such as in a straight line, zigzag, up and down, back and forth, round and round, and fast and slow."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that the natural world includes earth materials. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe, describe, and sort rocks by size, shape, color, and texture;"}
        },
        {
            "competencyText": {"en-us": "observe and describe physical properties of natural sources of water, including color and clarity; and"}
        },
        {
            "competencyText": {"en-us": "give examples of ways rocks, soil, and water are useful."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that there are recognizable patterns in the natural world and among objects in the sky. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe and describe weather changes from day to day and over seasons;"}
        },
        {
            "competencyText": {"en-us": "identify events that have repeating patterns, including seasons of the year and day and night; and"}
        },
        {
            "competencyText": {"en-us": "observe, describe, and illustrate objects in the sky such as the clouds, Moon, and stars, including the Sun."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that plants and animals have basic needs and depend on the living and nonliving things around them for survival. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "differentiate between living and nonliving things based upon whether they have basic needs and produce offspring; and"}
        },
        {
            "competencyText": {"en-us": "examine evidence that living organisms have basic needs such as food, water, and shelter for animals and air, water, nutrients, sunlight, and space for plants."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that organisms resemble their parents and have structures and processes that help them survive within their environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "sort plants and animals into groups based on physical characteristics such as color, size, body covering, or leaf shape;"}
        },
        {
            "competencyText": {"en-us": "identify basic parts of plants and animals;"}
        },
        {
            "competencyText": {"en-us": "identify ways that young plants resemble the parent plant; and"}
        },
        {
            "competencyText": {"en-us": "observe changes that are part of a simple life cycle of a plant: seed, seedling, plant, flower, and fruit."}
        },
        {
            "competencyText": {"en-us": "Science, Grade 1, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.12 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\""}
        },
        {
            "competencyText": {"en-us": "Recurring themes are pervasive in sciences, mathematics, and technology. These ideas transcend disciplinary boundaries and include patterns, cycles, systems, models, and change and constancy."}
        },
        {
            "competencyText": {"en-us": "The study of elementary science includes planning and safely implementing classroom and outdoor investigations using scientific processes, including inquiry methods, analyzing information, making informed decisions, and using tools to collect and record information, while addressing the major concepts and vocabulary, in the context of physical, earth, and life sciences. Districts are encouraged to facilitate classroom and outdoor investigations for at least 80% of instructional time."}
        },
        {
            "competencyText": {"en-us": "In Grade 1, students observe and describe the natural world using their senses. Students do science as inquiry in order to develop and enrich their abilities to understand the world around them in the context of scientific concepts and processes. Students develop vocabulary through their experiences investigating properties of common objects, earth materials, and organisms."}
        },
        {
            "competencyText": {"en-us": "A central theme in first grade science is active engagement in asking questions, creating a method to answer those questions, answering those questions, communicating ideas, and exploring with scientific tools in order to explain scientific concepts and processes like scientific investigation and reasoning; matter and energy; force, motion, and energy; Earth and space; and organisms and environment. Scientific investigation and reasoning involves practicing safe procedures, asking questions about the natural world, and seeking answers to those questions through simple observations used in descriptive investigations."}
        },
        {
            "competencyText": {"en-us": "Matter is described in terms of its physical properties, including relative size, weight, shape, color, and texture. The importance of light, thermal, and sound energy is identified as it relates to the students' everyday life. The location and motion of objects are explored."}
        },
        {
            "competencyText": {"en-us": "Weather is recorded and discussed on a daily basis so students may begin to recognize patterns in the weather. In addition, patterns are observed in the appearance of objects in the sky."}
        },
        {
            "competencyText": {"en-us": "In life science, students recognize the interdependence of organisms in the natural world. They understand that all organisms have basic needs that can be satisfied through interactions with living and nonliving things. Students will investigate life cycles of animals and identify likenesses between parents and offspring."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student conducts classroom and outdoor investigations following home and school safety procedures and uses environmentally appropriate and responsible practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify, discuss, and demonstrate safe and healthy practices as outlined in Texas Education agency-approved safety standards during classroom and outdoor investigations, including wearing safety goggles or chemical splash goggles, as appropriate, washing hands, and using materials appropriately; and"}
        },
        {
            "competencyText": {"en-us": "identify and learn how to use natural resources and materials, including conservation and reuse or recycling of paper, plastic, and metals."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student develops abilities to ask questions and seek answers in classroom and outdoor investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask questions about organisms, objects, and events observed in the natural world;"}
        },
        {
            "competencyText": {"en-us": "plan and conduct simple descriptive investigations;"}
        },
        {
            "competencyText": {"en-us": "collect data and make observations using simple tools;"}
        },
        {
            "competencyText": {"en-us": "record and organize data using pictures, numbers, and words; and"}
        },
        {
            "competencyText": {"en-us": "communicate observations and provide reasons for explanations using student-generated data from simple descriptive investigations."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student knows that information and critical thinking are used in scientific problem solving. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and explain a problem and propose a solution;"}
        },
        {
            "competencyText": {"en-us": "make predictions based on observable patterns; and"}
        },
        {
            "competencyText": {"en-us": "describe what scientists do."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses age-appropriate tools and models to investigate the natural world. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "collect, record, and compare information using tools, including computers, hand lenses, primary balances, cups, bowls, magnets, collecting nets, notebooks, and safety goggles or chemical splash goggles, as appropriate; timing devices; non-standard measuring items; weather instruments such as demonstration thermometers and wind socks; and materials to support observations of habitats of organisms such as aquariums and terrariums; and"}
        },
        {
            "competencyText": {"en-us": "measure and compare organisms and objects using non-standard units."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that objects have properties and patterns. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "classify objects by observable properties such as larger and smaller, heavier and lighter, shape, color, and texture;"}
        },
        {
            "competencyText": {"en-us": "predict and identify changes in materials caused by heating and cooling; and"}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows that force, motion, and energy are related and are a part of everyday life. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and discuss how different forms of energy such as light, thermal, and sound are important to everyday life;"}
        },
        {
            "competencyText": {"en-us": "predict and describe how a magnet can be used to push or pull an object; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate and record the ways that objects can move such as in a straight line, zig zag, up and down, back and forth, round and round, and fast and slow."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that the natural world includes rocks, soil, and water that can be observed in cycles, patterns, and systems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe, compare, describe, and sort components of soil by size, texture, and color;"}
        },
        {
            "competencyText": {"en-us": "identify and describe a variety of natural sources of water, including streams, lakes, and oceans; and"}
        },
        {
            "competencyText": {"en-us": "identify how rocks, soil, and water are used to make products."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that the natural world includes the air around us and objects in the sky. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "record weather information, including relative temperature such as hot or cold, clear or cloudy, calm or windy, and rainy or icy;"}
        },
        {
            "competencyText": {"en-us": "observe and record changes in the appearance of objects in the sky such as the Moon and stars, including the Sun;"}
        },
        {
            "competencyText": {"en-us": "identify characteristics of the seasons of the year and day and night; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate that air is all around us and observe that wind is moving air."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that the living environment is composed of relationships between organisms and the life cycles that occur. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "sort and classify living and nonliving things based upon whether they have basic needs and produce offspring;"}
        },
        {
            "competencyText": {"en-us": "analyze and record examples of interdependence found in various situations such as terrariums and aquariums or pet and caregiver; and"}
        },
        {
            "competencyText": {"en-us": "gather evidence of interdependence among living organisms such as energy transfer through food chains or animals using plants for shelter."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that organisms resemble their parents and have structures and processes that help them survive within their environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate how the external characteristics of an animal are related to where it lives, how it moves, and what it eats;"}
        },
        {
            "competencyText": {"en-us": "identify and compare the parts of plants;"}
        },
        {
            "competencyText": {"en-us": "compare ways that young animals resemble their parents; and"}
        },
        {
            "competencyText": {"en-us": "observe and record life cycles of animals such as a chicken, frog, or fish."}
        },
        {
            "competencyText": {"en-us": "Science, Grade 2, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.13 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\""}
        },
        {
            "competencyText": {"en-us": "Recurring themes are pervasive in sciences, mathematics, and technology. These ideas transcend disciplinary boundaries and include patterns, cycles, systems, models, and change and constancy."}
        },
        {
            "competencyText": {"en-us": "The study of elementary science includes planning and safely implementing classroom and outdoor investigations using scientific processes, including inquiry methods, analyzing information, making informed decisions, and using tools to collect and record information, while addressing the major concepts and vocabulary, in the context of physical, earth, and life sciences. Districts are encouraged to facilitate classroom and outdoor investigations for at least 60% of instructional time."}
        },
        {
            "competencyText": {"en-us": "In Grade 2, careful observation and investigation are used to learn about the natural world and reveal patterns, changes, and cycles. Students should understand that certain types of questions can be answered by using observation and investigations and that the information gathered in these investigations may change as new observations are made. As students participate in investigation, they develop the skills necessary to do science as well as develop new science concepts."}
        },
        {
            "competencyText": {"en-us": "Within the physical environment, students expand their understanding of the properties of objects such as temperature, shape, and flexibility then use those properties to compare, classify, and then combine the objects to do something that they could not do before. Students manipulate objects to demonstrate a change in motion and position."}
        },
        {
            "competencyText": {"en-us": "Within the natural environment, students will observe the properties of earth materials as well as predictable patterns that occur on Earth and in the sky. The students understand that those patterns are used to make choices in clothing, activities, and transportation."}
        },
        {
            "competencyText": {"en-us": "Within the living environment, students explore patterns, systems, and cycles by investigating characteristics of organisms, life cycles, and interactions among all the components within their habitat. Students examine how living organisms depend on each other and on their environment."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student conducts classroom and outdoor investigations following home and school safety procedures. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify, describe, and demonstrate safe practices as outlined in Texas Education Agency-approved safety standards during classroom and outdoor investigations, including wearing safety goggles or chemical splash goggles, as appropriate, washing hands, and using materials appropriately; and"}
        },
        {
            "competencyText": {"en-us": "identify and demonstrate how to use, conserve, and dispose of natural resources and materials such as conserving water and reuse or recycling of paper, plastic, and metal."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student develops abilities necessary to do scientific inquiry in classroom and outdoor investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "ask questions about organisms, objects, and events during observations and investigations;"}
        },
        {
            "competencyText": {"en-us": "plan and conduct descriptive investigations;"}
        },
        {
            "competencyText": {"en-us": "collect data from observations using scientific tools;"}
        },
        {
            "competencyText": {"en-us": "record and organize data using pictures, numbers, and words;"}
        },
        {
            "competencyText": {"en-us": "communicate observations and justify explanations using student-generated data from simple descriptive investigations; and"}
        },
        {
            "competencyText": {"en-us": "compare results of investigations with what students and scientists know about the world."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student knows that information and critical thinking, scientific problem solving, and the contributions of scientists are used in making decisions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and explain a problem and propose a task and solution for the problem;"}
        },
        {
            "competencyText": {"en-us": "make predictions based on observable patterns; and"}
        },
        {
            "competencyText": {"en-us": "identify what a scientist is and explore what different scientists do."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses age-appropriate tools and models to investigate the natural world. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "collect, record, and compare information using tools, including computers, hand lenses, rulers, plastic beakers, magnets, collecting nets, notebooks, and safety goggles or chemical splash goggles, as appropriate; timing devices; weather instruments such as thermometers, wind vanes, and rain gauges; and materials to support observations of habitats of organisms such as terrariums and aquariums; and"}
        },
        {
            "competencyText": {"en-us": "measure and compare organisms and objects."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that matter has physical properties and those properties determine how it is described, classified, changed, and used. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "classify matter by physical properties, including relative temperature, texture, flexibility, and whether material is a solid or liquid;"}
        },
        {
            "competencyText": {"en-us": "compare changes in materials caused by heating and cooling;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that things can be done to materials such as cutting, folding, sanding, and melting to change their physical properties; and"}
        },
        {
            "competencyText": {"en-us": "combine materials that when put together can do things that they cannot do by themselves such as building a tower or a bridge and justify the selection of those materials based on their physical properties."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows that forces cause change and energy exists in many forms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate the effects on objects by increasing or decreasing amounts of light, heat, and sound energy such as how the color of an object appears different in dimmer light or how heat melts butter;"}
        },
        {
            "competencyText": {"en-us": "observe and identify how magnets are used in everyday life; and"}
        },
        {
            "competencyText": {"en-us": "trace and compare patterns of movement of objects such as sliding, rolling, and spinning over time."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that the natural world includes earth materials. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe, describe, and compare rocks by size, texture, and color;"}
        },
        {
            "competencyText": {"en-us": "identify and compare the properties of natural sources of freshwater and saltwater; and"}
        },
        {
            "competencyText": {"en-us": "distinguish between natural and manmade resources."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that there are recognizable patterns in the natural world and among objects in the sky. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "measure, record, and graph weather information, including temperature, wind conditions, precipitation, and cloud coverage, in order to identify patterns in the data;"}
        },
        {
            "competencyText": {"en-us": "identify the importance of weather and seasonal information to make choices in clothing, activities, and transportation; and"}
        },
        {
            "competencyText": {"en-us": "observe, describe, and record patterns of objects in the sky, including the appearance of the Moon."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that living organisms have basic needs that must be met for them to survive within their environment. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify the basic needs of plants and animals;"}
        },
        {
            "competencyText": {"en-us": "identify factors in the environment, including temperature and precipitation, that affect growth and behavior such as migration, hibernation, and dormancy of living things; and"}
        },
        {
            "competencyText": {"en-us": "compare the ways living organisms depend on each other and on their environments such as through food chains."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that organisms resemble their parents and have structures and processes that help them survive within their environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe, record, and compare how the physical characteristics and behaviors of animals help them meet their basic needs;"}
        },
        {
            "competencyText": {"en-us": "observe, record, and compare how the physical characteristics of plants help them meet their basic needs such as stems carry water throughout the plant; and"}
        },
        {
            "competencyText": {"en-us": "investigate and record some of the unique stages that insects such as grasshoppers and butterflies undergo during their life cycle."}
        },
        {
            "competencyText": {"en-us": "Science, Grade 3, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.14 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\""}
        },
        {
            "competencyText": {"en-us": "Recurring themes are pervasive in sciences, mathematics, and technology. These ideas transcend disciplinary boundaries and include patterns, cycles, systems, models, and change and constancy."}
        },
        {
            "competencyText": {"en-us": "The study of elementary science includes planning and safely implementing classroom and outdoor investigations using scientific practices, analyzing information, making informed decisions, and using tools to collect and record information while addressing the content and vocabulary in physical, earth, and life sciences. Districts are encouraged to facilitate classroom and outdoor investigations for at least 60% of instructional time."}
        },
        {
            "competencyText": {"en-us": "In Grade 3, students learn that the study of science uses appropriate tools and safe practices in planning and implementing investigations, asking and answering questions, collecting data by observing and measuring, and using models to support scientific inquiry about the natural world."}
        },
        {
            "competencyText": {"en-us": "Within the physical environment, students recognize that patterns, relationships, and cycles exist in matter. Students will investigate the physical properties of matter and will learn that changes occur. They explore mixtures and investigate light, sound, and thermal energy in everyday life. Students manipulate objects by pushing and pulling to demonstrate changes in motion and position."}
        },
        {
            "competencyText": {"en-us": "Within the natural environment, students investigate how the surface of Earth changes and provides resources that humans use. As students explore objects in the sky, they describe how relationships affect patterns and cycles on Earth. Students will construct models to demonstrate Sun, Earth, and Moon system relationships."}
        },
        {
            "competencyText": {"en-us": "Within the living environment, students explore patterns, systems, and cycles within environments by investigating characteristics of organisms, life cycles, and interactions among all components of the natural environment. Students examine how the environment plays a key role in survival. Students know that when changes in the environment occur organisms may thrive, become ill, or perish."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student conducts classroom and outdoor investigations following home and school safety procedures and environmentally appropriate practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices as described in Texas Education Agency-approved safety standards during classroom and outdoor investigations using safety equipment as appropriate, including safety goggles or chemical splash goggles, as appropriate, and gloves; and"}
        },
        {
            "competencyText": {"en-us": "make informed choices in the use and conservation of natural resources by recycling or reusing materials such as paper, aluminum cans, and plastics."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses scientific practices during laboratory and outdoor investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "plan and implement descriptive investigations, including asking and answering questions, making inferences, and selecting and using equipment or technology needed, to solve a specific problem in the natural world;"}
        },
        {
            "competencyText": {"en-us": "collect and record data by observing and measuring using the metric system and recognize differences between observed and measured data;"}
        },
        {
            "competencyText": {"en-us": "construct maps, graphic organizers, simple tables, charts, and bar graphs using tools and current technology to organize, examine, and evaluate measured data;"}
        },
        {
            "competencyText": {"en-us": "analyze and interpret patterns in data to construct reasonable explanations based on evidence from investigations;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that repeated investigations may increase the reliability of results; and"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions supported by data in writing, by drawing pictures, and through verbal discussion."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student knows that information, critical thinking, scientific problem solving, and the contributions of scientists are used in making decisions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using evidence, logical reasoning, and experimental and observational testing;"}
        },
        {
            "competencyText": {"en-us": "represent the natural world using models such as volcanoes or the Sun, Earth, and Moon system and identify their limitations, including size, properties, and materials; and"}
        },
        {
            "competencyText": {"en-us": "connect grade-level appropriate science concepts with the history of science, science careers, and contributions of scientists."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student knows how to use a variety of tools and methods to conduct science inquiry. The student is expected to collect, record, and analyze information using tools, including cameras, computers, hand lenses, metric rulers, Celsius thermometers, wind vanes, rain gauges, pan balances, graduated cylinders, beakers, spring scales, hot plates, meter sticks, magnets, collecting nets, notebooks, and Sun, Earth, and Moon system models; timing devices; and materials to support observation of habitats of organisms such as terrariums and aquariums."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that matter has measurable physical properties and those properties determine how matter is classified, changed, and used. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "measure, test, and record physical properties of matter, including temperature, mass, magnetism, and the ability to sink or float;"}
        },
        {
            "competencyText": {"en-us": "describe and classify samples of matter as solids, liquids, and gases and demonstrate that solids have a definite shape and that liquids and gases take the shape of their container;"}
        },
        {
            "competencyText": {"en-us": "predict, observe, and record changes in the state of matter caused by heating or cooling such as ice becoming liquid water, condensation forming on the outside of a glass of ice water, or liquid water being heated to the point of becoming water vapor; and"}
        },
        {
            "competencyText": {"en-us": "explore and recognize that a mixture is created when two materials are combined such as gravel and sand or metal and plastic paper clips."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows that forces cause change and that energy exists in many forms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explore different forms of energy, including mechanical, light, sound, and thermal in everyday life;"}
        },
        {
            "competencyText": {"en-us": "demonstrate and observe how position and motion can be changed by pushing and pulling objects such as swings, balls, and wagons; and"}
        },
        {
            "competencyText": {"en-us": "observe forces such as magnetism and gravity acting on objects."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that Earth consists of natural resources and its surface is constantly changing. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explore and record how soils are formed by weathering of rock and the decomposition of plant and animal remains;"}
        },
        {
            "competencyText": {"en-us": "investigate rapid changes in Earth's surface such as volcanic eruptions, earthquakes, and landslides; and"}
        },
        {
            "competencyText": {"en-us": "explore the characteristics of natural resources that make them useful in products and materials such as clothing and furniture and how resources may be conserved."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows there are recognizable patterns in the natural world and among objects in the sky. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe, measure, record, and compare day-to-day weather changes in different locations at the same time that include air temperature, wind direction, and precipitation;"}
        },
        {
            "competencyText": {"en-us": "describe and illustrate the Sun as a star composed of gases that provides light and thermal energy;"}
        },
        {
            "competencyText": {"en-us": "construct models that demonstrate the relationship of the Sun, Earth, and Moon, including orbits and positions; and"}
        },
        {
            "competencyText": {"en-us": "identify the planets in Earth's solar system and their position in relation to the Sun."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows and can describe patterns, cycles, systems, and relationships within the environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe and describe the physical characteristics of environments and how they support populations and communities of plants and animals within an ecosystem;"}
        },
        {
            "competencyText": {"en-us": "identify and describe the flow of energy in a food chain and predict how changes in a food chain affect the ecosystem such as removal of frogs from a pond or bees from a field; and"}
        },
        {
            "competencyText": {"en-us": "describe environmental changes such as floods and droughts where some organisms thrive and others perish or move to new locations."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that organisms undergo similar life processes and have structures that help them survive within their environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explore how structures and functions of plants and animals allow them to survive in a particular environment; and"}
        },
        {
            "competencyText": {"en-us": "investigate and compare how animals and plants undergo a series of orderly changes in their diverse life cycles such as tomato plants, frogs, and lady beetles."}
        },
        {
            "competencyText": {"en-us": "Science, Grade 4, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.15 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\""}
        },
        {
            "competencyText": {"en-us": "Recurring themes are pervasive in sciences, mathematics, and technology. These ideas transcend disciplinary boundaries and include patterns, cycles, systems, models, and change and constancy."}
        },
        {
            "competencyText": {"en-us": "The study of elementary science includes planning and safely implementing classroom and outdoor investigations using scientific processes, including inquiry methods, analyzing information, making informed decisions, and using tools to collect and record information, while addressing the major concepts and vocabulary, in the context of physical, earth, and life sciences. Districts are encouraged to facilitate classroom and outdoor investigations for at least 50% of instructional time."}
        },
        {
            "competencyText": {"en-us": "In Grade 4, investigations are used to learn about the natural world. Students should understand that certain types of questions can be answered by investigations and that methods, models, and conclusions built from these investigations change as new observations are made. Models of objects and events are tools for understanding the natural world and can show how systems work. They have limitations and, based on new discoveries, are constantly being modified to more closely reflect the natural world."}
        },
        {
            "competencyText": {"en-us": "Within the natural environment, students know that earth materials have properties that are constantly changing due to Earth's forces. The students learn that the natural world consists of resources, including renewable and nonrenewable, and their responsibility to conserve our natural resources for future generations. They will also explore Sun, Earth, and Moon relationships. The students will recognize that our major source of energy is the Sun."}
        },
        {
            "competencyText": {"en-us": "Within the living environment, students know and understand that living organisms within an ecosystem interact with one another and with their environment. The students will recognize that plants and animals have basic needs, and they are met through a flow of energy known as food webs. Students will explore how all living organisms go through a life cycle and have structures that enable organisms to survive in their ecosystem."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student conducts classroom and outdoor investigations, following home and school safety procedures and environmentally appropriate and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices and the use of safety equipment as described in Texas Education Agency-approved safety standards during classroom and outdoor investigations using safety equipment, including safety goggles or chemical splash goggles, as appropriate, and gloves, as appropriate; and"}
        },
        {
            "competencyText": {"en-us": "make informed choices in the use and conservation of natural resources and reusing and recycling of materials such as paper, aluminum, glass, cans, and plastic."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses scientific practices during laboratory and outdoor investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "plan and implement descriptive investigations, including asking well defined questions, making inferences, and selecting and using appropriate equipment or technology to answer his/her questions;"}
        },
        {
            "competencyText": {"en-us": "collect and record data by observing and measuring, using the metric system, and using descriptive words and numerals such as labeled drawings, writing, and concept maps;"}
        },
        {
            "competencyText": {"en-us": "construct simple tables, charts, bar graphs, and maps using tools and current technology to organize, examine, and evaluate data;"}
        },
        {
            "competencyText": {"en-us": "analyze data and interpret patterns to construct reasonable explanations from data that can be observed and measured;"}
        },
        {
            "competencyText": {"en-us": "perform repeated investigations to increase the reliability of results; and"}
        },
        {
            "competencyText": {"en-us": "communicate valid oral and written results supported by data."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses critical thinking and scientific problem solving to make informed decisions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using evidence, logical reasoning, and experimental and observational testing;"}
        },
        {
            "competencyText": {"en-us": "represent the natural world using models such as the water cycle and stream tables and identify their limitations, including accuracy and size; and"}
        },
        {
            "competencyText": {"en-us": "connect grade-level appropriate science concepts with the history of science, science careers, and contributions of scientists."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student knows how to use a variety of tools, materials, equipment, and models to conduct science inquiry. The student is expected to collect, record, and analyze information using tools, including calculators, microscopes, cameras, computers, hand lenses, metric rulers, Celsius thermometers, mirrors, spring scales, balances, graduated cylinders, beakers, hot plates, meter sticks, magnets, collecting nets, and notebooks; timing devices; and materials to support observation of habitats of organisms such as terrariums and aquariums."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that matter has measurable physical properties and those properties determine how matter is classified, changed, and used. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "measure, compare, and contrast physical properties of matter, including mass, volume, states (solid, liquid, gas), temperature, magnetism, and the ability to sink or float; and"}
        },
        {
            "competencyText": {"en-us": "compare and contrast a variety of mixtures, including solutions."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows that energy exists in many forms and can be observed in cycles, patterns, and systems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "differentiate among forms of energy, including mechanical, sound, electrical, light, and thermal;"}
        },
        {
            "competencyText": {"en-us": "differentiate between conductors and insulators of thermal and electrical energy;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that electricity travels in a closed path, creating an electrical circuit; and"}
        },
        {
            "competencyText": {"en-us": "design a descriptive investigation to explore the effect of force on an object such as a push or a pull, gravity, friction, or magnetism."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The students know that Earth consists of useful resources and its surface is constantly changing. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "examine properties of soils, including color and texture, capacity to retain water, and ability to support the growth of plants;"}
        },
        {
            "competencyText": {"en-us": "observe and identify slow changes to Earth's surface caused by weathering, erosion, and deposition from water, wind, and ice; and"}
        },
        {
            "competencyText": {"en-us": "identify and classify Earth's renewable resources, including air, plants, water, and animals, and nonrenewable resources, including coal, oil, and natural gas, and the importance of conservation."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that there are recognizable patterns in the natural world and among the Sun, Earth, and Moon system. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "measure, record, and predict changes in weather;"}
        },
        {
            "competencyText": {"en-us": "describe and illustrate the continuous movement of water above and on the surface of Earth through the water cycle and explain the role of the Sun as a major source of energy in this process; and"}
        },
        {
            "competencyText": {"en-us": "collect and analyze data to identify sequences and predict patterns of change in shadows, seasons, and the observable appearance of the Moon over time."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows and understands that living organisms within an ecosystem interact with one another and with their environment. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate that most producers need sunlight, water, and carbon dioxide to make their own food, while consumers are dependent on other organisms for food; and"}
        },
        {
            "competencyText": {"en-us": "describe the flow of energy through food webs, beginning with the Sun, and predict how changes in the ecosystem affect the food web."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that organisms undergo similar life processes and have structures and behaviors that help them survive within their environment. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explore how structures and functions enable organisms to survive in their environment;"}
        },
        {
            "competencyText": {"en-us": "explore and describe examples of traits that are inherited from parents to offspring such as eye color and shapes of leaves and behaviors that are learned such as reading a book and a wolf pack teaching their pups to hunt effectively; and"}
        },
        {
            "competencyText": {"en-us": "explore, illustrate, and compare life cycles in living organisms such as beetles, crickets, radishes, or lima beans."}
        },
        {
            "competencyText": {"en-us": "Science, Grade 5, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.16 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\""}
        },
        {
            "competencyText": {"en-us": "Recurring themes are pervasive in sciences, mathematics, and technology. These ideas transcend disciplinary boundaries and include patterns, cycles, systems, models, and change and constancy."}
        },
        {
            "competencyText": {"en-us": "The study of elementary science includes planning and safely implementing classroom and outdoor investigations using scientific processes, including inquiry methods, analyzing information, making informed decisions, and using tools to collect and record information, while addressing the major concepts and vocabulary, in the context of physical, earth, and life sciences. Districts are encouraged to facilitate classroom and outdoor investigations for at least 50% of instructional time."}
        },
        {
            "competencyText": {"en-us": "In Grade 5, scientific investigations are used to learn about the natural world. Students should understand that certain types of questions can be answered by investigations and that methods, models, and conclusions built from these investigations change as new observations are made. Models of objects and events are tools for understanding the natural world and can show how systems work. They have limitations and based on new discoveries are constantly being modified to more closely reflect the natural world."}
        },
        {
            "competencyText": {"en-us": "Within the physical environment, students learn about the physical properties of matter, including magnetism, mass, physical states of matter, relative density, solubility in water, and the ability to conduct or insulate electrical and thermal energy. Students explore the uses of light, thermal, electrical, mechanical, and sound energies."}
        },
        {
            "competencyText": {"en-us": "Within the natural environment, students learn how changes occur on Earth's surface and that predictable patterns occur in the sky. Students learn that the natural world consists of resources, including nonrenewable and renewable."}
        },
        {
            "competencyText": {"en-us": "Within the living environment, students learn that structure and function of organisms can improve the survival of members of a species. Students learn to differentiate between inherited traits and learned behaviors."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student conducts classroom and outdoor investigations following home and school safety procedures and environmentally appropriate and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices and the use of safety equipment as outlined in Texas Education Agency-approved safety standards during classroom and outdoor investigations using safety equipment, including safety goggles or chemical splash goggles, as appropriate, and gloves, as appropriate; and"}
        },
        {
            "competencyText": {"en-us": "make informed choices in the conservation, disposal, and recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses scientific practices during laboratory and outdoor investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe, plan, and implement simple experimental investigations testing one variable;"}
        },
        {
            "competencyText": {"en-us": "ask well defined questions, formulate testable hypotheses, and select and use appropriate equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "collect and record information using detailed observations and accurate measuring;"}
        },
        {
            "competencyText": {"en-us": "analyze and interpret information to construct reasonable explanations from direct (observable) and indirect (inferred) evidence;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that repeated investigations may increase the reliability of results;"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions in both written and verbal forms; and"}
        },
        {
            "competencyText": {"en-us": "construct appropriate simple graphs, tables, maps, and charts using technology, including computers, to organize, examine, and evaluate information."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses critical thinking and scientific problem solving to make informed decisions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using evidence, logical reasoning, and experimental and observational testing;"}
        },
        {
            "competencyText": {"en-us": "draw or develop a model that represents how something that cannot be seen such as the Sun, Earth, and Moon system and formation of sedimentary rock works or looks; and"}
        },
        {
            "competencyText": {"en-us": "connect grade-level appropriate science concepts with the history of science, science careers, and contributions of scientists."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student knows how to use a variety of tools and methods to conduct science inquiry. The student is expected to collect, record, and analyze information using tools, including calculators, microscopes, cameras, computers, hand lenses, metric rulers, Celsius thermometers, prisms, mirrors, balances, spring scales, graduated cylinders, beakers, hot plates, meter sticks, magnets, collecting nets, and notebooks; timing devices; and materials to support observations of habitats or organisms such as terrariums and aquariums."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that matter has measurable physical properties and those properties determine how matter is classified, changed, and used. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "classify matter based on measurable, testable, and observable physical properties, including mass, magnetism, physical state (solid, liquid, and gas), relative density (sinking and floating using water as a reference point), solubility in water, and the ability to conduct or insulate thermal energy or electric energy;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that some mixtures maintain physical properties of their ingredients such as iron filings and sand and sand and water; and"}
        },
        {
            "competencyText": {"en-us": "identify changes that can occur in the physical properties of the ingredients of solutions such as dissolving salt in water or adding lemon juice to water."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows that energy occurs in many forms and can be observed in cycles, patterns, and systems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explore the uses of energy, including mechanical, light, thermal, electrical, and sound energy;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that the flow of electricity in closed circuits can produce light, heat, or sound;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that light travels in a straight line until it strikes an object and is reflected or travels through one medium to another and is refracted; and"}
        },
        {
            "competencyText": {"en-us": "design a simple experimental investigation that tests the effect of force on an object."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows Earth's surface is constantly changing and consists of useful resources. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explore the processes that led to the formation of sedimentary rocks and fossil fuels; and"}
        },
        {
            "competencyText": {"en-us": "recognize how landforms such as deltas, canyons, and sand dunes are the result of changes to Earth's surface by wind, water, or ice."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that there are recognizable patterns in the natural world and among the Sun, Earth, and Moon system. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "differentiate between weather and climate;"}
        },
        {
            "competencyText": {"en-us": "explain how the Sun and the ocean interact in the water cycle;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that Earth rotates on its axis once approximately every 24 hours causing the day/night cycle and the apparent movement of the Sun across the sky; and"}
        },
        {
            "competencyText": {"en-us": "identify and compare the physical characteristics of the Sun, Earth, and Moon."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that there are relationships, systems, and cycles within environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe the way organisms live and survive in their ecosystem by interacting with the living and nonliving components;"}
        },
        {
            "competencyText": {"en-us": "describe the flow of energy within a food web, including the roles of the Sun, producers, consumers, and decomposers;"}
        },
        {
            "competencyText": {"en-us": "predict the effects of changes in ecosystems caused by living organisms, including humans, such as the overpopulation of grazers or the building of highways; and"}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that organisms have structures and behaviors that help them survive within their environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare the structures and functions of different species that help them live and survive in a specific environment such as hooves on prairie animals or webbed feet in aquatic animals; and"}
        },
        {
            "competencyText": {"en-us": "differentiate between inherited traits of plants and animals such as spines on a cactus or shape of a beak and learned behaviors such as an animal learning tricks or a child riding a bicycle."}
        },
        {
            "competencyText": {"en-us": "Implementation of Texas Essential Knowledge and Skills for Science, Elementary, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.10 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 24, 2010, 35 TexReg 7230",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The provisions of §§112.11-112.16 of this subchapter shall be implemented by school districts beginning with the 2018-2019 school year."}
        },
        {
            "competencyText": {"en-us": "Subchapter B. Middle School"}
        },
        {
            "competencyText": {"en-us": "Science, Grade 6, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.18 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Science, as defined by the National Academy of Science, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power that have been tested over a wide variety of conditions become theories. Scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Students should know that scientific theories, unlike hypotheses, are well established and highly reliable, but they may still be subject to change as new information and technologies are developed. Students should be able to distinguish between scientific decision-making methods and ethical/social decisions that involve the application of scientific information."}
        },
        {
            "competencyText": {"en-us": "Grade 6 science is interdisciplinary in nature; however, much of the content focus is on physical science. National standards in science are organized as multi-grade blocks such as Grades 5-8 rather than individual grade levels. In order to follow the grade level format used in Texas, the various national standards are found among Grades 6, 7, and 8. Recurring themes are pervasive in sciences, mathematics, and technology. These ideas transcend disciplinary boundaries and include change and constancy, patterns, cycles, systems, models, and scale. The strands for Grade 6 include the following."}
        },
        {
            "competencyText": {"en-us": "Scientific investigations and reasoning."}
        },
        {
            "competencyText": {"en-us": "To develop a rich knowledge of science and the natural world, students must become familiar with different modes of scientific inquiry, rules of evidence, ways of formulating questions, ways of proposing explanations, and the diverse ways scientists study the natural world and propose explanations based on evidence derived from their work."}
        },
        {
            "competencyText": {"en-us": "Scientific investigations are conducted for different reasons. All investigations require a research question, careful observations, data gathering, and analysis of the data to identify the patterns that will explain the findings. Descriptive investigations are used to explore new phenomena such as conducting surveys of organisms or measuring the abiotic components in a given habitat. Descriptive statistics include frequency, range, mean, median, and mode. A hypothesis is not required in a descriptive investigation. On the other hand, when conditions can be controlled in order to focus on a single variable, experimental research design is used to determine causation. Students should experience both types of investigations and understand that different scientific research questions require different research designs."}
        },
        {
            "competencyText": {"en-us": "Scientific investigations are used to learn about the natural world. Students should understand that certain types of questions can be answered by investigations, and the methods, models, and conclusions built from these investigations change as new observations are made. Models of objects and events are tools for understanding the natural world and can show how systems work. Models have limitations and based on new discoveries are constantly being modified to more closely reflect the natural world."}
        },
        {
            "competencyText": {"en-us": "Matter and energy."}
        },
        {
            "competencyText": {"en-us": "Matter can be classified as elements, compounds, or mixtures. Students have already had experience with mixtures in Grade 5, so Grade 6 will concentrate on developing an understanding of elements and compounds. It is important that students learn the differences between elements and compounds based on observations, description of physical properties, and chemical reactions. Elements are represented by chemical symbols, while compounds are represented by chemical formulas. Subsequent grades will learn about the differences at the molecular and atomic level."}
        },
        {
            "competencyText": {"en-us": "Elements are classified as metals, nonmetals, and metalloids based on their physical properties. The elements are divided into three groups on the Periodic Table. Each different substance usually has a different density, so density can be used as an identifying property. Therefore, calculating density aids classification of substances."}
        },
        {
            "competencyText": {"en-us": "Energy resources are available on a renewable or nonrenewable basis. Understanding the origins and uses of these resources enables informed decision making. Students should consider the ethical/social issues surrounding Earth's natural energy resources, while looking at the advantages and disadvantages of their long-term uses."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. Energy occurs in two types, potential and kinetic, and can take several forms. Thermal energy can be transferred by conduction, convection, or radiation. It can also be changed from one form to another. Students will investigate the relationship between force and motion using a variety of means, including calculations and measurements."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The focus of this strand is on introducing Earth's processes. Students should develop an understanding of Earth as part of our solar system. The topics include organization of our solar system, the role of gravity, and space exploration."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. Students will gain an understanding of the broadest taxonomic classifications of organisms and how characteristics determine their classification. The other major topics developed in this strand include the interdependence between organisms and their environments and the levels of organization within an ecosystem."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student, for at least 40% of instructional time, conducts laboratory and field investigations following safety procedures and environmentally appropriate and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations as outlined in Texas Education Agency-approved safety standards; and"}
        },
        {
            "competencyText": {"en-us": "practice appropriate use and conservation of resources, including disposal, reuse, or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses scientific practices during laboratory and field investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "plan and implement comparative and descriptive investigations by making observations, asking well defined questions, and using appropriate equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "design and implement experimental investigations by making observations, asking well defined questions, formulating testable hypotheses, and using appropriate equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "collect and record data using the International System of Units (SI) and qualitative means such as labeled drawings, writing, and graphic organizers;"}
        },
        {
            "competencyText": {"en-us": "construct tables and graphs, using repeated trials and means, to organize data and identify patterns; and"}
        },
        {
            "competencyText": {"en-us": "analyze data to formulate reasonable explanations, communicate valid conclusions supported by the data, and predict trends."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions and knows the contributions of relevant scientists. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "use models to represent aspects of the natural world such as a model of Earth's layers;"}
        },
        {
            "competencyText": {"en-us": "identify advantages and limitations of models such as size, scale, properties, and materials; and"}
        },
        {
            "competencyText": {"en-us": "relate the impact of research on scientific thought and society, including the history of science and contributions of scientists as related to the content."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student knows how to use a variety of tools and safety equipment to conduct science inquiry. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use appropriate tools, including journals/notebooks, beakers, Petri dishes, meter sticks, graduated cylinders, hot plates, test tubes, balances, microscopes, thermometers, calculators, computers, timing devices, and other necessary equipment to collect, record, and analyze information; and"}
        },
        {
            "competencyText": {"en-us": "use preventative safety equipment, including chemical splash goggles, aprons, and gloves, and be prepared to use emergency safety equipment, including an eye/face wash, a fire blanket, and a fire extinguisher."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows the differences between elements and compounds. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "know that an element is a pure substance represented by a chemical symbol and that a compound is a pure substance represented by a chemical formula;"}
        },
        {
            "competencyText": {"en-us": "recognize that a limited number of the many known elements comprise the largest portion of solid Earth, living matter, oceans, and the atmosphere; and"}
        },
        {
            "competencyText": {"en-us": "identify the formation of a new substance by using the evidence of a possible chemical change such as production of a gas, change in temperature, production of a precipitate, or color change."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows matter has physical properties that can be used for classification. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare metals, nonmetals, and metalloids using physical properties such as luster, conductivity, or malleability;"}
        },
        {
            "competencyText": {"en-us": "calculate density to identify an unknown substance; and"}
        },
        {
            "competencyText": {"en-us": "test the physical properties of minerals, including hardness, color, luster, and streak."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that some of Earth's energy resources are available on a nearly perpetual basis, while others can be renewed over a relatively short period of time. Some energy resources, once depleted, are essentially nonrenewable. The student is expected to research and discuss the advantages and disadvantages of using coal, oil, natural gas, nuclear power, biomass, wind, hydropower, geothermal, and solar resources."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows force and motion are related to potential and kinetic energy. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare and contrast potential and kinetic energy;"}
        },
        {
            "competencyText": {"en-us": "identify and describe the changes in position, direction, and speed of an object when acted upon by unbalanced forces;"}
        },
        {
            "competencyText": {"en-us": "calculate average speed using distance and time measurements;"}
        },
        {
            "competencyText": {"en-us": "measure and graph changes in motion; and"}
        },
        {
            "competencyText": {"en-us": "investigate how inclined planes can be used to change the amount of force to move an object."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows that the Law of Conservation of Energy states that energy can neither be created nor destroyed, it just changes form. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate methods of thermal energy transfer, including conduction, convection, and radiation;"}
        },
        {
            "competencyText": {"en-us": "verify through investigations that thermal energy moves in a predictable pattern from warmer to cooler until all the substances attain the same temperature such as an ice cube melting; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate energy transformations such as energy in a flashlight battery changes from chemical energy to electrical energy to light energy."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student understands the structure of Earth, the rock cycle, and plate tectonics. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "build a model to illustrate the compositional and mechanical layers of Earth, including the inner core, outer core, mantle, crust, asthenosphere, and lithosphere;"}
        },
        {
            "competencyText": {"en-us": "classify rocks as metamorphic, igneous, or sedimentary by the processes of their formation;"}
        },
        {
            "competencyText": {"en-us": "identify the major tectonic plates, including Eurasian, African, Indo-Australian, Pacific, North American, and South American; and"}
        },
        {
            "competencyText": {"en-us": "describe how plate tectonics causes major geological events such as ocean basin formation, earthquakes, volcanic eruptions, and mountain building."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student understands the organization of our solar system and the relationships among the various bodies that comprise it. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the physical properties, locations, and movements of the Sun, planets, moons, meteors, asteroids, and comets;"}
        },
        {
            "competencyText": {"en-us": "understand that gravity is the force that governs the motion of our solar system; and"}
        },
        {
            "competencyText": {"en-us": "describe the history and future of space exploration, including the types of equipment and transportation needed for space travel."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows all organisms are classified into domains and kingdoms. Organisms within these taxonomic groups share similar characteristics that allow them to interact with the living and nonliving parts of their ecosystem. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "understand that all organisms are composed of one or more cells;"}
        },
        {
            "competencyText": {"en-us": "recognize that the presence of a nucleus is a key factor used to determine whether a cell is prokaryotic or eukaryotic;"}
        },
        {
            "competencyText": {"en-us": "recognize that the broadest taxonomic classification of living organisms is divided into currently recognized domains;"}
        },
        {
            "competencyText": {"en-us": "identify the basic characteristics of organisms, including prokaryotic or eukaryotic, unicellular or multicellular, autotrophic or heterotrophic, and mode of reproduction, that further classify them in the currently recognized kingdoms;"}
        },
        {
            "competencyText": {"en-us": "describe biotic and abiotic parts of an ecosystem in which organisms interact; and"}
        },
        {
            "competencyText": {"en-us": "diagram the levels of organization within an ecosystem, including organism, population, community, and ecosystem."}
        },
        {
            "competencyText": {"en-us": "Science, Grade 7, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.19 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power that have been tested over a wide variety of conditions become theories. Scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Students should know that scientific theories, unlike hypotheses, are well established and highly reliable, but they may still be subject to change as new information and technologies are developed. Students should be able to distinguish between scientific decision-making methods and ethical/social decisions that involve the application of scientific information."}
        },
        {
            "competencyText": {"en-us": "Grade 7 science is interdisciplinary in nature; however, much of the content focus is on organisms and the environment. National standards in science are organized as multi-grade blocks such as Grades 5-8 rather than individual grade levels. In order to follow the grade level format used in Texas, the various national standards are found among Grades 6, 7, and 8. Recurring themes are pervasive in sciences, mathematics, and technology. These ideas transcend disciplinary boundaries and include change and constancy, patterns, cycles, systems, models, and scale. The strands for Grade 7 include the following."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning."}
        },
        {
            "competencyText": {"en-us": "To develop a rich knowledge of science and the natural world, students must become familiar with different modes of scientific inquiry, rules of evidence, ways of formulating questions, ways of proposing explanations, and the diverse ways scientists study the natural world and propose explanations based on evidence derived from their work."}
        },
        {
            "competencyText": {"en-us": "Scientific investigations are conducted for different reasons. All investigations require a research question, careful observations, data gathering, and analysis of the data to identify the patterns that will explain the findings. Descriptive investigations are used to explore new phenomena such as conducting surveys of organisms or measuring the abiotic components in a given habitat. Descriptive statistics include frequency, range, mean, median, and mode. A hypothesis is not required in a descriptive investigation. On the other hand, when conditions can be controlled in order to focus on a single variable, experimental research design is used to determine causation. Students should experience both types of investigations and understand that different scientific research questions require different research designs."}
        },
        {
            "competencyText": {"en-us": "Scientific investigations are used to learn about the natural world. Students should understand that certain types of questions can be answered by investigations, and the methods, models, and conclusions built from these investigations change as new observations are made. Models of objects and events are tools for understanding the natural world and can show how systems work. Models have limitations and based on new discoveries are constantly being modified to more closely reflect the natural world."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. Matter and energy are conserved throughout living systems. Radiant energy from the Sun drives much of the flow of energy throughout living systems due to the process of photosynthesis in organisms described as producers. Most consumers then depend on producers to meet their energy needs. Subsequent grade levels will learn about the differences at the molecular and atomic level."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. Force, motion, and energy are observed in living systems and the environment in several ways. Interactions between muscular and skeletal systems allow the body to apply forces and transform energy both internally and externally. Force and motion can also describe the direction and growth of seedlings, turgor pressure, and geotropism. Catastrophic events of weather systems such as hurricanes, floods, and tornadoes can shape and restructure the environment through the force and motion evident in them. Weathering, erosion, and deposition occur in environments due to the forces of gravity, wind, ice, and water."}
        },
        {
            "competencyText": {"en-us": "Earth and space. Earth and space phenomena can be observed in a variety of settings. Both natural events and human activities can impact Earth systems. There are characteristics of Earth and relationships to objects in our solar system that allow life to exist."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments."}
        },
        {
            "competencyText": {"en-us": "Students will understand the relationship between living organisms and their environment. Different environments support different living organisms that are adapted to that region of Earth. Organisms are living systems that maintain a steady state with that environment and whose balance may be disrupted by internal and external stimuli. External stimuli include human activity or the environment. Successful organisms can reestablish a balance through different processes such as a feedback mechanism. Ecological succession can be seen on a broad or small scale."}
        },
        {
            "competencyText": {"en-us": "Students learn that all organisms obtain energy, get rid of wastes, grow, and reproduce. During both sexual and asexual reproduction, traits are passed onto the next generation. These traits are contained in genetic material that is found on genes within a chromosome from the parent. Changes in traits sometimes occur in a population over many generations. One of the ways a change can occur is through the process of natural selection. Students extend their understanding of structures in living systems from a previous focus on external structures to an understanding of internal structures and functions within living things."}
        },
        {
            "competencyText": {"en-us": "All living organisms are made up of smaller units called cells. All cells use energy, get rid of wastes, and contain genetic material. Students will compare plant and animal cells and understand the internal structures within them that allow them to obtain energy, get rid of wastes, grow, and reproduce in different ways. Cells can organize into tissues, tissues into organs, and organs into organ systems. Students will learn the major functions of human body systems such as the ability of the integumentary system to protect against infection, injury, and ultraviolet (UV) radiation; regulate body temperature; and remove waste."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student, for at least 40% of the instructional time, conducts laboratory and field investigations following safety procedures and environmentally appropriate and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations as outlined in Texas Education Agency-approved safety standards; and"}
        },
        {
            "competencyText": {"en-us": "practice appropriate use and conservation of resources, including disposal, reuse, or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses scientific practices during laboratory and field investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "plan and implement comparative and descriptive investigations by making observations, asking well defined questions, and using appropriate equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "design and implement experimental investigations by making observations, asking well defined questions, formulating testable hypotheses, and using appropriate equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "collect and record data using the International System of Units (SI) and qualitative means such as labeled drawings, writing, and graphic organizers;"}
        },
        {
            "competencyText": {"en-us": "construct tables and graphs, using repeated trials and means, to organize data and identify patterns; and"}
        },
        {
            "competencyText": {"en-us": "analyze data to formulate reasonable explanations, communicate valid conclusions supported by the data, and predict trends."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions and knows the contributions of relevant scientists. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "use models to represent aspects of the natural world such as human body systems and plant and animal cells;"}
        },
        {
            "competencyText": {"en-us": "identify advantages and limitations of models such as size, scale, properties, and materials; and"}
        },
        {
            "competencyText": {"en-us": "relate the impact of research on scientific thought and society, including the history of science and contributions of scientists as related to the content."}
        },
        {
            "competencyText": {"en-us": "Science investigation and reasoning. The student knows how to use a variety of tools and safety equipment to conduct science inquiry. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use appropriate tools, including life science models, hand lenses, stereoscopes, microscopes, beakers, Petri dishes, microscope slides, graduated cylinders, test tubes, meter sticks, metric rulers, metric tape measures, timing devices, hot plates, balances, thermometers, calculators, water test kits, computers, temperature and pH probes, collecting nets, insect traps, globes, digital cameras, journals/notebooks, and other necessary equipment to collect, record, and analyze information; and"}
        },
        {
            "competencyText": {"en-us": "use preventative safety equipment, including chemical splash goggles, aprons, and gloves, and be prepared to use emergency safety equipment, including an eye/face wash, a fire blanket, and a fire extinguisher."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that interactions occur between matter and energy. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "recognize that radiant energy from the Sun is transformed into chemical energy through the process of photosynthesis; and"}
        },
        {
            "competencyText": {"en-us": "diagram the flow of energy through living systems, including food chains, food webs, and energy pyramids."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that matter has physical and chemical properties and can undergo physical and chemical changes. The student is expected to distinguish between physical and chemical changes in matter."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows that there is a relationship among force, motion, and energy. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "illustrate the transformation of energy within an organism such as the transfer from chemical energy to thermal energy; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate and illustrate forces that affect motion in organisms such as emergence of seedlings, turgor pressure, geotropism, and circulation of blood."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that natural events and human activity can impact Earth systems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "predict and describe how catastrophic events such as floods, hurricanes, or tornadoes impact ecosystems;"}
        },
        {
            "competencyText": {"en-us": "analyze the effects of weathering, erosion, and deposition on the environment in ecoregions of Texas; and"}
        },
        {
            "competencyText": {"en-us": "model the effects of human activity on groundwater and surface water in a watershed."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows components of our solar system. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze the characteristics of objects in our solar system that allow life to exist such as the proximity of the Sun, presence of water, and composition of the atmosphere; and"}
        },
        {
            "competencyText": {"en-us": "identify the accommodations, considering the characteristics of our solar system, that enabled manned space exploration."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that there is a relationship between organisms and the environment. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe and describe how different environments, including microhabitats in schoolyards and biomes, support different varieties of organisms;"}
        },
        {
            "competencyText": {"en-us": "describe how biodiversity contributes to the sustainability of an ecosystem; and"}
        },
        {
            "competencyText": {"en-us": "observe, record, and describe the role of ecological succession such as in a microhabitat of a garden with weeds."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that populations and species demonstrate variation and inherit many of their unique traits through gradual processes over many generations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "examine organisms or their structures such as insects or leaves and use dichotomous keys for identification;"}
        },
        {
            "competencyText": {"en-us": "explain variation within a population or species by comparing external features, behaviors, or physiology of organisms that enhance their survival such as migration, hibernation, or storage of food in a bulb; and"}
        },
        {
            "competencyLabel": {"en-us": "identify some changes in genetic traits that have occurred o"},
            "competencyText": {"en-us": "identify some changes in genetic traits that have occurred over several generations through natural selection and selective breeding such as the Galapagos Medium Ground Finch (<i>Geospiza fortis<\/i>) or domestic animals and hybrid plants."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that living systems at all levels of organization demonstrate the complementary nature of structure and function. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate and explain how internal structures of organisms have adaptations that allow specific functions such as gills in fish, hollow bones in birds, or xylem in plants;"}
        },
        {
            "competencyText": {"en-us": "identify the main functions of the systems of the human organism, including the circulatory, respiratory, skeletal, muscular, digestive, excretory, reproductive, integumentary, nervous, and endocrine systems;"}
        },
        {
            "competencyText": {"en-us": "recognize levels of organization in plants and animals, including cells, tissues, organs, organ systems, and organisms;"}
        },
        {
            "competencyText": {"en-us": "differentiate between structure and function in plant and animal cell organelles, including cell membrane, cell wall, nucleus, cytoplasm, mitochondrion, chloroplast, and vacuole;"}
        },
        {
            "competencyText": {"en-us": "compare the functions of cell organelles to the functions of an organ system; and"}
        },
        {
            "competencyText": {"en-us": "recognize the components of cell theory."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that a living organism must be able to maintain balance in stable internal conditions in response to external and internal stimuli. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate how organisms respond to external stimuli found in the environment such as phototropism and fight or flight; and"}
        },
        {
            "competencyText": {"en-us": "describe and relate responses in organisms that may result from internal stimuli such as wilting in plants and fever or vomiting in animals that allow them to maintain balance."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that reproduction is a characteristic of living organisms and that the instructions for traits are governed in the genetic material. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define heredity as the passage of genetic instructions from one generation to the next generation;"}
        },
        {
            "competencyText": {"en-us": "compare the results of uniform or diverse offspring from asexual or sexual reproduction; and"}
        },
        {
            "competencyText": {"en-us": "recognize that inherited traits of individuals are governed in the genetic material found in the genes within chromosomes in the nucleus."}
        },
        {
            "competencyText": {"en-us": "Science, Grade 8, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.20 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power that have been tested over a wide variety of conditions become theories. Scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Students should know that scientific theories, unlike hypotheses, are well established and highly reliable, but they may still be subject to change as new information and technologies are developed. Students should be able to distinguish between scientific decision-making methods and ethical/social decisions that involve the application of scientific information."}
        },
        {
            "competencyText": {"en-us": "Grade 8 science is interdisciplinary in nature; however, much of the content focus is on earth and space science. National standards in science are organized as multi-grade blocks such as Grades 5-8 rather than individual grade levels. In order to follow the grade level format used in Texas, the various national standards are found among Grades 6, 7, and 8. Recurring themes are pervasive in sciences, mathematics, and technology. These ideas transcend disciplinary boundaries and include change and constancy, patterns, cycles, systems, models, and scale. The strands for Grade 8 include the following."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning."}
        },
        {
            "competencyText": {"en-us": "To develop a rich knowledge of science and the natural world, students must become familiar with different modes of scientific inquiry, rules of evidence, ways of formulating questions, ways of proposing explanations, and the diverse ways scientists study the natural world and propose explanations based on evidence derived from their work."}
        },
        {
            "competencyText": {"en-us": "Scientific investigations are conducted for different reasons. All investigations require a research question, careful observations, data gathering, and analysis of the data to identify the patterns that will explain the findings. Descriptive investigations are used to explore new phenomena such as conducting surveys of organisms or measuring the abiotic components in a given habitat. Descriptive statistics include frequency, range, mean, median, and mode. A hypothesis is not required in a descriptive investigation. On the other hand, when conditions can be controlled in order to focus on a single variable, experimental research design is used to determine causation. Students should experience both types of investigations and understand that different scientific research questions require different research designs."}
        },
        {
            "competencyText": {"en-us": "Scientific investigations are used to learn about the natural world. Students should understand that certain types of questions can be answered by investigations, and the methods, models, and conclusions built from these investigations change as new observations are made. Models of objects and events are tools for understanding the natural world and can show how systems work. Models have limitations and based on new discoveries are constantly being modified to more closely reflect the natural world."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. Students recognize that matter is composed of atoms. Students examine information on the Periodic Table to recognize that elements are grouped into families. In addition, students understand the basic concept of conservation of mass. Lab activities will allow students to demonstrate evidence of chemical reactions. They will use chemical formulas to identify substances."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. Students experiment with the relationship between forces and motion through the study of Newton's three laws. Students learn how these forces relate to geologic processes and astronomical phenomena. In addition, students recognize that these laws are evident in everyday objects and activities. Mathematics is used to calculate speed using distance and time measurements."}
        },
        {
            "competencyText": {"en-us": "Earth and space. Students identify the role of natural events in altering Earth systems. Cycles within Sun, Earth, and Moon systems are studied as students learn about seasons, tides, and lunar phases. Students learn that stars and galaxies are part of the universe. In addition, students use data to research scientific theories of the origin of the universe. Students will illustrate how Earth features change over time by plate tectonics. They will interpret land and erosional features on topographic maps and satellite views. Students learn how interactions in solar, weather, and ocean systems create changes in weather patterns and climate."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. In studies of living systems, students explore the interdependence between these systems. Students describe how biotic and abiotic factors affect the number of organisms and populations present in an ecosystem. In addition, students explore how organisms and their populations respond to short- and long-term environmental changes, including those caused by human activities."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student, for at least 40% of instructional time, conducts laboratory and field investigations following safety procedures and environmentally appropriate and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations as outlined in Texas Education Agency-approved safety standards; and"}
        },
        {
            "competencyText": {"en-us": "practice appropriate use and conservation of resources, including disposal, reuse, or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses scientific practices during laboratory and field investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "plan and implement comparative and descriptive investigations by making observations, asking well defined questions, and using appropriate equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "design and implement experimental investigations by making observations, asking well defined questions, formulating testable hypotheses, and using appropriate equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "collect and record data using the International System of Units (SI) and qualitative means such as labeled drawings, writing, and graphic organizers;"}
        },
        {
            "competencyText": {"en-us": "construct tables and graphs, using repeated trials and means, to organize data and identify patterns; and"}
        },
        {
            "competencyText": {"en-us": "analyze data to formulate reasonable explanations, communicate valid conclusions supported by the data, and predict trends."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions and knows the contributions of relevant scientists. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "use models to represent aspects of the natural world such as an atom, a molecule, space, or a geologic feature;"}
        },
        {
            "competencyText": {"en-us": "identify advantages and limitations of models such as size, scale, properties, and materials; and"}
        },
        {
            "competencyText": {"en-us": "relate the impact of research on scientific thought and society, including the history of science and contributions of scientists as related to the content."}
        },
        {
            "competencyText": {"en-us": "Scientific investigation and reasoning. The student knows how to use a variety of tools and safety equipment to conduct science inquiry. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "use appropriate tools, including lab journals/notebooks, beakers, meter sticks, graduated cylinders, anemometers, psychrometers, hot plates, test tubes, spring scales, balances, microscopes, thermometers, calculators, computers, spectroscopes, timing devices, and other necessary equipment to collect, record, and analyze information; and"}
        },
        {
            "competencyText": {"en-us": "use preventative safety equipment, including chemical splash goggles, aprons, and gloves, and be prepared to use emergency safety equipment, including an eye/face wash, a fire blanket, and a fire extinguisher."}
        },
        {
            "competencyText": {"en-us": "Matter and energy. The student knows that matter is composed of atoms and has chemical and physical properties. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the structure of atoms, including the masses, electrical charges, and locations, of protons and neutrons in the nucleus and electrons in the electron cloud;"}
        },
        {
            "competencyText": {"en-us": "identify that protons determine an element's identity and valence electrons determine its chemical properties, including reactivity;"}
        },
        {
            "competencyText": {"en-us": "interpret the arrangement of the Periodic Table, including groups and periods, to explain how properties are used to classify elements;"}
        },
        {
            "competencyText": {"en-us": "recognize that chemical formulas are used to identify substances and determine the number of atoms of each element in chemical formulas containing subscripts; and"}
        },
        {
            "competencyText": {"en-us": "investigate how evidence of chemical reactions indicates that new substances with different properties are formed and how that relates to the law of conservation of mass."}
        },
        {
            "competencyText": {"en-us": "Force, motion, and energy. The student knows that there is a relationship between force, motion, and energy. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate and calculate how unbalanced forces change the speed or direction of an object's motion;"}
        },
        {
            "competencyText": {"en-us": "differentiate between speed, velocity, and acceleration; and"}
        },
        {
            "competencyText": {"en-us": "investigate and describe applications of Newton's three laws of motion such as in vehicle restraints, sports activities, amusement park rides, Earth's tectonic activities, and rocket launches."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows the effects resulting from cyclical movements of the Sun, Earth, and Moon. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "model and illustrate how the tilted Earth rotates on its axis, causing day and night, and revolves around the Sun, causing changes in seasons;"}
        },
        {
            "competencyText": {"en-us": "demonstrate and predict the sequence of events in the lunar cycle; and"}
        },
        {
            "competencyText": {"en-us": "relate the positions of the Moon and Sun to their effect on ocean tides."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows characteristics of the universe. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe components of the universe, including stars, nebulae, and galaxies, and use models such as the Hertzsprung-Russell diagram for classification;"}
        },
        {
            "competencyText": {"en-us": "recognize that the Sun is a medium-sized star located in a spiral arm of the Milky Way galaxy and that the Sun is many thousands of times closer to Earth than any other star;"}
        },
        {
            "competencyText": {"en-us": "identify how different wavelengths of the electromagnetic spectrum such as visible light and radio waves are used to gain information about components in the universe; and"}
        },
        {
            "competencyText": {"en-us": "research how scientific data are used as evidence to develop scientific theories to describe the origin of the universe."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that natural events can impact Earth systems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the historical development of evidence that supports plate tectonic theory;"}
        },
        {
            "competencyText": {"en-us": "relate plate tectonics to the formation of crustal features; and"}
        },
        {
            "competencyText": {"en-us": "interpret topographic maps and satellite views to identify land and erosional features and predict how these features may be reshaped by weathering."}
        },
        {
            "competencyText": {"en-us": "Earth and space. The student knows that climatic interactions exist among Earth, ocean, and weather systems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "recognize that the Sun provides the energy that drives convection within the atmosphere and oceans, producing winds;"}
        },
        {
            "competencyText": {"en-us": "identify how global patterns of atmospheric movement influence local weather using weather maps that show high and low pressures and fronts; and"}
        },
        {
            "competencyText": {"en-us": "identify the role of the oceans in the formation of weather systems such as hurricanes."}
        },
        {
            "competencyText": {"en-us": "Organisms and environments. The student knows that interdependence occurs among living systems and the environment and that human activities can affect these systems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate how organisms and populations in an ecosystem depend on and may compete for biotic factors such as food and abiotic factors such as quantity of light, water, range of temperatures, or soil composition;"}
        },
        {
            "competencyText": {"en-us": "explore how short- and long-term environmental changes affect organisms and traits in subsequent populations; and"}
        },
        {
            "competencyText": {"en-us": "recognize human dependence on ocean systems and explain how human activities such as runoff, artificial reefs, or use of resources have modified these systems."}
        },
        {
            "competencyText": {"en-us": "Implementation of Texas Essential Knowledge and Skills for Science, Middle School, Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.17 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 24, 2010, 35 TexReg 7230",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The provisions of §§112.18-112.20 of this subchapter shall be implemented by school districts beginning with the 2018-2019 school year."}
        },
        {
            "competencyText": {"en-us": "Subchapter C. High School"}
        },
        {
            "competencyText": {"en-us": "Aquatic Science, Beginning with School Year 2010-2011 (One Credit)."},
            "comment": {
                "en-us": ["Source: The provisions of this §112.32 adopted to be effective August 4, 2009, 34 TexReg 5063."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. Required prerequisite: one unit of high school Biology. Suggested prerequisite: Chemistry or concurrent enrollment in Chemistry. This course is recommended for students in Grades 10, 11, or 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Aquatic Science. In Aquatic Science, students study the interactions of biotic and abiotic components in aquatic environments, including impacts on aquatic systems. Investigations and field work in this course may emphasize fresh water or marine aspects of aquatic science depending primarily upon the natural resources available for study near the school. Students who successfully complete Aquatic Science will acquire knowledge about a variety of aquatic systems, conduct investigations and observations of aquatic environments, work collaboratively with peers, and develop critical-thinking and problem-solving skills."}
        },
        {
            "competencyText": {"en-us": "Nature of science. Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific inquiry. Scientific inquiry is the planned and deliberate investigation of the natural world. Scientific methods of investigation can be experimental, descriptive, or comparative. The method chosen should be appropriate to the question being asked."}
        },
        {
            "competencyText": {"en-us": "Science and social ethics. Scientific decision making is a way of answering questions about the natural world. Students should be able to distinguish between scientific decision-making methods and ethical and social decisions that involve the application of scientific information."}
        },
        {
            "competencyText": {"en-us": "Scientific systems. A system is a collection of cycles, structures, and processes that interact. All systems have basic properties that can be described in terms of space, time, energy, and matter. Change and constancy occur in systems as patterns and can be observed, measured, and modeled. These patterns help to make predictions that can be scientifically tested. Students should analyze a system in terms of its components and how these components relate to each other, to the whole, and to the external environment."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations, including chemical, electrical, and fire safety, and safe handling of live and preserved organisms; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses scientific methods during laboratory and field investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"}
        },
        {
            "competencyText": {"en-us": "know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"}
        },
        {
            "competencyText": {"en-us": "know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but they may be subject to change as new areas of science and new technologies are developed;"}
        },
        {
            "competencyText": {"en-us": "distinguish between scientific hypotheses and scientific theories;"}
        },
        {
            "competencyText": {"en-us": "plan and implement investigative procedures, including asking questions, formulating testable hypotheses, and selecting, handling, and maintaining appropriate equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "collect data individually or collaboratively, make measurements with precision and accuracy, record values using appropriate units, and calculate statistically relevant quantities to describe data, including mean, median, and range;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the use of course apparatuses, equipment, techniques, and procedures;"}
        },
        {
            "competencyText": {"en-us": "organize, analyze, evaluate, build models, make inferences, and predict trends from data;"}
        },
        {
            "competencyText": {"en-us": "perform calculations using dimensional analysis, significant digits, and scientific notation; and"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions using essential vocabulary and multiple modes of expression such as lab reports, labeled drawings, graphic organizers, journals, summaries, oral reports, and technology-based reports."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"}
        },
        {
            "competencyText": {"en-us": "draw inferences based on data related to promotional materials for products and services;"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of research and technology on scientific thought, society, and the environment;"}
        },
        {
            "competencyText": {"en-us": "describe the connection between aquatic science and future careers; and"}
        },
        {
            "competencyText": {"en-us": "research and describe the history of aquatic science and contributions of scientists."}
        },
        {
            "competencyText": {"en-us": "Science concepts. Students know that aquatic environments are the product of Earth systems interactions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify key features and characteristics of atmospheric, geological, hydrological, and biological systems as they relate to aquatic environments;"}
        },
        {
            "competencyText": {"en-us": "apply systems thinking to the examination of aquatic environments, including positive and negative feedback cycles; and"}
        },
        {
            "competencyText": {"en-us": "collect and evaluate global environmental data using technology such as maps, visualizations, satellite data, Global Positioning System (GPS), Geographic Information System (GIS), weather balloons, buoys, etc."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student conducts long-term studies on local aquatic environments. Local natural environments are to be preferred over artificial or virtual environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate data over a period of time from an established aquatic environment documenting seasonal changes and the behavior of organisms;"}
        },
        {
            "competencyText": {"en-us": "collect baseline quantitative data, including pH, salinity, temperature, mineral content, nitrogen compounds, and turbidity from an aquatic environment;"}
        },
        {
            "competencyText": {"en-us": "analyze interrelationships among producers, consumers, and decomposers in a local aquatic ecosystem; and"}
        },
        {
            "competencyText": {"en-us": "identify the interdependence of organisms in an aquatic environment such as in a pond, river, lake, ocean, or aquifer and the biosphere."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the role of cycles in an aquatic environment. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify the role of carbon, nitrogen, water, and nutrient cycles in an aquatic environment, including upwellings and turnovers; and"}
        },
        {
            "competencyText": {"en-us": "examine the interrelationships between aquatic systems and climate and weather, including El Niño and La Niña, currents, and hurricanes."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the origin and use of water in a watershed. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify sources and determine the amounts of water in a watershed, including rainfall, groundwater, and surface water;"}
        },
        {
            "competencyText": {"en-us": "identify factors that contribute to how water flows through a watershed; and"}
        },
        {
            "competencyText": {"en-us": "identify water quantity and quality in a local watershed."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that geological phenomena and fluid dynamics affect aquatic systems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate basic principles of fluid dynamics, including hydrostatic pressure, density, salinity, and buoyancy;"}
        },
        {
            "competencyText": {"en-us": "identify interrelationships between ocean currents, climates, and geologic features; and"}
        },
        {
            "competencyText": {"en-us": "describe and explain fluid dynamics in an upwelling and lake turnover."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the types and components of aquatic ecosystems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "differentiate among freshwater, brackish, and saltwater ecosystems;"}
        },
        {
            "competencyText": {"en-us": "identify the major properties and components of different marine and freshwater life zones; and"}
        },
        {
            "competencyText": {"en-us": "identify biological, chemical, geological, and physical components of an aquatic life zone as they relate to the organisms in it."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows environmental adaptations of aquatic organisms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "classify different aquatic organisms using tools such as dichotomous keys;"}
        },
        {
            "competencyText": {"en-us": "compare and describe how adaptations allow an organism to exist within an aquatic environment; and"}
        },
        {
            "competencyText": {"en-us": "compare differences in adaptations of aquatic organisms to fresh water and marine environments."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows about the interdependence and interactions that occur in aquatic environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify how energy flows and matter cycles through both fresh water and salt water aquatic systems, including food webs, chains, and pyramids; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the factors affecting aquatic population cycles."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student understands how human activities impact aquatic environments. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "predict effects of chemical, organic, physical, and thermal changes from humans on the living and nonliving components of an aquatic ecosystem;"}
        },
        {
            "competencyText": {"en-us": "analyze the cumulative impact of human population growth on an aquatic system;"}
        },
        {
            "competencyText": {"en-us": "investigate the role of humans in unbalanced systems such as invasive species, fish farming, cultural eutrophication, or red tides;"}
        },
        {
            "competencyText": {"en-us": "analyze and discuss how human activities such as fishing, transportation, dams, and recreation influence aquatic environments; and"}
        },
        {
            "competencyText": {"en-us": "understand the impact of various laws and policies such as The Endangered Species Act, right of capture laws, or Clean Water Act on aquatic systems."}
        },
        {
            "competencyText": {"en-us": "Astronomy, Beginning with School Year 2010-2011 (One Credit)."},
            "comment": {
                "en-us": ["Source: The provisions of this §112.33 adopted to be effective August 4, 2009, 34 TexReg 5063."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. Suggested prerequisite: one unit of high school science. This course is recommended for students in Grade 11 or 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Astronomy. In Astronomy, students conduct laboratory and field investigations, use scientific methods, and make informed decisions using critical thinking and scientific problem solving. Students study the following topics: astronomy in civilization, patterns and objects in the sky, our place in space, the moon, reasons for the seasons, planets, the sun, stars, galaxies, cosmology, and space exploration. Students who successfully complete Astronomy will acquire knowledge within a conceptual framework, conduct observations of the sky, work collaboratively, and develop critical-thinking skills."}
        },
        {
            "competencyText": {"en-us": "Nature of science. Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific inquiry. Scientific inquiry is the planned and deliberate investigation of the natural world. Scientific methods of investigation can be experimental, descriptive, or comparative. The method chosen should be appropriate to the question being asked."}
        },
        {
            "competencyText": {"en-us": "Science and social ethics. Scientific decision making is a way of answering questions about the natural world. Students should be able to distinguish between scientific decision-making methods and ethical and social decisions that involve the application of scientific information."}
        },
        {
            "competencyText": {"en-us": "Scientific systems. A system is a collection of cycles, structures, and processes that interact. All systems have basic properties that can be described in terms of space, time, energy, and matter. Change and constancy occur in systems as patterns and can be observed, measured, and modeled. These patterns help to make predictions that can be scientifically tested. Students should analyze a system in terms of its components and how these components relate to each other, to the whole, and to the external environment."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses scientific methods during laboratory and field investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"}
        },
        {
            "competencyText": {"en-us": "know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"}
        },
        {
            "competencyText": {"en-us": "know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but may be subject to change as new areas of science and new technologies are developed;"}
        },
        {
            "competencyText": {"en-us": "distinguish between scientific hypotheses and scientific theories;"}
        },
        {
            "competencyText": {"en-us": "plan and implement investigative procedures, including making observations, asking questions, formulating testable hypotheses, and selecting equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "collect data and make measurements with accuracy and precision;"}
        },
        {
            "competencyText": {"en-us": "organize, analyze, evaluate, make inferences, and predict trends from data, including making new revised hypotheses when appropriate;"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions in writing, oral presentations, and through collaborative projects; and"}
        },
        {
            "competencyText": {"en-us": "use astronomical technology such as telescopes, binoculars, sextants, computers, and software."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"}
        },
        {
            "competencyText": {"en-us": "draw inferences based on data related to promotional materials for products and services;"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of research on scientific thought, society, and the environment; and"}
        },
        {
            "competencyText": {"en-us": "describe the connection between astronomy and future careers."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student recognizes the importance and uses of astronomy in civilization. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "research and describe the use of astronomy in ancient civilizations such as the Egyptians, Mayans, Aztecs, Europeans, and the native Americans;"}
        },
        {
            "competencyText": {"en-us": "research and describe the contributions of scientists to our changing understanding of astronomy, including Ptolemy, Copernicus, Tycho Brahe, Kepler, Galileo, Newton, Einstein, and Hubble, and the contribution of women astronomers, including Maria Mitchell and Henrietta Swan Leavitt;"}
        },
        {
            "competencyText": {"en-us": "describe and explain the historical origins of the perceived patterns of constellations and the role of constellations in ancient and modern navigation; and"}
        },
        {
            "competencyText": {"en-us": "explain the contributions of modern astronomy to today's society, including the identification of potential asteroid/comet impact hazards and the Sun's effects on communication, navigation, and high-tech devices."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student develops a familiarity with the sky. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe and record the apparent movement of the Sun and Moon during the day;"}
        },
        {
            "competencyText": {"en-us": "observe and record the apparent movement of the Moon, planets, and stars in the nighttime sky; and"}
        },
        {
            "competencyText": {"en-us": "recognize and identify constellations such as Ursa Major, Ursa Minor, Orion, Cassiopeia, and constellations of the zodiac."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows our place in space. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare and contrast the scale, size, and distance of the Sun, Earth, and Moon system through the use of data and modeling;"}
        },
        {
            "competencyText": {"en-us": "compare and contrast the scale, size, and distance of objects in the solar system such as the Sun and planets through the use of data and modeling;"}
        },
        {
            "competencyText": {"en-us": "examine the scale, size, and distance of the stars, Milky Way, and other galaxies through the use of data and modeling;"}
        },
        {
            "competencyText": {"en-us": "relate apparent versus absolute magnitude to the distances of celestial objects; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate the use of units of measurement in astronomy, including Astronomical Units and light years."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the role of the Moon in the Sun, Earth, and Moon system. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "observe and record data about lunar phases and use that information to model the Sun, Earth, and Moon system;"}
        },
        {
            "competencyText": {"en-us": "illustrate the cause of lunar phases by showing positions of the Moon relative to Earth and the Sun for each phase, including new moon, waxing crescent, first quarter, waxing gibbous, full moon, waning gibbous, third quarter, and waning crescent;"}
        },
        {
            "competencyText": {"en-us": "identify and differentiate the causes of lunar and solar eclipses, including differentiating between lunar phases and eclipses; and"}
        },
        {
            "competencyText": {"en-us": "identify the effects of the Moon on tides."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the reasons for the seasons. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "recognize that seasons are caused by the tilt of Earth's axis;"}
        },
        {
            "competencyText": {"en-us": "explain how latitudinal position affects the length of day and night throughout the year;"}
        },
        {
            "competencyText": {"en-us": "recognize that the angle of incidence of sunlight determines the concentration of solar energy received on Earth at a particular location; and"}
        },
        {
            "competencyText": {"en-us": "examine the relationship of the seasons to equinoxes, solstices, the tropics, and the equator."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that planets of different size, composition, and surface features orbit around the Sun. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare and contrast the factors essential to life on Earth such as temperature, water, mass, and gases to conditions on other planets;"}
        },
        {
            "competencyText": {"en-us": "compare the planets in terms of orbit, size, composition, rotation, atmosphere, natural satellites, and geological activity;"}
        },
        {
            "competencyText": {"en-us": "relate the role of Newton's law of universal gravitation to the motion of the planets around the Sun and to the motion of natural and artificial satellites around the planets; and"}
        },
        {
            "competencyText": {"en-us": "explore the origins and significance of small solar system bodies, including asteroids, comets, and Kuiper belt objects."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the role of the Sun as the star in our solar system. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify the approximate mass, size, motion, temperature, structure, and composition of the Sun;"}
        },
        {
            "competencyText": {"en-us": "distinguish between nuclear fusion and nuclear fission, and identify the source of energy within the Sun as nuclear fusion of hydrogen to helium;"}
        },
        {
            "competencyText": {"en-us": "describe the eleven-year solar cycle and the significance of sunspots; and"}
        },
        {
            "competencyText": {"en-us": "analyze solar magnetic storm activity, including coronal mass ejections, prominences, flares, and sunspots."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the characteristics and life cycle of stars. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify the characteristics of main sequence stars, including surface temperature, age, relative size, and composition;"}
        },
        {
            "competencyText": {"en-us": "characterize star formation in stellar nurseries from giant molecular clouds, to protostars, to the development of main sequence stars;"}
        },
        {
            "competencyText": {"en-us": "evaluate the relationship between mass and fusion on the dying process and properties of stars;"}
        },
        {
            "competencyText": {"en-us": "differentiate among the end states of stars, including white dwarfs, neutron stars, and black holes;"}
        },
        {
            "competencyText": {"en-us": "compare how the mass and gravity of a main sequence star will determine its end state as a white dwarf, neutron star, or black hole;"}
        },
        {
            "competencyText": {"en-us": "relate the use of spectroscopy in obtaining physical data on celestial objects such as temperature, chemical composition, and relative motion; and"}
        },
        {
            "competencyText": {"en-us": "use the Hertzsprung-Russell diagram to plot and examine the life cycle of stars from birth to death."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the variety and properties of galaxies. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe characteristics of galaxies;"}
        },
        {
            "competencyText": {"en-us": "recognize the type, structure, and components of our Milky Way galaxy and location of our solar system within it; and"}
        },
        {
            "competencyText": {"en-us": "compare and contrast the different types of galaxies, including spiral, elliptical, irregular, and dwarf."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the scientific theories of cosmology. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "research and describe the historical development of the Big Bang Theory, including red shift, cosmic microwave background radiation, and other supporting evidence;"}
        },
        {
            "competencyText": {"en-us": "research and describe current theories of the evolution of the universe, including estimates for the age of the universe; and"}
        },
        {
            "competencyText": {"en-us": "research and describe scientific hypotheses of the fate of the universe, including open and closed universes and the role of dark matter and dark energy."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student recognizes the benefits and challenges of space exploration to the study of the universe. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify and explain the contributions of human space flight and future plans and challenges;"}
        },
        {
            "competencyText": {"en-us": "recognize the advancement of knowledge in astronomy through robotic space flight;"}
        },
        {
            "competencyText": {"en-us": "analyze the importance of ground-based technology in astronomical studies;"}
        },
        {
            "competencyText": {"en-us": "recognize the importance of space telescopes to the collection of astronomical data across the electromagnetic spectrum; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an awareness of new developments and discoveries in astronomy."}
        },
        {
            "competencyText": {"en-us": "Biology (One Credit), Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.34 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. Prerequisites: none. This course is recommended for students in Grade 9, 10, or 11."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Biology. In Biology, students conduct laboratory and field investigations, use scientific practices during investigations, and make informed decisions using critical thinking and scientific problem solving. Students in Biology study a variety of topics that include: structures and functions of cells and viruses; growth and development of organisms; cells, tissues, and organs; nucleic acids and genetics; biological evolution; taxonomy; metabolism and energy transfers in living organisms; living systems; homeostasis; and ecosystems and the environment."}
        },
        {
            "competencyText": {"en-us": "Nature of science. Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not currently scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific inquiry. Scientific inquiry is the planned and deliberate investigation of the natural world. Scientific methods of investigation are experimental, descriptive, or comparative. The method chosen should be appropriate to the question being asked."}
        },
        {
            "competencyText": {"en-us": "Science and social ethics. Scientific decision making is a way of answering questions about the natural world. Students should be able to distinguish between scientific decision-making methods (scientific methods) and ethical and social decisions that involve science (the application of scientific information)."}
        },
        {
            "competencyText": {"en-us": "Science, systems, and models. A system is a collection of cycles, structures, and processes that interact. All systems have basic properties that can be described in space, time, energy, and matter. Change and constancy occur in systems as patterns and can be observed, measured, and modeled. These patterns help to make predictions that can be scientifically tested. Students should analyze a system in terms of its components and how these components relate to each other, to the whole, and to the external environment."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses scientific practices and equipment during laboratory and field investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"}
        },
        {
            "competencyText": {"en-us": "know that hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power that have been tested over a wide variety of conditions are incorporated into theories;"}
        },
        {
            "competencyText": {"en-us": "know scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well established and highly reliable explanations, but they may be subject to change as new areas of science and new technologies are developed;"}
        },
        {
            "competencyText": {"en-us": "distinguish between scientific hypotheses and scientific theories;"}
        },
        {
            "competencyText": {"en-us": "plan and implement descriptive, comparative, and experimental investigations, including asking questions, formulating testable hypotheses, and selecting equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "collect and organize qualitative and quantitative data and make measurements with accuracy and precision using tools such as data-collecting probes, standard laboratory glassware, microscopes, various prepared slides, stereoscopes, metric rulers, balances, gel electrophoresis apparatuses, micropipettes, hand lenses, Celsius thermometers, hot plates, lab notebooks or journals, timing devices, Petri dishes, lab incubators, dissection equipment, meter sticks, and models, diagrams, or samples of biological specimens or structures;"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, make inferences, and predict trends from data; and"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions supported by the data through methods such as lab reports, labeled drawings, graphic organizers, journals, summaries, oral reports, and technology-based reports."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "communicate and apply scientific information extracted from various sources such as current events, published journal articles, and marketing materials;"}
        },
        {
            "competencyText": {"en-us": "draw inferences based on data related to promotional materials for products and services;"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of scientific research on society and the environment;"}
        },
        {
            "competencyText": {"en-us": "evaluate models according to their limitations in representing biological objects or events; and"}
        },
        {
            "competencyText": {"en-us": "research and describe the history of biology and contributions of scientists."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that cells are the basic structures of all living things with specialized parts that perform specific functions and that viruses are different from cells. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare and contrast prokaryotic and eukaryotic cells, including their complexity, and compare and contrast scientific explanations for cellular complexity;"}
        },
        {
            "competencyText": {"en-us": "investigate and explain cellular processes, including homeostasis and transport of molecules; and"}
        },
        {
            "competencyText": {"en-us": "compare the structures of viruses to cells, describe viral reproduction, and describe the role of viruses in causing diseases such as human immunodeficiency virus (HIV) and influenza."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows how an organism grows and the importance of cell differentiation. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the stages of the cell cycle, including deoxyribonucleic acid (DNA) replication and mitosis, and the importance of the cell cycle to the growth of organisms;"}
        },
        {
            "competencyText": {"en-us": "describe the roles of DNA, ribonucleic acid (RNA), and environmental factors in cell differentiation; and"}
        },
        {
            "competencyText": {"en-us": "recognize that disruptions of the cell cycle lead to diseases such as cancer."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the mechanisms of genetics such as the role of nucleic acids and the principles of Mendelian and non-Mendelian genetics. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify components of DNA, identify how information for specifying the traits of an organism is carried in the DNA, and examine scientific explanations for the origin of DNA;"}
        },
        {
            "competencyText": {"en-us": "recognize that components that make up the genetic code are common to all organisms;"}
        },
        {
            "competencyText": {"en-us": "explain the purpose and process of transcription and translation using models of DNA and RNA;"}
        },
        {
            "competencyText": {"en-us": "recognize that gene expression is a regulated process;"}
        },
        {
            "competencyText": {"en-us": "identify and illustrate changes in DNA and evaluate the significance of these changes;"}
        },
        {
            "competencyText": {"en-us": "predict possible outcomes of various genetic combinations such as monohybrid crosses, dihybrid crosses, and non-Mendelian inheritance; and"}
        },
        {
            "competencyText": {"en-us": "recognize the significance of meiosis to sexual reproduction."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows evolutionary theory is a scientific explanation for the unity and diversity of life. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate how evidence of common ancestry among groups is provided by the fossil record, biogeography, and homologies, including anatomical, molecular, and developmental;"}
        },
        {
            "competencyText": {"en-us": "examine scientific explanations of abrupt appearance and stasis in the fossil record;"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate how natural selection produces change in populations, not individuals;"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate how the elements of natural selection, including inherited variation, the potential of a population to produce more offspring than can survive, and a finite supply of environmental resources, result in differential reproductive success;"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate the relationship of natural selection to adaptation and to the development of diversity in and among species; and"}
        },
        {
            "competencyText": {"en-us": "analyze other evolutionary mechanisms, including genetic drift, gene flow, mutation, and recombination."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that taxonomy is a branching classification based on the shared characteristics of organisms and can change as new discoveries are made. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define taxonomy and recognize the importance of a standardized taxonomic system to the scientific community;"}
        },
        {
            "competencyText": {"en-us": "categorize organisms using a hierarchical classification system based on similarities and differences shared among groups; and"}
        },
        {
            "competencyText": {"en-us": "compare characteristics of taxonomic groups, including archaea, bacteria, protists, fungi, plants, and animals."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the significance of various molecules involved in metabolic processes and energy conversions that occur in living organisms. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare the functions of different types of biomolecules, including carbohydrates, lipids, proteins, and nucleic acids;"}
        },
        {
            "competencyText": {"en-us": "compare the reactants and products of photosynthesis and cellular respiration in terms of energy, energy conversions, and matter; and"}
        },
        {
            "competencyText": {"en-us": "identify and investigate the role of enzymes."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that biological systems are composed of multiple levels. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the interactions that occur among systems that perform the functions of regulation, nutrient absorption, reproduction, and defense from injury or illness in animals;"}
        },
        {
            "competencyText": {"en-us": "describe the interactions that occur among systems that perform the functions of transport, reproduction, and response in plants; and"}
        },
        {
            "competencyText": {"en-us": "analyze the levels of organization in biological systems and relate the levels to each other and to the whole system."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that biological systems work to achieve and maintain balance. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "summarize the role of microorganisms in both maintaining and disrupting the health of both organisms and ecosystems; and"}
        },
        {
            "competencyText": {"en-us": "describe how events and processes that occur during ecological succession can change populations and species diversity."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that interdependence and interactions occur within an environmental system. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "interpret relationships, including predation, parasitism, commensalism, mutualism, and competition, among organisms;"}
        },
        {
            "competencyText": {"en-us": "compare variations and adaptations of organisms in different ecosystems;"}
        },
        {
            "competencyText": {"en-us": "analyze the flow of matter and energy through trophic levels using various models, including food chains, food webs, and ecological pyramids;"}
        },
        {
            "competencyText": {"en-us": "describe the flow of matter through the carbon and nitrogen cycles and explain the consequences of disrupting these cycles; and"}
        },
        {
            "competencyText": {"en-us": "describe how environmental change can impact ecosystem stability."}
        },
        {
            "competencyText": {"en-us": "Chemistry (One Credit), Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.35 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. Required prerequisites: one unit of high school science and Algebra I. Suggested prerequisite: completion of or concurrent enrollment in a second year of mathematics. This course is recommended for students in Grade 10, 11, or 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Chemistry. In Chemistry, students conduct laboratory and field investigations, use scientific practices during investigations, and make informed decisions using critical thinking and scientific problem solving. Students study a variety of topics that include characteristics of matter, use of the Periodic Table, development of atomic theory and chemical bonding, chemical stoichiometry, gas laws, solution chemistry, thermochemistry, and nuclear chemistry. Students will investigate how chemistry is an integral part of our daily lives."}
        },
        {
            "competencyText": {"en-us": "Nature of science. Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not currently scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific inquiry. Scientific inquiry is the planned and deliberate investigation of the natural world. Scientific practices of investigation can be experimental, descriptive, or comparative. The method chosen should be appropriate to the question being asked."}
        },
        {
            "competencyText": {"en-us": "Science and social ethics. Scientific decision making is a way of answering questions about the natural world. Students should be able to distinguish between scientific decision-making methods and ethical and social decisions that involve the application of scientific information."}
        },
        {
            "competencyText": {"en-us": "Scientific systems. A system is a collection of cycles, structures, and processes that interact. All systems have basic properties that can be described in terms of space, time, energy, and matter. Change and constancy occur in systems as patterns and can be observed, measured, and modeled. These patterns help to make predictions that can be scientifically tested. Students should analyze a system in terms of its components and how these components relate to each other, to the whole, and to the external environment."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations, including the appropriate use of safety showers, eyewash fountains, safety goggles or chemical splash goggles, as appropriate, and fire extinguishers;"}
        },
        {
            "competencyText": {"en-us": "know specific hazards of chemical substances such as flammability, corrosiveness, and radioactivity as summarized on the Safety Data Sheets (SDS); and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses scientific practices to solve investigative questions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"}
        },
        {
            "competencyText": {"en-us": "know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power that have been tested over a wide variety of conditions are incorporated into theories;"}
        },
        {
            "competencyText": {"en-us": "know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well established and highly reliable explanations, but may be subject to change as new areas of science and new technologies are developed;"}
        },
        {
            "competencyText": {"en-us": "distinguish between scientific hypotheses and scientific theories;"}
        },
        {
            "competencyText": {"en-us": "plan and implement investigative procedures, including asking questions, formulating testable hypotheses, and selecting equipment and technology, including graphing calculators, computers and probes, electronic balances, an adequate supply of consumable chemicals, and sufficient scientific glassware such as beakers, Erlenmeyer flasks, pipettes, graduated cylinders, volumetric flasks, and burettes;"}
        },
        {
            "competencyText": {"en-us": "collect data and make measurements with accuracy and precision;"}
        },
        {
            "competencyText": {"en-us": "express and manipulate chemical quantities using scientific conventions and mathematical procedures, including dimensional analysis, scientific notation, and significant figures;"}
        },
        {
            "competencyText": {"en-us": "organize, analyze, evaluate, make inferences, and predict trends from data; and"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions supported by the data through methods such as lab reports, labeled drawings, graphs, journals, summaries, oral reports, and technology-based reports."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "communicate and apply scientific information extracted from various sources such as current events, published journal articles, and marketing materials;"}
        },
        {
            "competencyText": {"en-us": "draw inferences based on data related to promotional materials for products and services;"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of research on scientific thought, society, and the environment;"}
        },
        {
            "competencyText": {"en-us": "describe the connection between chemistry and future careers; and"}
        },
        {
            "competencyText": {"en-us": "describe the history of chemistry and contributions of scientists."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the characteristics of matter and can analyze the relationships between chemical and physical changes and properties. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "differentiate between physical and chemical changes and properties;"}
        },
        {
            "competencyText": {"en-us": "identify extensive properties such as mass and volume and intensive properties such as density and melting point;"}
        },
        {
            "competencyText": {"en-us": "compare solids, liquids, and gases in terms of compressibility, structure, shape, and volume; and"}
        },
        {
            "competencyText": {"en-us": "classify matter as pure substances or mixtures through investigation of their properties."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student understands the historical development of the Periodic Table and can apply its predictive power. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "explain the use of chemical and physical properties in the historical development of the Periodic Table;"}
        },
        {
            "competencyText": {"en-us": "identify and explain the properties of chemical families, including alkali metals, alkaline earth metals, halogens, noble gases, and transition metals, using the Periodic Table; and"}
        },
        {
            "competencyText": {"en-us": "interpret periodic trends, including atomic radius, electronegativity, and ionization energy, using the Periodic Table."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows and understands the historical development of atomic theory. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the experimental design and conclusions used in the development of modern atomic theory, including Dalton's Postulates, Thomson's discovery of electron properties, Rutherford's nuclear atom, and Bohr's nuclear atom;"}
        },
        {
            "competencyText": {"en-us": "describe the mathematical relationships between energy, frequency, and wavelength of light using the electromagnetic spectrum;"}
        },
        {
            "competencyText": {"en-us": "calculate average atomic mass of an element using isotopic composition; and"}
        },
        {
            "competencyText": {"en-us": "express the arrangement of electrons in atoms of representative elements using electron configurations and Lewis valence electron dot structures."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows how atoms form ionic, covalent, and metallic bonds. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "name ionic compounds containing main group or transition metals, covalent compounds, acids, and bases using International Union of Pure and Applied Chemistry (IUPAC) nomenclature rules;"}
        },
        {
            "competencyText": {"en-us": "write the chemical formulas of ionic compounds containing representative elements, transition metals and common polyatomic ions, covalent compounds, and acids and bases;"}
        },
        {
            "competencyText": {"en-us": "construct electron dot formulas to illustrate ionic and covalent bonds;"}
        },
        {
            "competencyText": {"en-us": "describe metallic bonding and explain metallic properties such as thermal and electrical conductivity, malleability, and ductility; and"}
        },
        {
            "competencyText": {"en-us": "classify molecular structure for molecules with linear, trigonal planar, and tetrahedral electron pair geometries as explained by Valence Shell Electron Pair Repulsion (VSEPR) theory."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student can quantify the changes that occur during chemical reactions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define and use the concept of a mole;"}
        },
        {
            "competencyText": {"en-us": "calculate the number of atoms or molecules in a sample of material using Avogadro's number;"}
        },
        {
            "competencyText": {"en-us": "calculate percent composition of compounds;"}
        },
        {
            "competencyText": {"en-us": "write and balance chemical equations using the law of conservation of mass;"}
        },
        {
            "competencyText": {"en-us": "perform stoichiometric calculations, including determination of mass and gas volume relationships between reactants and products and percent yield; and"}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student understands the principles of ideal gas behavior, kinetic molecular theory, and the conditions that influence the behavior of gases. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe and calculate the relations between volume, pressure, number of moles, and temperature for an ideal gas as described by Boyle's law, Charles' law, Avogadro's law, Dalton's law of partial pressure, and the ideal gas law; and"}
        },
        {
            "competencyText": {"en-us": "describe the postulates of kinetic molecular theory."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student understands and can apply the factors that influence the behavior of solutions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the unique role of water in solutions in terms of polarity;"}
        },
        {
            "competencyText": {"en-us": "apply the general rules regarding solubility through investigations with aqueous solutions;"}
        },
        {
            "competencyText": {"en-us": "calculate the concentration of solutions in units of molarity;"}
        },
        {
            "competencyText": {"en-us": "calculate the dilutions of solutions using molarity;"}
        },
        {
            "competencyText": {"en-us": "distinguish among types of solutions such as electrolytes and nonelectrolytes; unsaturated, saturated, and supersaturated solutions; and strong and weak acids and bases;"}
        },
        {
            "competencyText": {"en-us": "investigate factors that influence solid and gas solubilities and rates of dissolution such as temperature, agitation, and surface area;"}
        },
        {
            "competencyText": {"en-us": "define acids and bases and distinguish between Arrhenius and Bronsted-Lowry definitions and predict products in acid-base reactions that form water; and"}
        },
        {
            "competencyText": {"en-us": "define pH and calculate the pH of a solution using the hydrogen ion concentration."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student understands the energy changes that occur in chemical reactions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe energy and its forms, including kinetic, potential, chemical, and thermal energies;"}
        },
        {
            "competencyText": {"en-us": "describe the law of conservation of energy and the processes of heat transfer in terms of calorimetry;"}
        },
        {
            "competencyText": {"en-us": "classify reactions as exothermic or endothermic and represent energy changes that occur in chemical reactions using thermochemical equations or graphical analysis; and"}
        },
        {
            "competencyText": {"en-us": "perform calculations involving heat, mass, temperature change, and specific heat."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student understands the basic processes of nuclear chemistry. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the characteristics of alpha, beta, and gamma radioactive decay processes in terms of balanced nuclear equations; and"}
        },
        {
            "competencyText": {"en-us": "compare fission and fusion reactions."}
        },
        {
            "competencyText": {"en-us": "Earth and Space Science, Beginning with School Year 2010-2011 (One Credit)."},
            "comment": {
                "en-us": ["Source: The provisions of this §112.36 adopted to be effective August 4, 2009, 34 TexReg 5063."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. Required prerequisites: three units of science, one of which may be taken concurrently, and three units of mathematics, one of which may be taken concurrently. This course is recommended for students in Grade 12 but may be taken by students in Grade 11."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Earth and Space Science (ESS). ESS is a capstone course designed to build on students' prior scientific and academic knowledge and skills to develop understanding of Earth's system in space and time."}
        },
        {
            "competencyText": {"en-us": "Nature of science. Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific inquiry. Scientific inquiry is the planned and deliberate investigation of the natural world. Scientific methods of investigation can be experimental, descriptive, or comparative. The method chosen should be appropriate to the question being asked."}
        },
        {
            "competencyText": {"en-us": "Science and social ethics. Scientific decision making is a way of answering questions about the natural world. Students should be able to distinguish between scientific decision-making methods and ethical and social decisions that involve the application of scientific information."}
        },
        {
            "competencyText": {"en-us": "ESS themes. An Earth systems approach to the themes of Earth in space and time, solid Earth, and fluid Earth defined the selection and development of the concepts described in this paragraph."}
        },
        {
            "competencyText": {"en-us": "Earth in space and time. Earth has a long, complex, and dynamic history. Advances in technologies continue to further our understanding of the origin, evolution, and properties of Earth and planetary systems within a chronological framework. The origin and distribution of resources that sustain life on Earth are the result of interactions among Earth's subsystems over billions of years."}
        },
        {
            "competencyText": {"en-us": "Solid Earth. The geosphere is a collection of complex, interacting, dynamic subsystems linking Earth's interior to its surface. The geosphere is composed of materials that move between subsystems at various rates driven by the uneven distribution of thermal energy. These dynamic processes are responsible for the origin and distribution of resources as well as geologic hazards that impact society."}
        },
        {
            "competencyText": {"en-us": "Fluid Earth. The fluid Earth consists of the hydrosphere, cryosphere, and atmosphere subsystems. These subsystems interact with the biosphere and geosphere resulting in complex biogeochemical and geochemical cycles. The global ocean is the thermal energy reservoir for surface processes and, through interactions with the atmosphere, influences climate. Understanding these interactions and cycles over time has implications for life on Earth."}
        },
        {
            "competencyText": {"en-us": "Earth and space science strands. ESS has three strands used throughout each of the three themes: systems, energy, and relevance."}
        },
        {
            "competencyText": {"en-us": "Systems. A system is a collection of interacting physical, chemical, and biological processes that involves the flow of matter and energy on different temporal and spatial scales. Earth's system is composed of interdependent and interacting subsystems of the geosphere, hydrosphere, atmosphere, cryosphere, and biosphere within a larger planetary and stellar system. Change and constancy occur in Earth's system and can be observed, measured as patterns and cycles, and described or presented in models used to predict how Earth's system changes over time."}
        },
        {
            "competencyText": {"en-us": "Energy. The uneven distribution of Earth's internal and external thermal energy is the driving force for complex, dynamic, and continuous interactions and cycles in Earth's subsystems. These interactions are responsible for the movement of matter within and between the subsystems resulting in, for example, plate motions and ocean-atmosphere circulation."}
        },
        {
            "competencyText": {"en-us": "Relevance. The interacting components of Earth's system change by both natural and human-influenced processes. Natural processes include hazards such as flooding, earthquakes, volcanoes, hurricanes, meteorite impacts, and climate change. Some human-influenced processes such as pollution and nonsustainable use of Earth's natural resources may damage Earth's system. Examples include climate change, soil erosion, air and water pollution, and biodiversity loss. The time scale of these changes and their impact on human society must be understood to make wise decisions concerning the use of the land, water, air, and natural resources. Proper stewardship of Earth will prevent unnecessary degradation and destruction of Earth's subsystems and diminish detrimental impacts to individuals and society."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student conducts laboratory and field investigations, for at least 40% of instructional time, using safe, environmentally appropriate, and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials; and"}
        },
        {
            "competencyText": {"en-us": "use the school's technology and information systems in a wise and ethical manner."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses scientific methods during laboratory and field investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"}
        },
        {
            "competencyText": {"en-us": "know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"}
        },
        {
            "competencyText": {"en-us": "know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but may be subject to change as new areas of science and new technologies are developed;"}
        },
        {
            "competencyText": {"en-us": "distinguish between scientific hypotheses and scientific theories;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the use of course equipment, techniques, and procedures, including computers and web-based computer applications;"}
        },
        {
            "competencyText": {"en-us": "use a wide variety of additional course apparatuses, equipment, techniques, and procedures as appropriate such as satellite imagery and other remote sensing data, Geographic Information Systems (GIS), Global Positioning System (GPS), scientific probes, microscopes, telescopes, modern video and image libraries, weather stations, fossil and rock kits, bar magnets, coiled springs, wave simulators, tectonic plate models, and planetary globes;"}
        },
        {
            "competencyText": {"en-us": "organize, analyze, evaluate, make inferences, and predict trends from data;"}
        },
        {
            "competencyText": {"en-us": "use mathematical procedures such as algebra, statistics, scientific notation, and significant figures to analyze data using the International System (SI) units; and"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions supported by data using several formats such as technical reports, lab reports, labeled drawings, graphic organizers, journals, presentations, and technical posters."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"}
        },
        {
            "competencyText": {"en-us": "draw inferences based on data related to promotional materials for products and services;"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of research on scientific thought, society, and public policy;"}
        },
        {
            "competencyText": {"en-us": "explore careers and collaboration among scientists in Earth and space sciences; and"}
        },
        {
            "competencyText": {"en-us": "learn and understand the contributions of scientists to the historical development of Earth and space sciences."}
        },
        {
            "competencyText": {"en-us": "Earth in space and time. The student knows how Earth-based and space-based astronomical observations reveal differing theories about the structure, scale, composition, origin, and history of the universe. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate the evidence concerning the Big Bang model such as red shift and cosmic microwave background radiation and current theories of the evolution of the universe, including estimates for the age of the universe;"}
        },
        {
            "competencyText": {"en-us": "explain how the Sun and other stars transform matter into energy through nuclear fusion; and"}
        },
        {
            "competencyText": {"en-us": "investigate the process by which a supernova can lead to the formation of successive generation stars and planets."}
        },
        {
            "competencyText": {"en-us": "Earth in space and time. The student understands the solar nebular accretionary disk model. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze how gravitational condensation of solar nebular gas and dust can lead to the accretion of planetesimals and protoplanets;"}
        },
        {
            "competencyText": {"en-us": "investigate thermal energy sources, including kinetic heat of impact accretion, gravitational compression, and radioactive decay, which are thought to allow protoplanet differentiation into layers;"}
        },
        {
            "competencyText": {"en-us": "contrast the characteristics of comets, asteroids, and meteoroids and their positions in the solar system, including the orbital regions of the terrestrial planets, the asteroid belt, gas giants, Kuiper Belt, and Oort Cloud;"}
        },
        {
            "competencyText": {"en-us": "explore the historical and current hypotheses for the origin of the Moon, including the collision of Earth with a Mars-sized planetesimal;"}
        },
        {
            "competencyText": {"en-us": "compare terrestrial planets to gas-giant planets in the solar system, including structure, composition, size, density, orbit, surface features, tectonic activity, temperature, and suitability for life; and"}
        },
        {
            "competencyText": {"en-us": "compare extra-solar planets with planets in our solar system and describe how such planets are detected."}
        },
        {
            "competencyText": {"en-us": "Earth in space and time. The student knows the evidence for how Earth's atmospheres, hydrosphere, and geosphere formed and changed through time. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze the changes of Earth's atmosphere that could have occurred through time from the original hydrogen-helium atmosphere, the carbon dioxide-water vapor-methane atmosphere, and the current nitrogen-oxygen atmosphere;"}
        },
        {
            "competencyText": {"en-us": "evaluate the role of volcanic outgassing and impact of water-bearing comets in developing Earth's atmosphere and hydrosphere;"}
        },
        {
            "competencyText": {"en-us": "investigate how the formation of atmospheric oxygen and the ozone layer impacted the formation of the geosphere and biosphere; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the evidence that Earth's cooling led to tectonic activity, resulting in continents and ocean basins."}
        },
        {
            "competencyText": {"en-us": "Earth in space and time. The student knows that scientific dating methods of fossils and rock sequences are used to construct a chronology of Earth's history expressed in the geologic time scale. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate relative dating methods using original horizontality, rock superposition, lateral continuity, cross-cutting relationships, unconformities, index fossils, and biozones based on fossil succession to determine chronological order;"}
        },
        {
            "competencyText": {"en-us": "calculate the ages of igneous rocks from Earth and the Moon and meteorites using radiometric dating methods; and"}
        },
        {
            "competencyText": {"en-us": "understand how multiple dating methods are used to construct the geologic time scale, which represents Earth's approximate 4.6-billion-year history."}
        },
        {
            "competencyText": {"en-us": "Earth in space and time. The student knows that fossils provide evidence for geological and biological evolution. Students are expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate a variety of fossil types such as transitional fossils, proposed transitional fossils, fossil lineages, and significant fossil deposits with regard to their appearance, completeness, and alignment with scientific explanations in light of this fossil data;"}
        },
        {
            "competencyText": {"en-us": "explain how sedimentation, fossilization, and speciation affect the degree of completeness of the fossil record; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the significance of the terminal Permian and Cretaceous mass extinction events, including adaptive radiations of organisms after the events."}
        },
        {
            "competencyText": {"en-us": "Solid Earth. The student knows Earth's interior is differentiated chemically, physically, and thermally. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate heat transfer through Earth's subsystems by radiation, convection, and conduction and include its role in plate tectonics, volcanism, ocean circulation, weather, and climate;"}
        },
        {
            "competencyText": {"en-us": "examine the chemical, physical, and thermal structure of Earth's crust, mantle, and core, including the lithosphere and asthenosphere;"}
        },
        {
            "competencyText": {"en-us": "explain how scientists use geophysical methods such as seismic wave analysis, gravity, and magnetism to interpret Earth's structure; and"}
        },
        {
            "competencyText": {"en-us": "describe the formation and structure of Earth's magnetic field, including its interaction with charged solar particles to form the Van Allen belts and auroras."}
        },
        {
            "competencyText": {"en-us": "Solid Earth. The student knows that plate tectonics is the global mechanism for major geologic processes and that heat transfer, governed by the principles of thermodynamics, is the driving force. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate how new conceptual interpretations of data and innovative geophysical technologies led to the current theory of plate tectonics;"}
        },
        {
            "competencyText": {"en-us": "describe how heat and rock composition affect density within Earth's interior and how density influences the development and motion of Earth's tectonic plates;"}
        },
        {
            "competencyText": {"en-us": "explain how plate tectonics accounts for geologic processes and features, including sea floor spreading, ocean ridges and rift valleys, subduction zones, earthquakes, volcanoes, mountain ranges, hot spots, and hydrothermal vents;"}
        },
        {
            "competencyText": {"en-us": "calculate the motion history of tectonic plates using equations relating rate, time, and distance to predict future motions, locations, and resulting geologic features;"}
        },
        {
            "competencyText": {"en-us": "distinguish the location, type, and relative motion of convergent, divergent, and transform plate boundaries using evidence from the distribution of earthquakes and volcanoes; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the role of plate tectonics with respect to long-term global changes in Earth's subsystems such as continental buildup, glaciation, sea level fluctuations, mass extinctions, and climate change."}
        },
        {
            "competencyText": {"en-us": "Solid Earth. The student knows that the geosphere continuously changes over a range of time scales involving dynamic and complex interactions among Earth's subsystems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "compare the roles of erosion and deposition through the actions of water, wind, ice, gravity, and igneous activity by lava in constantly reshaping Earth's surface;"}
        },
        {
            "competencyText": {"en-us": "explain how plate tectonics accounts for geologic surface processes and features, including folds, faults, sedimentary basin formation, mountain building, and continental accretion;"}
        },
        {
            "competencyText": {"en-us": "analyze changes in continental plate configurations such as Pangaea and their impact on the biosphere, atmosphere, and hydrosphere through time;"}
        },
        {
            "competencyText": {"en-us": "interpret Earth surface features using a variety of methods such as satellite imagery, aerial photography, and topographic and geologic maps using appropriate technologies; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of changes in Earth's subsystems on humans such as earthquakes, tsunamis, volcanic eruptions, hurricanes, flooding, and storm surges and the impact of humans on Earth's subsystems such as population growth, fossil fuel burning, and use of fresh water."}
        },
        {
            "competencyText": {"en-us": "Solid Earth. The student knows that Earth contains energy, water, mineral, and rock resources and that use of these resources impacts Earth's subsystems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "evaluate how the use of energy, water, mineral, and rock resources affects Earth's subsystems;"}
        },
        {
            "competencyText": {"en-us": "describe the formation of fossil fuels, including petroleum and coal;"}
        },
        {
            "competencyText": {"en-us": "discriminate between renewable and nonrenewable resources based upon rate of formation and use;"}
        },
        {
            "competencyText": {"en-us": "analyze the economics of resources from discovery to disposal, including technological advances, resource type, concentration and location, waste disposal and recycling, and environmental costs; and"}
        },
        {
            "competencyText": {"en-us": "explore careers that involve the exploration, extraction, production, use, and disposal of Earth's resources."}
        },
        {
            "competencyText": {"en-us": "Fluid Earth. The student knows that the fluid Earth is composed of the hydrosphere, cryosphere, and atmosphere subsystems that interact on various time scales with the biosphere and geosphere. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "quantify the components and fluxes within the hydrosphere such as changes in polar ice caps and glaciers, salt water incursions, and groundwater levels in response to precipitation events or excessive pumping;"}
        },
        {
            "competencyText": {"en-us": "analyze how global ocean circulation is the result of wind, tides, the Coriolis effect, water density differences, and the shape of the ocean basins;"}
        },
        {
            "competencyText": {"en-us": "analyze the empirical relationship between the emissions of carbon dioxide, atmospheric carbon dioxide levels, and the average global temperature trends over the past 150 years;"}
        },
        {
            "competencyText": {"en-us": "discuss mechanisms and causes such as selective absorbers, major volcanic eruptions, solar luminance, giant meteorite impacts, and human activities that result in significant changes in Earth's climate;"}
        },
        {
            "competencyText": {"en-us": "investigate the causes and history of eustatic sea-level changes that result in transgressive and regressive sedimentary sequences; and"}
        },
        {
            "competencyText": {"en-us": "discuss scientific hypotheses for the origin of life by abiotic chemical processes in an aqueous environment through complex geochemical cycles given the complexity of living systems."}
        },
        {
            "competencyText": {"en-us": "Fluid Earth. The student knows that Earth's global ocean stores solar energy and is a major driving force for weather and climate through complex atmospheric interactions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze the uneven distribution of solar energy on Earth's surface, including differences in atmospheric transparency, surface albedo, Earth's tilt, duration of insolation, and differences in atmospheric and surface absorption of energy;"}
        },
        {
            "competencyText": {"en-us": "investigate how the atmosphere is heated from Earth's surface due to absorption of solar energy, which is re-radiated as thermal energy and trapped by selective absorbers; and"}
        },
        {
            "competencyText": {"en-us": "explain how thermal energy transfer between the ocean and atmosphere drives surface currents, thermohaline currents, and evaporation that influence climate."}
        },
        {
            "competencyText": {"en-us": "Fluid Earth. The student knows that interactions among Earth's five subsystems influence climate and resource availability, which affect Earth's habitability. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe how changing surface-ocean conditions, including El Niño-Southern Oscillation, affect global weather and climate patterns;"}
        },
        {
            "competencyText": {"en-us": "investigate evidence such as ice cores, glacial striations, and fossils for climate variability and its use in developing computer models to explain present and predict future climates;"}
        },
        {
            "competencyText": {"en-us": "quantify the dynamics of surface and groundwater movement such as recharge, discharge, evapotranspiration, storage, residence time, and sustainability;"}
        },
        {
            "competencyText": {"en-us": "explain the global carbon cycle, including how carbon exists in different forms within the five subsystems and how these forms affect life; and"}
        },
        {
            "competencyText": {"en-us": "analyze recent global ocean temperature data to predict the consequences of changing ocean temperature on evaporation, sea level, algal growth, coral bleaching, hurricane intensity, and biodiversity."}
        },
        {
            "competencyText": {"en-us": "Environmental Systems, Beginning with School Year 2010-2011 (One Credit)."},
            "comment": {
                "en-us": ["Source: The provisions of this §112.37 adopted to be effective August 4, 2009, 34 TexReg 5063."]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. Suggested prerequisite: one unit high school life science and one unit of high school physical science. This course is recommended for students in Grade 11 or 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Environmental Systems. In Environmental Systems, students conduct laboratory and field investigations, use scientific methods during investigations, and make informed decisions using critical thinking and scientific problem solving. Students study a variety of topics that include: biotic and abiotic factors in habitats, ecosystems and biomes, interrelationships among resources and an environmental system, sources and flow of energy through an environmental system, relationship between carrying capacity and changes in populations and ecosystems, and changes in environments."}
        },
        {
            "competencyText": {"en-us": "Nature of science. Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific inquiry. Scientific inquiry is the planned and deliberate investigation of the natural world. Scientific methods of investigation can be experimental, descriptive, or comparative. The method chosen should be appropriate to the question being asked."}
        },
        {
            "competencyText": {"en-us": "Science and social ethics. Scientific decision making is a way of answering questions about the natural world. Students should be able to distinguish between scientific decision-making methods and ethical and social decisions that involve the application of scientific information."}
        },
        {
            "competencyText": {"en-us": "Scientific systems. A system is a collection of cycles, structures, and processes that interact. All systems have basic properties that can be described in terms of space, time, energy, and matter. Change and constancy occur in systems as patterns and can be observed, measured, and modeled. These patterns help to make predictions that can be scientifically tested. Students should analyze a system in terms of its components and how these components relate to each other, to the whole, and to the external environment."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student, for at least 40% of instructional time, conducts hands-on laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations, including appropriate first aid responses to accidents that could occur in the field such as insect stings, animal bites, overheating, sprains, and breaks; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses scientific methods during laboratory and field investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"}
        },
        {
            "competencyText": {"en-us": "know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"}
        },
        {
            "competencyText": {"en-us": "know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but may be subject to change as new areas of science and new technologies are developed;"}
        },
        {
            "competencyText": {"en-us": "distinguish between scientific hypotheses and scientific theories;"}
        },
        {
            "competencyText": {"en-us": "follow or plan and implement investigative procedures, including making observations, asking questions, formulating testable hypotheses, and selecting equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "collect data individually or collaboratively, make measurements with precision and accuracy, record values using appropriate units, and calculate statistically relevant quantities to describe data, including mean, median, and range;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the use of course apparatuses, equipment, techniques, and procedures, including meter sticks, rulers, pipettes, graduated cylinders, triple beam balances, timing devices, pH meters or probes, thermometers, calculators, computers, Internet access, turbidity testing devices, hand magnifiers, work and disposable gloves, compasses, first aid kits, binoculars, field guides, water quality test kits or probes, soil test kits or probes, 100-foot appraiser's tapes, tarps, shovels, trowels, screens, buckets, and rock and mineral samples;"}
        },
        {
            "competencyText": {"en-us": "use a wide variety of additional course apparatuses, equipment, techniques, materials, and procedures as appropriate such as air quality testing devices, cameras, flow meters, Global Positioning System (GPS) units, Geographic Information System (GIS) software, computer models, densiometers, clinometers, and field journals;"}
        },
        {
            "competencyText": {"en-us": "organize, analyze, evaluate, build models, make inferences, and predict trends from data;"}
        },
        {
            "competencyText": {"en-us": "perform calculations using dimensional analysis, significant digits, and scientific notation; and"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions supported by the data through methods such as lab reports, labeled drawings, graphic organizers, journals, summaries, oral reports, and technology-based reports."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"}
        },
        {
            "competencyText": {"en-us": "draw inferences based on data related to promotional materials for products and services;"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of research on scientific thought, society, and the environment;"}
        },
        {
            "competencyText": {"en-us": "describe the connection between environmental science and future careers; and"}
        },
        {
            "competencyText": {"en-us": "research and describe the history of environmental science and contributions of scientists."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the relationships of biotic and abiotic factors within habitats, ecosystems, and biomes. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify native plants and animals using a dichotomous key;"}
        },
        {
            "competencyText": {"en-us": "assess the role of native plants and animals within a local ecosystem and compare them to plants and animals in ecosystems within four other biomes;"}
        },
        {
            "competencyText": {"en-us": "diagram abiotic cycles, including the rock, hydrologic, carbon, and nitrogen cycles;"}
        },
        {
            "competencyText": {"en-us": "make observations and compile data about fluctuations in abiotic cycles and evaluate the effects of abiotic factors on local ecosystems and local biomes;"}
        },
        {
            "competencyText": {"en-us": "measure the concentration of solute, solvent, and solubility of dissolved substances such as dissolved oxygen, chlorides, and nitrates and describe their impact on an ecosystem;"}
        },
        {
            "competencyText": {"en-us": "predict how the introduction or removal of an invasive species may alter the food chain and affect existing populations in an ecosystem;"}
        },
        {
            "competencyText": {"en-us": "predict how species extinction may alter the food chain and affect existing populations in an ecosystem; and"}
        },
        {
            "competencyText": {"en-us": "research and explain the causes of species diversity and predict changes that may occur in an ecosystem if species and genetic diversity is increased or reduced."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the interrelationships among the resources within the local environmental system. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "summarize methods of land use and management and describe its effects on land fertility;"}
        },
        {
            "competencyText": {"en-us": "identify source, use, quality, management, and conservation of water;"}
        },
        {
            "competencyText": {"en-us": "document the use and conservation of both renewable and non-renewable resources as they pertain to sustainability;"}
        },
        {
            "competencyText": {"en-us": "identify renewable and non-renewable resources that must come from outside an ecosystem such as food, water, lumber, and energy;"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate the economic significance and interdependence of resources within the environmental system; and"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of waste management methods such as reduction, reuse, recycling, and composting on resource availability."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the sources and flow of energy through an environmental system. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "define and identify the components of the geosphere, hydrosphere, cryosphere, atmosphere, and biosphere and the interactions among them;"}
        },
        {
            "competencyText": {"en-us": "describe and compare renewable and non-renewable energy derived from natural and alternative sources such as oil, natural gas, coal, nuclear, solar, geothermal, hydroelectric, and wind;"}
        },
        {
            "competencyText": {"en-us": "explain the flow of energy in an ecosystem, including conduction, convection, and radiation;"}
        },
        {
            "competencyText": {"en-us": "investigate and explain the effects of energy transformations in terms of the laws of thermodynamics within an ecosystem; and"}
        },
        {
            "competencyText": {"en-us": "investigate and identify energy interactions in an ecosystem."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the relationship between carrying capacity and changes in populations and ecosystems. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "relate carrying capacity to population dynamics;"}
        },
        {
            "competencyText": {"en-us": "calculate birth rates and exponential growth of populations;"}
        },
        {
            "competencyText": {"en-us": "analyze and predict the effects of non-renewable resource depletion; and"}
        },
        {
            "competencyText": {"en-us": "analyze and make predictions about the impact on populations of geographic locales due to diseases, birth and death rates, urbanization, and natural events such as migration and seasonal changes."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that environments change naturally. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze and describe the effects on areas impacted by natural events such as tectonic movement, volcanic events, fires, tornadoes, hurricanes, flooding, tsunamis, and population growth;"}
        },
        {
            "competencyText": {"en-us": "explain how regional changes in the environment may have a global effect;"}
        },
        {
            "competencyText": {"en-us": "examine how natural processes such as succession and feedback loops restore habitats and ecosystems;"}
        },
        {
            "competencyText": {"en-us": "describe how temperature inversions impact weather conditions, including El Niño and La Niña oscillations; and"}
        },
        {
            "competencyText": {"en-us": "analyze the impact of temperature inversions on global warming, ice cap and glacial melting, and changes in ocean currents and surface temperatures."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the impact of human activities on the environment. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "identify causes of air, soil, and water pollution, including point and nonpoint sources;"}
        },
        {
            "competencyText": {"en-us": "investigate the types of air, soil, and water pollution such as chlorofluorocarbons, carbon dioxide, pH, pesticide runoff, thermal variations, metallic ions, heavy metals, and nuclear waste;"}
        },
        {
            "competencyText": {"en-us": "examine the concentrations of air, soil, and water pollutants using appropriate units;"}
        },
        {
            "competencyText": {"en-us": "describe the effect of pollution on global warming, glacial and ice cap melting, greenhouse effect, ozone layer, and aquatic viability;"}
        },
        {
            "competencyText": {"en-us": "evaluate the effect of human activities, including habitat restoration projects, species preservation efforts, nature conservancy groups, hunting, fishing, ecotourism, all terrain vehicles, and small personal watercraft, on the environment;"}
        },
        {
            "competencyText": {"en-us": "evaluate cost-benefit trade-offs of commercial activities such as municipal development, farming, deforestation, over-harvesting, and mining;"}
        },
        {
            "competencyText": {"en-us": "analyze how ethical beliefs can be used to influence scientific practices such as methods for increasing food production;"}
        },
        {
            "competencyText": {"en-us": "analyze and evaluate different views on the existence of global warming;"}
        },
        {
            "competencyText": {"en-us": "discuss the impact of research and technology on social ethics and legal practices in situations such as the design of new buildings, recycling, or emission standards;"}
        },
        {
            "competencyText": {"en-us": "research the advantages and disadvantages of \"going green\" such as organic gardening and farming, natural methods of pest control, hydroponics, xeriscaping, energy-efficient homes and appliances, and hybrid cars;"}
        },
        {
            "competencyText": {"en-us": "analyze past and present local, state, and national legislation, including Texas automobile emissions regulations, the National Park Service Act, the Clean Air Act, the Clean Water Act, the Soil and Water Resources Conservation Act, and the Endangered Species Act; and"}
        },
        {
            "competencyText": {"en-us": "analyze past and present international treaties and protocols such as the environmental Antarctic Treaty System, Montreal Protocol, and Kyoto Protocol."}
        },
        {
            "competencyText": {"en-us": "Integrated Physics and Chemistry (One Credit), Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.38 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. Prerequisites: none. This course is recommended for students in Grade 9 or 10."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Integrated Physics and Chemistry. In Integrated Physics and Chemistry, students conduct laboratory and field investigations, use scientific practices during investigation, and make informed decisions using critical thinking and scientific problem solving. This course integrates the disciplines of physics and chemistry in the following topics: force, motion, energy, and matter."}
        },
        {
            "competencyText": {"en-us": "Nature of science. Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not currently scientifically testable."}
        },
        {
            "competencyText": {"en-us": "Scientific inquiry. Scientific inquiry is the planned and deliberate investigation of the natural world. Scientific methods of investigation are experimental, descriptive, or comparative. The method chosen should be appropriate to the question being asked."}
        },
        {
            "competencyText": {"en-us": "Science and social ethics. Scientific decision making is a way of answering questions about the natural world. Students should be able to distinguish between scientific decision-making methods (scientific methods) and ethical and social decisions that involve science (the application of scientific information)."}
        },
        {
            "competencyText": {"en-us": "Science, systems, and models. A system is a collection of cycles, structures, and processes that interact. All systems have basic properties that can be described in space, time, energy, and matter. Change and constancy occur in systems as patterns and can be observed, measured, and modeled. These patterns help to make predictions that can be scientifically tested. Students should analyze a system in terms of its components and how these components relate to each other, to the whole, and to the external environment."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations, including the appropriate use of safety showers, eyewash fountains, safety goggles or chemical splash goggles, as appropriate, and fire extinguishers;"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses scientific practices during laboratory and field investigations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"}
        },
        {
            "competencyText": {"en-us": "plan and implement investigative procedures, including asking questions, formulating testable hypotheses, and selecting equipment and technology;"}
        },
        {
            "competencyText": {"en-us": "collect data and make measurements with accuracy and precision;"}
        },
        {
            "competencyText": {"en-us": "organize, analyze, evaluate, make inferences, and predict trends from data; and"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions supported by the data through methods such as lab reports, labeled drawings, graphs, journals, summaries, oral reports, and technology-based reports."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "communicate and apply scientific information extracted from various sources such as current events, published journal articles, and marketing materials;"}
        },
        {
            "competencyText": {"en-us": "draw inferences based on data related to promotional materials for products and services;"}
        },
        {
            "competencyText": {"en-us": "evaluate the impact of research on scientific thought, society, and the environment;"}
        },
        {
            "competencyText": {"en-us": "describe connections between physics and chemistry and future careers; and"}
        },
        {
            "competencyText": {"en-us": "research and describe the history of physics and chemistry and contributions of scientists."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows concepts of force and motion evident in everyday life. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe and calculate an object's motion in terms of position, displacement, speed, and acceleration;"}
        },
        {
            "competencyText": {"en-us": "measure and graph distance and speed as a function of time;"}
        },
        {
            "competencyText": {"en-us": "investigate how an object's motion changes only when a net force is applied, including activities and equipment such as toy cars, vehicle restraints, sports activities, and classroom objects;"}
        },
        {
            "competencyText": {"en-us": "describe and calculate the relationship between force, mass, and acceleration using equipment such as dynamic carts, moving toys, vehicles, and falling objects;"}
        },
        {
            "competencyText": {"en-us": "explain the concept of conservation of momentum using action and reaction forces;"}
        },
        {
            "competencyText": {"en-us": "describe the gravitational attraction between objects of different masses at different distances; and"}
        },
        {
            "competencyText": {"en-us": "examine electrical force as a universal force between any two charged objects."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student recognizes multiple forms of energy and knows the impact of energy transfer and energy conservation in everyday life. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "recognize and demonstrate that objects and substances in motion have kinetic energy such as vibration of atoms, water flowing down a stream moving pebbles, and bowling balls knocking down pins;"}
        },
        {
            "competencyText": {"en-us": "recognize and demonstrate common forms of potential energy, including gravitational, elastic, and chemical, such as a ball on an inclined plane, springs, and batteries;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that moving electric charges produce magnetic forces and moving magnets produce electric forces;"}
        },
        {
            "competencyText": {"en-us": "investigate the law of conservation of energy;"}
        },
        {
            "competencyText": {"en-us": "investigate and demonstrate the movement of thermal energy through solids, liquids, and gases by convection, conduction, and radiation such as in weather, living, and mechanical systems;"}
        },
        {
            "competencyText": {"en-us": "evaluate the transfer of electrical energy in series and parallel circuits and conductive materials;"}
        },
        {
            "competencyText": {"en-us": "explore the characteristics and behaviors of energy transferred by waves, including acoustic, seismic, light, and waves on water, as they reflect, refract, diffract, interfere with one another, and are absorbed by materials;"}
        },
        {
            "competencyText": {"en-us": "analyze energy transformations of renewable and nonrenewable resources; and"}
        },
        {
            "competencyText": {"en-us": "critique the advantages and disadvantages of various energy sources and their impact on society and the environment."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that relationships exist between the structure and properties of matter. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "examine differences in physical properties of solids, liquids, and gases as explained by the arrangement and motion of atoms or molecules;"}
        },
        {
            "competencyText": {"en-us": "relate chemical properties of substances to the arrangement of their atoms;"}
        },
        {
            "competencyText": {"en-us": "analyze physical and chemical properties of elements and compounds such as color, density, viscosity, buoyancy, boiling point, freezing point, conductivity, and reactivity;"}
        },
        {
            "competencyText": {"en-us": "relate the placement of an element on the Periodic Table to its physical and chemical behavior, including bonding and classification;"}
        },
        {
            "competencyText": {"en-us": "relate the structure of water to its function as a solvent; and"}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that changes in matter affect everyday life. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate changes of state as it relates to the arrangement of particles of matter and energy transfer;"}
        },
        {
            "competencyText": {"en-us": "recognize that chemical changes can occur when substances react to form different substances and that these interactions are largely determined by the valence electrons;"}
        },
        {
            "competencyText": {"en-us": "demonstrate that mass is conserved when substances undergo chemical change and that the number and kind of atoms are the same in the reactants and products;"}
        },
        {
            "competencyText": {"en-us": "classify energy changes that accompany chemical reactions such as those occurring in heat packs, cold packs, and glow sticks as exothermic or endothermic reactions;"}
        },
        {
            "competencyText": {"en-us": "describe types of nuclear reactions such as fission and fusion and their roles in applications such as medicine and energy production; and"}
        },
        {
            "competencyText": {"en-us": "research and describe the environmental and economic impact of the end-products of chemical reactions such as those that may result in acid rain, degradation of water and air quality, and ozone depletion."}
        },
        {
            "competencyText": {"en-us": "Physics (One Credit), Adopted 2017."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.39 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "General requirements. Students shall be awarded one credit for successful completion of this course. Algebra I is suggested as a prerequisite or corequisite. This course is recommended for students in Grade 9, 10, 11, or 12."}
        },
        {
            "competencyText": {"en-us": "Introduction."}
        },
        {
            "competencyText": {"en-us": "Physics. In Physics, students conduct laboratory and field investigations, use scientific practices during investigations, and make informed decisions using critical thinking and scientific problem solving. Students study a variety of topics that include: laws of motion; changes within physical systems and conservation of energy and momentum; forces; thermodynamics; characteristics and behavior of waves; and atomic, nuclear, and quantum physics. Students who successfully complete Physics will acquire factual knowledge within a conceptual framework, practice experimental design and interpretation, work collaboratively with colleagues, and develop critical-thinking skills."}
        },
        {
            "competencyText": {"en-us": "Nature of science. Science, as defined by the National Academy of Sciences, is the \"use of evidence to construct testable explanations and predictions of natural phenomena, as well as the knowledge generated through this process.\" This vast body of changing and increasing knowledge is described by physical, mathematical, and conceptual models. Students should know that some questions are outside the realm of science because they deal with phenomena that are not currently scientifically testable by empirical science."}
        },
        {
            "competencyText": {"en-us": "Scientific inquiry. Scientific inquiry is the planned and deliberate investigation of the natural world. Scientific methods of investigation can be experimental, descriptive, or comparative. The method chosen should be appropriate to the question being asked."}
        },
        {
            "competencyText": {"en-us": "Science and social ethics. Scientific decision making is a way of answering questions about the natural world. Students should be able to distinguish between scientific decision-making methods and ethical and social decisions that involve the application of scientific information."}
        },
        {
            "competencyText": {"en-us": "Scientific systems. A system is a collection of cycles, structures, and processes that interact. All systems have basic properties that can be described in terms of space, time, energy, and matter. Change and constancy occur in systems as patterns and can be observed, measured, and modeled. These patterns help to make predictions that can be scientifically tested. Students should analyze a system in terms of its components and how these components relate to each other, to the whole, and to the external environment."}
        },
        {
            "competencyText": {"en-us": "Knowledge and skills."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student conducts investigations, for at least 40% of instructional time, using safe, environmentally appropriate, and ethical practices. These investigations must involve actively obtaining and analyzing data with physical equipment but may also involve experimentation in a simulated environment as well as field observations that extend beyond the classroom. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "demonstrate safe practices during laboratory and field investigations; and"}
        },
        {
            "competencyText": {"en-us": "demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses a systematic approach to answer scientific laboratory and field investigative questions. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"}
        },
        {
            "competencyText": {"en-us": "know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence;"}
        },
        {
            "competencyText": {"en-us": "know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well established and highly reliable explanations, but may be subject to change;"}
        },
        {
            "competencyText": {"en-us": "design and implement investigative procedures, including making observations, asking well defined questions, formulating testable hypotheses, identifying variables, selecting appropriate equipment and technology, evaluating numerical answers for reasonableness, and identifying causes and effects of uncertainties in measured data;"}
        },
        {
            "competencyText": {"en-us": "demonstrate the use of course apparatus, equipment, techniques, and procedures, including multimeters (current, voltage, resistance), balances, batteries, dynamics demonstration equipment, collision apparatus, lab masses, magnets, plane mirrors, convex lenses, stopwatches, trajectory apparatus, graph paper, magnetic compasses, protractors, metric rulers, spring scales, thermometers, slinky springs, and/or other equipment and materials that will produce the same results;"}
        },
        {
            "competencyText": {"en-us": "use a wide variety of additional course apparatus, equipment, techniques, materials, and procedures as appropriate such as ripple tank with wave generator, wave motion rope, tuning forks, hand-held visual spectroscopes, discharge tubes with power supply (H, He, Ne, Ar), electromagnetic spectrum charts, laser pointers, micrometer, caliper, computer, data acquisition probes, scientific calculators, graphing technology, electrostatic kits, electroscope, inclined plane, optics bench, optics kit, polarized film, prisms, pulley with table clamp, motion detectors, photogates, friction blocks, ballistic carts or equivalent, resonance tube, stroboscope, resistors, copper wire, switches, iron filings, and/or other equipment and materials that will produce the same results;"}
        },
        {
            "competencyText": {"en-us": "make measurements with accuracy and precision and record data using scientific notation and International System (SI) units;"}
        },
        {
            "competencyText": {"en-us": "organize, evaluate, and make inferences from data, including the use of tables, charts, and graphs;"}
        },
        {
            "competencyText": {"en-us": "communicate valid conclusions supported by the data through various methods such as lab reports, labeled drawings, graphic organizers, journals, summaries, oral reports, and technology-based reports; and"}
        },
        {
            "competencyText": {"en-us": "express relationships among physical variables quantitatively, including the use of graphs, charts, and equations."}
        },
        {
            "competencyText": {"en-us": "Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, so as to encourage critical thinking by the student;"}
        },
        {
            "competencyText": {"en-us": "communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"}
        },
        {
            "competencyText": {"en-us": "explain the impacts of the scientific contributions of a variety of historical and contemporary scientists on scientific thought and society;"}
        },
        {
            "competencyText": {"en-us": "research and describe the connections between physics and future careers; and"}
        },
        {
            "competencyText": {"en-us": "express, manipulate, and interpret relationships symbolically in accordance with accepted theories to make predictions and solve problems mathematically."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows and applies the laws governing motion in a variety of situations. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "generate and interpret graphs and charts describing different types of motion, including investigations using real-time technology such as motion detectors or photogates;"}
        },
        {
            "competencyText": {"en-us": "describe and analyze motion in one dimension using equations and graphical vector addition with the concepts of distance, displacement, speed, average velocity, instantaneous velocity, frames of reference, and acceleration;"}
        },
        {
            "competencyText": {"en-us": "analyze and describe accelerated motion in two dimensions, including using equations, graphical vector addition, and projectile and circular examples; and"}
        },
        {
            "competencyText": {"en-us": "calculate the effect of forces on objects, including the law of inertia, the relationship between force and acceleration, and the nature of force pairs between objects using methods, including free-body force diagrams."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the nature of forces in the physical world. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the concepts of gravitational, electromagnetic, weak nuclear, and strong nuclear forces;"}
        },
        {
            "competencyText": {"en-us": "describe and calculate how the magnitude of the gravitational force between two objects depends on their masses and the distance between their centers;"}
        },
        {
            "competencyText": {"en-us": "describe and calculate how the magnitude of the electric force between two objects depends on their charges and the distance between their centers;"}
        },
        {
            "competencyText": {"en-us": "identify and describe examples of electric and magnetic forces and fields in everyday life such as generators, motors, and transformers;"}
        },
        {
            "competencyText": {"en-us": "characterize materials as conductors or insulators based on their electric properties; and"}
        },
        {
            "competencyText": {"en-us": "investigate and calculate current through, potential difference across, resistance of, and power used by electric circuit elements connected in both series and parallel combinations."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows that changes occur within a physical system and applies the laws of conservation of energy and momentum. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "investigate and calculate quantities using the work-energy theorem in various situations;"}
        },
        {
            "competencyText": {"en-us": "investigate examples of kinetic and potential energy and their transformations;"}
        },
        {
            "competencyText": {"en-us": "calculate the mechanical energy of, power generated within, impulse applied to, and momentum of a physical system;"}
        },
        {
            "competencyText": {"en-us": "demonstrate and apply the laws of conservation of energy and conservation of momentum in one dimension; and"}
        },
        {
            "competencyText": {"en-us": "explain everyday examples that illustrate the four laws of thermodynamics and the processes of thermal energy transfer."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows the characteristics and behavior of waves. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "examine and describe oscillatory motion and wave propagation in various types of media;"}
        },
        {
            "competencyText": {"en-us": "investigate and analyze characteristics of waves, including velocity, frequency, amplitude, and wavelength, and calculate using the relationship between wavespeed, frequency, and wavelength;"}
        },
        {
            "competencyText": {"en-us": "compare characteristics and behaviors of transverse waves, including electromagnetic waves and the electromagnetic spectrum, and characteristics and behaviors of longitudinal waves, including sound waves;"}
        },
        {
            "competencyText": {"en-us": "investigate behaviors of waves, including reflection, refraction, diffraction, interference, resonance, and the Doppler effect; and"}
        },
        {
            "competencyText": {"en-us": "describe and predict image formation as a consequence of reflection from a plane mirror and refraction through a thin convex lens."}
        },
        {
            "competencyText": {"en-us": "Science concepts. The student knows simple examples of atomic, nuclear, and quantum phenomena. The student is expected to:"}
        },
        {
            "competencyText": {"en-us": "describe the photoelectric effect and the dual nature of light;"}
        },
        {
            "competencyText": {"en-us": "compare and explain the emission spectra produced by various atoms;"}
        },
        {
            "competencyText": {"en-us": "calculate and describe the applications of mass-energy equivalence; and"}
        },
        {
            "competencyText": {"en-us": "give examples of applications of atomic and nuclear phenomena using the standard model such as nuclear stability, fission and fusion, radiation therapy, diagnostic imaging, semiconductors, superconductors, solar cells, and nuclear power and examples of applications of quantum phenomena."}
        },
        {
            "competencyText": {"en-us": "Implementation of Texas Essential Knowledge and Skills for Science, High School."},
            "comment": {
                "en-us": [
                    "Source: The provisions of this §112.31 adopted to be effective August 4, 2009, 34 TexReg 5063",
                    " amended to be effective August 24, 2010, 35 TexReg 7230",
                    " amended to be effective August 27, 2018, 42 TexReg 5052."
                ]
            }
        },
        {
            "competencyText": {"en-us": "The provisions of this subchapter shall be implemented by school districts."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "classify objects by the materials from which they are made."}
        },
        {
            "competencyText": {"en-us": "A central theme throughout the study of scientific investigation and reasoning; matter and energy; force, motion, and energy; Earth and space; and organisms and environment is active engagement in asking questions, creating a method to answer those questions, answering those questions, communicating ideas, and exploring with scientific tools. Scientific investigation and reasoning involves practicing safe procedures, asking questions about the natural world, and seeking answers to those questions through simple observations used in descriptive investigations."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Within the physical environment, students know about the physical properties of matter including mass, volume, states of matter, temperature, magnetism, and the ability to sink or float. Students will differentiate among forms of energy including mechanical, light, sound, and thermal energy. Students will explore electrical circuits and design descriptive investigations to explore the effect of force on objects."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "identify fossils as evidence of past living organisms and the nature of the environments at the time using models."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "differentiate between empirical and molecular formulas;"}
        },
        {
            "competencyText": {"en-us": "differentiate among double replacement reactions, including acid-base reactions and precipitation reactions, and oxidation-reduction reactions such as synthesis, decomposition, single replacement, and combustion reactions;"}
        },
        {
            "competencyText": {"en-us": "describe the concept of limiting reactants in a balanced chemical equation."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "know specific hazards of chemical substances such as flammability, corrosiveness, and radioactivity as summarized on the Safety Data Sheets (SDS); and"}
        },
        {
            "competencyText": {"en-us": "investigate the properties of water solutions and factors affecting solid solubility, including nature of solute, temperature, and concentration."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "Statements containing the word \"including\" reference content that must be mastered, while those containing the phrase \"such as\" are intended as possible illustrative examples."}
        },
        {
            "competencyText": {"en-us": "The provisions of §§112.34, 112.35, 112.38, and 112.39 of this subchapter adopted in 2017 shall be implemented by school districts beginning with the 2018-2019 school year."}
        }
    ]
}